[
  {
    "title": "*GET/*VGET Sheet",
    "author": "(PADT)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Get_Summary_2005_08_15.pdf",
    "description": "This is a handy sheet with *GET and *VGET items. A user can print this out as a reference sheet when writing APDL macros."
  },
  {
    "title": "Techniques for Successfully Using ANSYS Contact Elements",
    "author": "Rich Bothmann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/051805_maug_contact_presentation.pdf",
    "description": "Presentation from the Midwest ANSYS User Group\n[ANSYS Nonlinear, version 9.0]"
  },
  {
    "title": "Topology Optimization in ANSYS",
    "author": "Brian King (IMPACT Engineering Solutions, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/051805_maug_topology_optimization_presentation.pdf",
    "description": "Presentation from Midwest ANSYS User Group on Topological Optimization capability in ANSYS and Workbench Simulation."
  },
  {
    "title": "10.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/10.pdf",
    "description": "10.pdf"
  },
  {
    "title": "An Architecture for Fluid/Structure Analysis of Turbomachinery Blading",
    "author": "David A. Johnston, Charles J. Cross, J. Mitch Wolff",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/10_0130_Cross_paper.pdf",
    "description": "\"Aeroelastic stability and response analyses used in the design of turbomachinery blading are typically uncoupled: the unsteady aerodynamics and structural dynamics are treated in separate models, with boundary conditions sequentially updated after stationary periodic convergence is met. Higher fidelity simulations are achieved by coupling the fluid and structure domains such that boundary conditions are updated once or several times per physical time step of the simulation.\"\"As a starting point, the turbomachinery CFD research code TURBO (Chen and Briley, 2001) and the commercial structural solver ANSYSŪ has been chosen for coupling, although FSI is designed with modularity for future inclusion of other fluid and structural solvers.\"\n[ANSYS Dynamics, version unspecified]"
  },
  {
    "title": "12.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/12.pdf",
    "description": "12.pdf"
  },
  {
    "title": "13_4.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/13_4.pdf",
    "description": "13_4.pdf"
  },
  {
    "title": "180 Series Elements: Why Should One Use Them in Linear Analysis",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/180xAdvantages.pdf",
    "description": "Presentation on 18x elements (continuum, beam, shell) and its features related to both linear and nonlinear analyses."
  },
  {
    "title": "1998imaps_taiwan.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/1998imaps_taiwan.pdf",
    "description": "1998imaps_taiwan.pdf"
  },
  {
    "title": "1_4_4.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/1_4_4.pdf",
    "description": "1_4_4.pdf"
  },
  {
    "title": "20010202.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/20010202.pdf",
    "description": "20010202.pdf"
  },
  {
    "title": "200711956.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/200711956.pdf",
    "description": "200711956.pdf"
  },
  {
    "title": "2012-optimum_csp_underfill.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/2012-optimum_csp_underfill.pdf",
    "description": "2012-optimum_csp_underfill.pdf"
  },
  {
    "title": "21.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/21.pdf",
    "description": "21.pdf"
  },
  {
    "title": "22x Coupled-Field Elements [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI0602_Coupled-Field_Elements.pdf",
    "description": "\"The 22x direct coupled-field elements (PLANE223, SOLID226-227) provide a wide array of material behavior for multiphysics applications - these include piezoelectricity, piezoresistivity, thermoelasticity, and thermoelectricity. This memo hopes to introduce some of the pertinent features of these elements.\""
  },
  {
    "title": "25.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/25.pdf",
    "description": "25.pdf"
  },
  {
    "title": "2522-3EN.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/2522-3EN.pdf",
    "description": "2522-3EN.pdf"
  },
  {
    "title": "26.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/26.pdf",
    "description": "26.pdf"
  },
  {
    "title": "3-Dimensional thermal analysis and active cooling of short-length high-power fiber lasers",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/89E56210-BDB9-137E-C5E99E1403B17F75_83733.pdf",
    "description": "A fully 3-dimensional finite element model has been developed that simulates the internal temperature distribution of short-length high-power fiber lasers. We have validated the numerical model by building a short, cladding-pumped, Er-Yb-codoped fiber laser and measuring the core temperature during laser operation. A dual-end-pumped, actively cooled, fiber laser has generated >11 W CW output power at 1535 nm from only 11.9 cm of active fiber. Simulations indicate power-scaling possibilities with improved fiber and cooling designs."
  },
  {
    "title": "3964aeng.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/3964aeng.pdf",
    "description": "3964aeng.pdf"
  },
  {
    "title": "Multi-Criteria Shape Optimization of a Funnel in Cathode Ray Tubes Using Response Surface Model",
    "author": "Tae Hee Lee, Kwangki Lee, Kwang Soon Lee",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/3rdASMO-UK-THLeeKKLee.pdf",
    "description": "\"The ultimate goal of simulation that represents the behaviour of structures is to optimize their response performances within the specific requirements and needs with respect to the design variables. The first step of the design of cathode ray tubes is to design the glass geometry, called funnel geometry, to endure the vacuum stress because it is a main structure of cathode ray tubes. In order to create 3-dimensional funnel geometry in the cathode ray tubes, higher order response surface model is used instead of NURBS (non-uniform rational B-splines) or Bezier curve because it is more robust for understanding the geometry change in finite element analysis. By combining finite element analysis, response surface model and sequential quadratic programming within the process integration framework, the shape optimization of a funnel is successfully performed and the maximum stress is reduced to almost half of the current one.\""
  },
  {
    "title": "51ectc_outstanding_poster.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/51ectc_outstanding_poster.pdf",
    "description": "51ectc_outstanding_poster.pdf"
  },
  {
    "title": "Understanding Accuracy and Discretization Error in an FEA Model",
    "author": "Jon Pointer",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/54.pdf",
    "description": "\"The often-ignored topic of mesh discretization error is examined to identify a simple set of rules that the average user can enlist to determine solution accuracy. The sources of discretization error are explained, tools to quantify it are introduced and an example is given. The purpose is to bring an understanding of these issues and usable tools to the common user who is not proficient in the mathematical basis of FEA.\"\n\n[ANSYS 7.1, 2004 Conference]"
  },
  {
    "title": "56.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/56.pdf",
    "description": "56.pdf"
  },
  {
    "title": "587.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/587.pdf",
    "description": "587.pdf"
  },
  {
    "title": "5B1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/5B1.pdf",
    "description": "5B1.pdf"
  },
  {
    "title": "772.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/772.pdf",
    "description": "772.pdf"
  },
  {
    "title": "Mesh Discretization Error and Criteria for Accuracy of Finite Element Solutions",
    "author": "Chandresh Shah",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/9.pdf",
    "description": "\"Any finite element analysis performed by an engineer is subject to several types of errors that can compromise the validity of the results. These errors can be broadly classified under the following categories: 1) user error - incorrect usage of FE software or input by the FE analyst, 2) errors due to assumptions and simplifications used in the model and 3) errors due to insufficient mesh discretization. User errors can be prevented by developing and utilizing a comprehensive pre and post processing checklist and by appropriate training in the basics of finite element analysis and usage of FE software. Errors due to modeling assumptions and simplifications can be alleviated by adding complexity to the model so that it better represents the physics of the problem being analyzed. Errors due to the inadequacy or coarseness of the mesh are often overlooked by the analyst. These errors due to mesh discretization can be fixed by evaluating the quality of the mesh and by developing and utilizing criteria that characterize the accuracy of the FE solution. This paper describes the source of mesh discretization error and presents several criteria that can be used by an FE analyst to evaluate the accuracy of the FE solution.\"\n\n[ANSYS 5.7, 2002 Conference] "
  },
  {
    "title": "9601-010.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/9601-010.pdf",
    "description": "9601-010.pdf"
  },
  {
    "title": "98-102.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/98-102.pdf",
    "description": "98-102.pdf"
  },
  {
    "title": "A23417.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/A23417.pdf",
    "description": "A23417.pdf"
  },
  {
    "title": "ANSYS Cast Iron Material Model Matches Experimental Data",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/cast_iron.doc.pdf",
    "description": "\"[The purpose of this paper is to] verify the accuracy of the ANSYS cast iron material model. Results from ANSYS are compared with experimental data for a biaxially loaded cruciform geometry.\""
  },
  {
    "title": "ANSYS news",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/ansys_news_1996_1.pdf",
    "description": "First Issue of ANSYS News"
  },
  {
    "title": "ANSYS_Function_Builder.pdf",
    "author": "Achuth Rao (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/ANSYS_Function_Builder.pdf",
    "description": "When using the ANSYS Function Editor and Function Loader to define Function Boundary Conditions, a special type of table is used. This document outlines the syntax of the function loading table."
  },
  {
    "title": "ANSYS_University_Support_Program.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/ANSYS_University_Support_Program.pdf",
    "description": "ANSYS_University_Support_Program.pdf"
  },
  {
    "title": "Analyzing Hyperelastic Materials w/ Some Practical Considerations",
    "author": "Paris Altidis and Vince Adams",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ANSYS_Users_Group_Hyperelastic_Materials.pdf",
    "description": "Presentation from the Midwest ANSYS User Group\n[ANSYS Nonlinear, version unspecified]"
  },
  {
    "title": "ANSYS_distributed_tutorial_8.1.zip",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ANSYS_distributed_tutorial_8.1.zip",
    "description": "This is a document for ANSYS 8.1 distributed solvers and how to set them up, specifically for Windows and Linux."
  },
  {
    "title": "APDL Coding Standards [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI05_APDL_Coding_Standards.pdf",
    "description": "\"Because of the flexibility and automation APDL (ANSYS Parametric Design Language) provides, many users tend to write input files and macros in addition to using the GUI.\nThere are currently no recognized ‘standards’ of writing APDL macros or input files, although there may exist standards within companies on APDL coding. The lack of APDL coding standards may make inheriting someone else’s input files or macros more difficult. Also, parameter or component conflicts may also arise when using multiple macros.\nThis memo hopes to provide some ideas for groups or individuals wishing to develop APDL standards in writing macros or input files.\""
  },
  {
    "title": "ARTICLE1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ARTICLE1.pdf",
    "description": "ARTICLE1.pdf"
  },
  {
    "title": "Anisotropic Plasticity and Failure Prediction in Wood Composites",
    "author": "David M. Moses, Helmut G.L. Prion",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/anisotropic_plasticity_failure_prediction_wood.pdf",
    "description": "\"Two case studies are summarized using anisotropic plasticity and the Weibull weakest link failure model to predict the behavior of wood and wood composites. The linear elastic orthotropic model normally used for wood is shown to be insufficient for the prediction of ultimate strength in wood. Non-linear, non-recoverable behavior in compression in each of the orthogonal material directions is of particular interest in cases where localized crushing governs the load-displacement behavior of wood.\"\r\n \r\n \"The anisotropic plasticity option in ANSYS was used to predict yielding and post-yield behavior for the wood composite used in this study because yield stresses in orthogonal directions were found to be in the ratio of 1:1.2:5. A user-programmable Fortran subroutine was developed for ANSYS to carry out the failure analysis (and to calculate the volume integration of the stresses) at each load-step in post-processing. The model was verified using two cases: I) the ASTM D143 shear block test, and II) bolted connections.\""
  },
  {
    "title": "Integrating ANSYS with Modern Numerical Optimization Technologies",
    "author": "Shen-Yeh Chen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/Ans-Mag1b.pdf",
    "description": "\"Design automation with finite element analysis as a simulation and evaluation tool is becoming more and more desired. The ability to do automatic design iteration has constantly been a popular research and engineering topic. In this article, we will show how Honeywell Engines & Systems took advantage of the flexible environment of ANSYS to achieve this goal.\" (Optimization, APDL)"
  },
  {
    "title": "Ansys_PT_EEC.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Ansys_PT_EEC.pdf",
    "description": "Ansys_PT_EEC.pdf"
  },
  {
    "title": "Artigo.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Artigo.pdf",
    "description": "Artigo.pdf"
  },
  {
    "title": "An Efficient FETI Implementation on Distributed Shared Memory Machines with Independent Numbers of Subdomains and Processors",
    "author": "Michel Lesoinne and Kendall Pierson",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/B0-8218-0988-1-03024-7.pdf",
    "description": "\"Until now, many implementations of the FETI method have been designed either as sequential codes on a single CPU, or as parallel implementations with a One Subdomain per Processor approach. This approach has been particularly typical of implementations on distributed memory architectures such as the IBM SP2. In the last couple of years, several computer manufacturers have introduced new machines with a Distributed Shared Memory (DSM) programming model {e.g. SGI Origin 2000, or HP Exemplar. In such architectures, the physical memory is distributed among the processors or CPU boards but any memory location can be accessed logically by any CPU independently of where the particular memory page being accessed has physically been allocated. As more and more machines of this type are available with a relatively small number of processors, the interest in implementing FETI with an independent number of subdomains and processor has increased. We report on such an implementation of FETI and highlight the benefits of this feature. We have found that medium size to large problems can be solved even on a sequential machine with time and memory requirements that are one to two order of magnitude better than a direct solver.\""
  },
  {
    "title": "BaBar295.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/BaBar295.pdf",
    "description": "BaBar295.pdf"
  },
  {
    "title": "Basics of ANSYS Macros [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/week_28_totw-macros.pdf",
    "description": "Basics of creating and using macros (APDL) in ANSYS."
  },
  {
    "title": "Bioloch_ICRA04.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Bioloch_ICRA04.pdf",
    "description": "Bioloch_ICRA04.pdf"
  },
  {
    "title": "Building Parametric Models [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Week_22_totw-parametric-model.pdf",
    "description": "This memo provides an overview of APDL, defining parameters, and creating parametric models."
  },
  {
    "title": "An Interpretation of the Physics of Fluid-Structure Interaction in the Frequency Domain",
    "author": "Jan Christian Anker",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/CADFEM05_anker_paper.pdf",
    "description": "\"This paper constitutes an attempt to interpret the physics of FSI where the structure is vibrating. The structure considered is a very simple physical device, namely a flat cantilever plate. Many presumably important details are only briefly mentioned, other are left completely out of the discussion. The intention with the paper is to emphasize that there are cases where Fluid - Structure Interaction can be successfully simulated without having to utilize a Navier-Stokes Solver coupled with a (non-linear) Structural Analysis Program, a concept that requires vast amounts of computer time for linear vibrations (but is highly relevant for other applications).\""
  },
  {
    "title": "COMPMENU.zip",
    "author": "Jim Patterson (Hendrickson Trailer Suspension Systems)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/COMPMENU.zip",
    "description": "\"I have a set of macros to generate toolbars based on the defined components in the db. You can then call these toolbars from the main toolbar to aid in the selecting of the components. This includes \"select\", \"also select\", and \"unselect\". You can also \"remake\"the components from the toolbar. As someone who works with assemblies of shell models almost constantly, this has been a huge time saver for me.\"\n Tested on 5.7 through 6.1. Unzip the file and read the supplied Word document for instructions."
  },
  {
    "title": "Coupling low-order elements to high-order elements in ANSYS",
    "author": "Aaron Acton",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/acton20080620-coupling_low_to_high.pdf",
    "description": "\"This article presents several methods for obtaining coupling at the interface between low- and high-order elements in ANSYS. This situation can be encountered when modelling the fluid-structure interaction between a solid domain, modelled with quadratic elements, and an acoustic fluid domain, modelled with linear elements. The two methods determined to be most suitable for achieving this coupling are by using either constraint equations or contact elements, both of which are likely more-robust methods than by simply attaching coincident nodes on matching meshes. Examples are provided for each case described herein, and the results from each are compared to the ANSYS 11.0 verification problem VM177.\""
  },
  {
    "title": "Creating APDL Macros [PDF]",
    "author": "Mike Rife (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/week9-apdl-2.pdf",
    "description": "The use of the Ansys Parametric Design Language, APDL, to create simple but reusable macros can be a significant time saver. This Tip of the Week will show two examples of macros written for current Ansys users. These macros may be extended or used as templates for future macros."
  },
  {
    "title": "Creating a Helical Path",
    "author": "Paul McGarry (Galway-Mayo Institute of Technology)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/Helical_Path.pdf",
    "description": "\"A step by step GUI method for creating a left or right-handed helix, in any axis, for any pitch or diameter.\""
  },
  {
    "title": "Customizing GUI Behavior [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI06_Customize_GUI.pdf",
    "description": "\"The /UIS and /MSTART commands provide the user with control over much of the GUI behavior. At 5.7 and 6.0, this has been extended to include control over the multilegend feature, background color, and mouse button assignment for dynamic rotations. Used in conjunction with the startxx.ans file, this allows the user to change GUI behavior in each ANSYS session.\""
  },
  {
    "title": "DistributedLoad.zip",
    "author": "Paris Altidis (Borg Warner)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/DistributedLoad.zip",
    "description": "Zip file containing two example macros of applying distributed pressures."
  },
  {
    "title": "Don_HemmelgarnITI_Interoperability_Pres.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Don_HemmelgarnITI_Interoperability_Pres.pdf",
    "description": "Don_HemmelgarnITI_Interoperability_Pres.pdf"
  },
  {
    "title": "Finite Element Analysis at Mannesmann VDO Fuel Systems [PDF]",
    "author": "Zlatko Penzar",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/Dr_Penzar.pdf",
    "description": "Finite Element Analysis at Mannesmann VDO Fuel Systems - ppt presentation"
  },
  {
    "title": "Dutchsensorconf98.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Dutchsensorconf98.pdf",
    "description": "Dutchsensorconf98.pdf"
  },
  {
    "title": "ECTC2001-paper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/ECTC2001-paper.pdf",
    "description": "ECTC2001-paper.pdf"
  },
  {
    "title": "EE245.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/EE245.pdf",
    "description": "EE245.pdf"
  },
  {
    "title": "Elastic Foundation Stiffness",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/EFS.pdf",
    "description": "Short explanation of what elastic foundation stiffness (SURF154) is and how to calculate the resulting stiffness for non-planar cases. In Workbench Mechanical, this feature is referred to as an \"Elastic Support\"."
  },
  {
    "title": "Various MEMS Examples Using ANSYS [ZIP]",
    "author": "(EPFL, The Swiss Federal Institute of Technology Lausanne)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/EPFL_Tutorial.zip",
    "description": "Tutorials on using ANSYS with various MEMS examples. This was originally taken from EPFL's website."
  },
  {
    "title": "Effect of Package Design and Layout on BGA Solder Joint Reliability of an Organic C4 Package",
    "author": "Biju Chandran, Deepak Goyal, and Jeffrey Thomas",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/s30p5a.pdf",
    "description": "\"Ball Grid Array (BGA) is currently the interconnect of choice for attaching microprocessors on a printed circuit board (PCB). The reliability of solder joints is one of the critical issues in BGA surface mount technology (SMT). During reliability testing, BGA fatigue failures were observed on test vehicles (TV). Finite element analysis and physical failure analysis were used to determine the risk to the product in the field. As part of this effort, parametric finite element analysis was carried out to determine the effect of design features like the package size, and BGA pattern on the propensity of fatigue failure. The results of the finite element analysis and physical failure analysis showed that the risk to fatigue failure was much greater on a peripheral / partial grid array package than in a full grid array package.\""
  },
  {
    "title": "FFTDFT.zip",
    "author": "Juan Carlos Lancha (OHL, S.A.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/FFTDFT.zip",
    "description": "From the author:\n\n\"These small APDL macros perform Fourier transforms (FFT and DFT) of discrete signals. This procedure decomposes a time domain signal into a sum of harmonic (frequency domain) signals. It’s a useful APDL tool when dealing with dynamic and harmonic problems in ANSYS.\""
  },
  {
    "title": "FINITE ELEMENT MODELING OF DAMAGE ACCUMULATION IN BOLTED COMPOSITE JOINTS UNDER INCREMENTAL TENSILE LOADING",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/306.pdf",
    "description": "A three-dimensional progressive damage model was developed in order to simulate the damage accumulation of bolted single-lap composite joints under in-plane tensile loading. This model is capable of predicting the residual strength and residual stiffness of laminates with arbitrary lay-ups, geometries and bolt positions. The parametric study includes stress analysis, failure analysis and material property degradation. Stress analysis of the three-dimensional geometry was performed using the ANSYS FE code. Failure analysis and degradation of material properties were implemented using a progressive damage model, which is incorporated in an ANSYS macro-routine. The progressive model utilizes a set of stress-based Hashin-type criteria and a set of appropriate degradation rules. A parametric study was performed to examine the effect of bolt position and friction upon residual strength and damage accumulation."
  },
  {
    "title": "Comparison of FLUID29 and FLUID79 Elements",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/FLUID29andFLUID79.pdf",
    "description": "\"Analyses were conducted to verify that similar results could be obtained by using the displacement formulated fluid elements FLUID79 or the pressure formulated fluid elements FLUID29.\""
  },
  {
    "title": "FSI.projects.Nabity.paper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/FSI.projects.Nabity.paper.pdf",
    "description": "FSI.projects.Nabity.paper.pdf"
  },
  {
    "title": "Finet_CAD_04.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Finet_CAD_04.pdf",
    "description": "Finet_CAD_04.pdf"
  },
  {
    "title": "Formatting output text of results (PRxxxx family of commands) [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/week1-formatting-output-text.pdf",
    "description": "This memo outlines some of the options available in ANSYS to produce and to format output listings: (1) the use of the /FORMAT statement with the PRxxxx series of commands and (2) the application of *VWRITE to create custom output. This memo outlines some of the options available in ANSYS to produce and to format output listings: (1) the use of the /FORMAT statement with the PRxxxx series of commands and (2) the application of *VWRITE to create custom output."
  },
  {
    "title": "FranzChouly_LN2006.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/FranzChouly_LN2006.pdf",
    "description": "FranzChouly_LN2006.pdf"
  },
  {
    "title": "GSkoro1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/GSkoro1.pdf",
    "description": "GSkoro1.pdf"
  },
  {
    "title": "General ANSYS Tips (5.5)",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ansys_tips.pdf",
    "description": "Where to get help \n  Insufficient disk space \n Bulk compression mode \n Choice of solver \n  Element Normals \n Boolean operations on solid models \n  Meshing \n Loading an array from a file \n Using ETABLE and extracting the results to an array \n Output when using the GUI \n Generating editable WMF figures "
  },
  {
    "title": "Gerard_et_al.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Gerard_et_al.pdf",
    "description": "Gerard_et_al.pdf"
  },
  {
    "title": "High End Workbench Tip",
    "author": "PADT",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/HE_WB.zip",
    "description": "Taken from PADT's SWAU group meeting on performing high-end analyses with Workbench Simulation."
  },
  {
    "title": "Hyper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/Hyper.pdf",
    "description": "Hyper.pdf"
  },
  {
    "title": "IEEE00_LGC_umirror.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/IEEE00_LGC_umirror.pdf",
    "description": "IEEE00_LGC_umirror.pdf"
  },
  {
    "title": "IJSS2007.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/IJSS2007.pdf",
    "description": "IJSS2007.pdf"
  },
  {
    "title": "IMAPS_Shivesh.PDF",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/IMAPS_Shivesh.PDF",
    "description": "IMAPS_Shivesh.PDF"
  },
  {
    "title": "INTERP.zip",
    "author": "Vladimir Tkach (NPO Energomash)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/INTERP.zip",
    "description": "\"This example interpolates stress-strain curve by polynomial function - Strain=A1+A2*StressA3*Stress^2, in temperature area between Proportional, Yield and Ultimate stresses and reads it into ANSYS db-file.\""
  },
  {
    "title": "IPACK2005-73239.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/IPACK2005-73239.pdf",
    "description": "IPACK2005-73239.pdf"
  },
  {
    "title": "IRS2006_reprint.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/IRS2006_reprint.pdf",
    "description": "IRS2006_reprint.pdf"
  },
  {
    "title": "Improvements to Time-History Postprocessing at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI08_ANSYS_6.0_Variable_Viewer.pdf",
    "description": "\"This tips and tricks focuses on improvements at 6.0 on the Time-History postprocessor. (After I did this, I realized that a lot of this was already covered in the 6.0 Update seminar, but, oh well...)\""
  },
  {
    "title": "Jewart_etd_2006.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Jewart_etd_2006.pdf",
    "description": "Jewart_etd_2006.pdf"
  },
  {
    "title": "LNCS3078_Chabanas.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/LNCS3078_Chabanas.pdf",
    "description": "LNCS3078_Chabanas.pdf"
  },
  {
    "title": "Legend_Example.zip",
    "author": "Bob Weathers (Trane)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Legend_Example.zip",
    "description": "Example of customizing legend with annotations. See \"Read Me\"file for details, along with AVI animation.\"Essentially, I turn off the legend and write annotations into this area. It gives me considerable control over what appears there. I have also found that I can better communicate results to my customers by, say, having a legend that's reads 1.23 mils rather than 0.123E-02 inches or by referencing drawing and revision numbers, test results, material properties, and so on.\"\n\"You might need to change some of the character size and line spacing dimensions in the macros. Again, though, they work just fine for my hardware.\""
  },
  {
    "title": "LiPaperECF13.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/LiPaperECF13.pdf",
    "description": "LiPaperECF13.pdf"
  },
  {
    "title": "Long Parameter and Component Names at 6.0 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI04_Long_Names_and_Strings.zip",
    "description": "\"Starting from version 5.7, strings have been introduced to replace character arrays. Strings allow for up to 128 characters for APDL purposes, instead of the 8-letter limit of character parameters. The /INQUIRE command as well as string manipulation functions (see *GET online help) extend the usefulness of strings to retrieve and manipulate data. *VWRITE has also been enhanced to support C-format statements, useful in writing out long strings.\"\n\"At 6.0, the 8-character limitation on parameters, components, and /POST26 variables has been removed. Users can now specify up to 32 character for these items, allowing for much more descriptive names. In /POST26, variables can also be referred to by name when plotting or listing.\""
  },
  {
    "title": "M3302.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/M3302.pdf",
    "description": "M3302.pdf"
  },
  {
    "title": "MEP_2005.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/MEP_2005.pdf",
    "description": "MEP_2005.pdf"
  },
  {
    "title": "MICROtec2000.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/MICROtec2000.pdf",
    "description": "MICROtec2000.pdf"
  },
  {
    "title": "MPPH060.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/MPPH060.pdf",
    "description": "MPPH060.pdf"
  },
  {
    "title": "MSM00_ANSYS_pds.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/MSM00_ANSYS_pds.pdf",
    "description": "MSM00_ANSYS_pds.pdf"
  },
  {
    "title": "MSM00_ANSYS_romfin.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/MSM00_ANSYS_romfin.pdf",
    "description": "MSM00_ANSYS_romfin.pdf"
  },
  {
    "title": "MSM00_ANSYS_trefftz.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/MSM00_ANSYS_trefftz.pdf",
    "description": "MSM00_ANSYS_trefftz.pdf"
  },
  {
    "title": "MSM00_ANSYS_tzpcfin.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/MSM00_ANSYS_tzpcfin.pdf",
    "description": "MSM00_ANSYS_tzpcfin.pdf"
  },
  {
    "title": "MSM2001_paper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/MSM2001_paper.pdf",
    "description": "MSM2001_paper.pdf"
  },
  {
    "title": "MSM99_ANSYS_trans126.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/MSM99_ANSYS_trans126.pdf",
    "description": "MSM99_ANSYS_trans126.pdf"
  },
  {
    "title": "MSM99_CNRS_umirror.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/MSM99_CNRS_umirror.pdf",
    "description": "MSM99_CNRS_umirror.pdf"
  },
  {
    "title": "MSM99_IMT_upump.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/MSM99_IMT_upump.pdf",
    "description": "MSM99_IMT_upump.pdf"
  },
  {
    "title": "MSM99_LIMMS_piezo.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/MSM99_LIMMS_piezo.pdf",
    "description": "MSM99_LIMMS_piezo.pdf"
  },
  {
    "title": "MSM99_RITS_upump.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/MSM99_RITS_upump.pdf",
    "description": "MSM99_RITS_upump.pdf"
  },
  {
    "title": "MSM99_ULM_cvd.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/MSM99_ULM_cvd.pdf",
    "description": "MSM99_ULM_cvd.pdf"
  },
  {
    "title": "MSM99_UMN_ufluidic.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/MSM99_UMN_ufluidic.pdf",
    "description": "MSM99_UMN_ufluidic.pdf"
  },
  {
    "title": "Manipulating FE Mesh [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI04_Manipulating_FE_Mesh.zip",
    "description": "\"There are some special situations where a user may be required to generate or manipulate a database consisting mainly of finite element entities without solid model geometry. With some careful planning, dealing with mesh-only databases can prove to be relatively easy. \n\n Typical situations that may arise include the following: \n\n Import of mesh from Workbench Simulation or AI*Environment/ICEM CFD \n  Generation of repetitive geometry \n\n This memo hopes to cover these situations in more detail.\""
  },
  {
    "title": "Marc_Halpern7CVP_mh.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Marc_Halpern7CVP_mh.pdf",
    "description": "Marc_Halpern7CVP_mh.pdf"
  },
  {
    "title": "Mass property calculation methods [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/week3-Mass_Calculation_Macros.pdf",
    "description": "This memo covers some ways to determine mass properties of an ANSYS model."
  },
  {
    "title": "Workbench XML Material Format",
    "author": "ANSYS, Inc.",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Material_XML.zip",
    "description": "ANSYS Workbench Engineering Data module (e.g., Workbench Simulation, Workbench FE Modeler) can import/export material data as XML files. These XML files utilize the MatML format, and this zip file contains an example. This can be useful for users wishing to generate their own material libraries in XML format outside of Workbench Engineering Data."
  },
  {
    "title": "Meshing in Workbench [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI0801_Meshing.pdf",
    "description": "\"Mechanical users have long enjoyed access to a variety of powerful meshing tools inside of ANSYS to generate high-quality shell, tetrahedral, and swept meshes. During the past several years, meshing in ANSYS Workbench Simulation has not only grown to encompass traditional meshing algorithms in ANSYS but has also developed many features requested by ANSYS users as well as integrated meshing technologies from ANSYS CFX and ANSYS ICEM CFD.\""
  },
  {
    "title": "Nested macros, local parameters, trailing underscores",
    "author": "Martin Herrenbruck (Technische Universität München)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Nested_macros-all-files.zip",
    "description": "\"A macro file is a file which contains Ansys commands. If you save your macro in your working directory or in the macro directory (see /PSEARCH command) you just enter the macro name in the command line and all these commands will be executed. You can even nest macros: from your main file you call e.g. zzmacro1 which again calls zzmacro2. The only problem is that a macro could change - and you would probably not notice that - the value of a parameter you are using in your main input file. This will be the case if the same parameter name is used accidentally in both the macro and your main input. Let's see how one can avoid these nasty errors - just click on the link!\""
  },
  {
    "title": "OBrien-NATO-15-2005.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/OBrien-NATO-15-2005.pdf",
    "description": "OBrien-NATO-15-2005.pdf"
  },
  {
    "title": "Ohayon_BACAS_05.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Ohayon_BACAS_05.pdf",
    "description": "Ohayon_BACAS_05.pdf"
  },
  {
    "title": "PA-27.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/PA-27.pdf",
    "description": "PA-27.pdf"
  },
  {
    "title": "PAC1991_2197.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/PAC1991_2197.pdf",
    "description": "PAC1991_2197.pdf"
  },
  {
    "title": "ANSYS PDS overview [PDF]",
    "author": "Stefan Reh",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/PDS_Overview.pdf",
    "description": "A three-page overview/summary sent on the XANSYS Mailing list on PDS, beta in ANSYS 5.6, officially released at 5.7."
  },
  {
    "title": "POW2MAT.zip",
    "author": "Carl Olsard (noiseboard.com)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/POW2MAT.zip",
    "description": "\"This is a simple program written in Turbo pascal which I find very useful for converting the output from ANSYS (prvar, prnsol, etc) into columns, while removing the headers at the start and between the page listings. The program is used at a DOS prompt and one types in: pow2mat col filein fileout , where col are the number of columns in the output, filein MUST have an extension .val and fileout WILL have an extension .txt. You do NOT type in the extensions, they are default. For example, you would type pow2mat 7 nodelist nodelist which would extract 7 columns from the file nodelist.val and write a stripped file called nodelist.txt . If you have several files to convert, you can use the DOS FOR command as follows: \n FOR %I IN (*.val) DO pow2mat 3 %~nI %~nI\""
  },
  {
    "title": "PPPL-3321.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/PPPL-3321.pdf",
    "description": "PPPL-3321.pdf"
  },
  {
    "title": "PRESSURE_MAC.zip",
    "author": "Hursha Narayan (Robert Bosch Corporation)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/PRESSURE_MAC.zip",
    "description": "\"I have written a macro that calculates the total force along the three axes from applied pressure. I find this macro to be useful just to make sure that the pressure I'm applying on a curved surface is accurate and also it gives a feel for the mesh discretization where the pressure is applied. The user has to basically identify the elements with a particular magnitude of pressure and save the list file (SFELIS.lis). The macro does everything else automatically. The downside to the macro is:\n1. Right now it only handles 10 node tet elements.\n2. The pressure has to be uniform\nThe user will have to modify some of the fields in the macro as well as the c-shell file prescalc.\""
  },
  {
    "title": "Parametric Studies in ANSYS [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/week26-parametric_studies.pdf",
    "description": "Automated parametric studies in ANSYS (generating and using parametric input files)."
  },
  {
    "title": "Pilsen00.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/Pilsen00.pdf",
    "description": "Pilsen00.pdf"
  },
  {
    "title": "Plotting Entities and Graphs in Multiple Windows [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/Week_18_multi-plot.pdf",
    "description": "ANSYS 5.4 through 5.6 allow users to plot multiple entities (keypoints, lines, areas, volumes, nodes, and elements) in a given window. Prior to ANSYS 5.4, a user was required to plot entities on top of one another, like transparencies. Furthermore, multi-plotting also allows a user to generate graphs. The following memo discusses how the ANSYS multi-plotting feature works."
  },
  {
    "title": "Postprocessing Harmonic Results [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI03_Harmonic_Postprocessing.zip",
    "description": "\"In harmonic analyses, due to the fact that results may not be in phase, postprocessing quantities of interest can pose a challenge. Users may need to review non-sinusoidal results, such as equivalent stresses, at different locations, so accounting for phase information may be required.\n    This memo hopes to cover some of the more important points regarding postprocessing structural harmonic analysis results in both the General and Time-History Postprocessors.\""
  },
  {
    "title": "Pressure Mapping Example",
    "author": "Bob Weathers (Trane)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/PressureMappingExample.zip",
    "description": "An example which demonstrates mapping between dissimilar meshes and element types.\n\nAt the bottom of the macro is an example of how to apply the mapped results from the first model onto the second using a TABLe. The TABLe uses the second model's node numbers (sorted and stored in ascending order) to index into the TABLe. This results in a very efficient way to map boundary conditions that's fast and uses minimum memory."
  },
  {
    "title": "Principles of Simulating Contact Between Parts using ANSYS",
    "author": "David H. Johnson",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/principles_of_simulating_contact_between.pdf",
    "description": "\"The ANSYS finite element analysis (FEA) program offers a variety of elements designed to treat cases of changing mechanical contact between the parts of an assembly or between different faces of a single part. These elements range from simple, limited idealizations to complex and sophisticated, general purpose algorithms. FEA analysts are frequently faced with modeling situations where changing contact cannot be assumed negligible and ignored. Finding the best choices for contact elements, element options, solver, and solution options can drastically improve the model’s performance and reduce the analyst’s frustration with a contact simulation model.\""
  },
  {
    "title": "RDARV_Article1200.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/RDARV_Article1200.pdf",
    "description": "RDARV_Article1200.pdf"
  },
  {
    "title": "Constellation Pathfinder: A University Nanosatellite",
    "author": "C.D. Rayburn, H.E. Spence, H.E. Petschek, M. Bellino, J. Vickers, M. Murphy",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Rayburn_USU_Paper.pdf",
    "description": "\"This paper updates the progress of the Constellation Pathfinder Mission (CPM) design. Specifically, preliminary results in areas including satellite design, orbital mechanics, thermal design, structural design, and attitude determination and control are discussed.\""
  },
  {
    "title": "Reliability Needs",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/021501Syed.pdf",
    "description": "Overview of Reliability Models and Data Needs"
  },
  {
    "title": "S42-2_Dauksher.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/S42-2_Dauksher.pdf",
    "description": "S42-2_Dauksher.pdf"
  },
  {
    "title": "SPIE-02-SS-4701-34-horn.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/SPIE-02-SS-4701-34-horn.pdf",
    "description": "SPIE-02-SS-4701-34-horn.pdf"
  },
  {
    "title": "SPIE-02-SS-4701-36-USDC.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/SPIE-02-SS-4701-36-USDC.pdf",
    "description": "SPIE-02-SS-4701-36-USDC.pdf"
  },
  {
    "title": "SPIE-05_Zensheu-USDC-modeling.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/SPIE-05_Zensheu-USDC-modeling.pdf",
    "description": "SPIE-05_Zensheu-USDC-modeling.pdf"
  },
  {
    "title": "Acoustic Elements [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI01_Acoustic_Elements.zip",
    "description": "\"For many years, ANSYS has 2D and 3D acoustic elements, including those used to model an “infinite” boundary. These elements can be used in modal, harmonic, and transient analyses, and fluid-structural interaction can also be accounted for in these simulations.\n\nThis memo hopes to review the following topics related to harmonic acoustic analyses: basic comparison of structural and acoustic elements, modeling complex impedance boundary conditions, and defining complex pressure loading. A set of input files, which analyze the case of a simple radiating sphere, is included with this memo.\""
  },
  {
    "title": "Beta Electrical Contact Features at 6.0 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI01_Electrical_Contact_Beta_6.0.zip",
    "description": "\"This issue describes a beta feature at 6.0, which is electrical contact capability of 17x surface-to-surface contact elements. This new capability allows contact in thermal-electric and structural-thermal-electric problems.\"\n(Week 13, week of 01/07/02.)"
  },
  {
    "title": "PDS and Nonlinear Runs [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI01_PDS_and_Nonlinear_Runs.zip",
    "description": "\"The Probabilistic Design System (PDS) of ANSYS provides a very powerful tool in understanding the effect of uncertainties in one’s design. The details of PDS are covered in the online help, so this memo will discuss the specific case of setting up serial and parallel PDS runs as well as performing nonlinear analyses with PDS.\""
  },
  {
    "title": "Using the WB Simulation Remote Solution Manager [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI01_Remote_Solution_Manager.pdf",
    "description": "\"Workbench Simulation has the ability to allow the user to solve multiple jobs locally or remotely. These capabilities are defined within the \"Solution” branch of WB Simulation as well as in the WB Remote Solution Manager.\n \"This memo hopes to introduce this capability, especially with regards to solving multiple jobs locally on a Windows machine.\"\n(Week 33, week of 04/02/06.)"
  },
  {
    "title": "APDL and Vector Operations [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI02_APDL_and_Vector_Operations.zip",
    "description": "\"Vector and matrix operations in APDL are an invaluable method of manipulating array data, as they provide very fast, computationally efficient means of helping the user perform pre- or post-processing operations on the model.\nThere are many ways of storing data, ranging from arrays to tables to strings. Moreover, manipulation of numerical data can be in the form of vectors or matrices via the *Vxxx and *Mxxx commands, respectively. The user is referred to the APDL Programmer’s Guide in the ANSYS online help for a thorough discussion of the capabilities of APDL, but, in this memo, a basic introduction to vector operations will be covered.\""
  },
  {
    "title": "Nonlinear Submodeling [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI02_Nonlinear_Submodeling.zip",
    "description": "\"Submodeling is often used to efficiently obtain solutions at local areas. Although submodeling may be commonly thought of as being applicable to linear static structural solutions, it can also be applied to nonlinear and transient analyses, as well as other disciplines. This memo hopes to cover the specific case of nonlinear static structural submodeling.\"\n(Week 14, week of 01/14/02.)"
  },
  {
    "title": "QR Damped and Unsymmetric Stiffness [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI02_QR_Damped_Unsymmetric.zip",
    "description": "\"There have been significant enhancements to the QR Damped eigenvalue extraction method in the past several releases of ANSYS. At 8.0, the capability of including unsymmetric damping [C] matrix was introduced, along with support of damping defined via the DMPRAT and MDAMP commands.\nANSYS 8.1, the material-based constant damping ratio MP,DMPR allowed users to specify constant damping ratios per material ID in mode-superposition harmonic analyses, when used with the QRDAMP eigensolver. With the release of 9.0, QRDAMP also supports unsymmetric stiffness [K] matrix, output of complex eigenvectors, and the use of the PSOLVE command. This memo hopes to cover the use of QR Damped eigenvalue extraction method in friction problems, where an unsymmetric stiffness [K] matrix may be present. An example of this type of problem is brake squeal analyses, where the combination of ANSYS 17x contact elements and the QRDAMP eigensolver provide an easy-to-use, efficient means of determining unstable modes.\""
  },
  {
    "title": "Preventing Rigid-Body Motion in Contact Problems [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI02_Rigid_Body_Contact.zip",
    "description": "\"In contact problems run in a static manner, controlling rigid-body motion may sometimes be an issue under the following circumstances: (a) force-controlled systems or (b) multiple bodies with some parts unconstrained.\"\n\n\"This memo hopes to address some ways of controlling rigid-body motion in contact problems through the use of options available with the surface-to-surface contact elements.\""
  },
  {
    "title": "PSD Calculation Efficiency [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI03_PSD_Efficiency.pdf",
    "description": "\"A very common use of PSD analyses is to look at the response of a system under a single base excitation, such as the case with many aerospace and civil applications. The default PSD settings are very general in nature and may consequently be inefficient for such a situation. This memo hopes to outline some ways in which the user may obtain more efficient PSD solutions for the specific instance of single base excitation with relatively flat spectrum (although some techniques may be extrapolated for other cases).\"…An older doc I recently reanimated and updated…"
  },
  {
    "title": "Review of Anisotropy, Yield Criteria, Failure Criteria [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI03_Yield_and_Failure.pdf",
    "description": "\"This memo hopes to serve as a review of the basics of anisotropy, yield criteria, failure criteria, and the ANSYS procedure related to these topics.\"\n(Week 15, week of 01/21/02.)"
  },
  {
    "title": "PSD Postprocessing [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI04_PSD_Postprocessing.zip",
    "description": "\"PSD, or random vibration, analyses present some interesting challenges in postprocessing due to the nature of the assumptions related to the analysis. This memo hopes to address some of these items, including evaluation of derived stresses and calculation of response power spectral density.\"\n…An older doc I recently reanimated and updated…"
  },
  {
    "title": "Contact Wizard Enhancements at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI05_ANSYS_6.0_Contact_Wizard.pdf",
    "description": "Describes some of the enhancements made to the Contact Wizard at ANSYS 6.0, including support of 17x contact elements' thermal features and ability to edit contact pair options through same interface.\n(Week 5, week of 10/22/01.)"
  },
  {
    "title": "Understanding the Response Surface Method in DesignXplorer [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI05_DesignXplorer.pdf",
    "description": "\"ANSYS DesignXplorer enables the user to perform optimization studies based on multiple objectives, to account for uncertainties in product design and use, and to determine how best to improve product reliability. These tasks are accomplished through the use of response surfaces, and this memo hopes to cover some of the basics of DesignXplorer operation.\""
  },
  {
    "title": "Pressure Load Macro [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI05_Pressure_Loading.zip",
    "description": "\"In ANSYS, pressure loading via the SFx family of commands allows users to apply a force per unit area in a direction normal to the surface. Structural surface effect elements SURF153 and SURF154 extend pressure loading capabilities by allowing users to specify normal, tangential, or arbitrary distributed loading. In fact, for an arbitrary ‘distributed loading vector,’ the full or projected area may be used, with or without the tangential component of load. This type of loading can be useful in mimicking a bearing load (include tangential component) or wind loading (no tangential component), to name a couple of examples.\n\"Because of the fact that the vector-type of pressure loading can be based on full or projected area, with or without the tangential component, trying to determine an appropriate value for the loading can be cumbersome. The author has written a simple macro which can be used as an example in utilizing surface effects more effectively by allowing the user to specify the total force instead of pressure – the macro calculates the appropriate pressure value to be applied on the surface effect elements.\"\n(Week 27, week of 07/04/04.)"
  },
  {
    "title": "Using the Radiosity Solver in Workbench Simulation [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI0603_Radiosity_Solver_Simulation.pdf",
    "description": "Please note that in Workbench Mechanical 12.1, surface-to-surface radiation (using the Radiosity Solution Method) has been introduced in the GUI, so this memo is obsolete if you use version 12.1 and higher.\n\"Radiation can play an important role in heat transfer analyses. In Workbench Simulation 10.0, a “Radiation” load has been added to allow users to account for losses to the surroundings, although this does not include radiation exchange between surfaces.\n    For users wishing to utilize the ANSYS surface-to-surface radiation capabilities, this memo hopes to introduce an easy method to include these effects within Workbench Simulation via Named Selections and Command objects.\n  This type of methodology can be extended to include any other advanced solution feature of ANSYS which the user may wish to incorporate inside of Workbench Simulation.\""
  },
  {
    "title": "Modeling Viscous Behavior [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI0604_Viscous_Behavior.zip",
    "description": "\"Amorphous solids or solids at elevated temperatures may exhibit viscous behavior. It may be difficult for some users to determine how best to model such behavior. This memo hopes to describe some available options in ANSYS and to differentiate between viscoelastic and viscoplastic constitutive models.\""
  },
  {
    "title": "Undocumented Hyperelastic Material Models at 5.7-6.1 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI06_Undocumented_Hyperelastic_Models.zip",
    "description": "\"From 5.7, the 18x series of elements support a variety of hyperelastic constitutive models, namely general polynomial, Mooney-Rivlin, Neo-Hookean, Arruda-Boyce, and Ogden. Four other models have been included in 5.7 onwards, although these are undocumented options for TB,HYPER. These four models consist of the Yeoh and Gent models for incompressible behavior and the Hyperfoam and Blatz-Ko options for compressible rubbers. This memo hopes to provide a summary of these material models and of the required input.\""
  },
  {
    "title": "Using CMS in Workbench Simulation [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI0701_CMS_in_Simulation.zip",
    "description": "\"At Workbench 11.0, the ANSYS Rigid Dynamics add-on module enables users to model complex kinematic assemblies, whereby system-level performance as well as accurate force loading on components can be obtained.\n    Although the parts in the assembly may initially be considered rigid, an interesting, related method is the use of component mode synthesis (CMS) to account for the flexibility of parts. This memo will attempt to cover a way in which users can incorporate CMS in their multibody analyses in Workbench Simulation.\"\n[For version 12.0, use supplied \"cms_use_v12.mac\"instead of \"cms_use.mac\"- courtesy of D. Creech.]"
  },
  {
    "title": "Spatially-Varying Pressure Loading in Workbench Simulation [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI0702_External_Pressure_Loading_WB_Simulation.zip",
    "description": "\"Workbench Simulation 11.0 allows users not only to apply constant pressure loads or force vectors per unit area but also to utilize hydrostatic pressure loads and line pressure loads (force per unit length), and these can be defined as a function of time. Moreover, fluid pressures can be mapped from a steady-state or transient ANSYS CFX solution.\nDespite these options, there may be situations where a user may want to import a predefined, spatially-varying pressure field from an external text file. This can be accomplished through the use of a “Commands” object and APDL tables, which this memo will introduce.\"\n(Week 38, week of 07/01/07.) "
  },
  {
    "title": "User-Defined Hyperelasticity with USERHYPER [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI0703_USERHYPER.zip",
    "description": "\"User-Programmable Features (UPFs) are an extremely useful feature for analysts that need additional advanced functionality, especially in the area of constitutive modeling.\nTB,HYPER allows users to include many incompressible and compressible hyperelastic material behavior – Ogden, Arruda-Boyce, Gent, Yeoh, Blatz-Ko are but some of the available models. However, for those wishing to use a customized strain energy function, the USERHYPER.F subroutine is available.\""
  },
  {
    "title": "User-Defined Creep Laws with USERCREEP [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI0704_USERCREEP.zip",
    "description": "\"ANSYS provides 13 creep equations for use with implicit creep – these range from the simple Norton law to the hyperbolic sine form to the Blackburn model to a rational polynomial expression, to name a few – that can be used to model a range of creep behavior for metals. The TBFT command provides curve-fitting functionality for the user wishing to evaluate creep material parameters from test data. Also, the user can model anisotropic creep as well as combine implicit creep with rate-independent plasticity to model a wide range of complex material response.\nDespite this wealth of features, however, one may wish to incorporate one’s own creep law into ANSYS. For example, a company may have their own creep equation with material parameters already defined and validated through testing. The built-in creep laws in ANSYS assume creep used in design rather than failure analysis, so the available creep laws are meant to model primary and secondary creep – consequently, another need to incorporate a user-defined creep law would arise when a user wants to include tertiary creep and/or to evaluate creep damage.\nThis memo will hope to address some aspects of writing one’s own user-defined creep law with the USERCREEP.F subroutine to address this issue.\"\nExample using Anand's model."
  },
  {
    "title": "Buckling in Workbench Simulation [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI0705_Buckling.pdf",
    "description": "\"Buckling may be a concern for some situations, where a user may need to modify the design to prevent buckling within a given load range. Conversely, failure analysis may need to be performed when a structure has collapsed.\nANSYS and Workbench Simulation have many tools to aid users in solving geometric instability problems, ranging from linear (eigenvalue) buckling to nonlinear, post-buckling analyses.\"\n(Week 41, week of 10/14/07)"
  },
  {
    "title": "Acoustic Postprocessing [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI0706_Acoustic_Postprocessing.zip",
    "description": "\"Acoustic analyses in ANSYS provides insight to the propagation of sound, and both visual and aural postprocessing can aid in this objective. This memo hopes to cover postprocessing methods for acoustic problems other than standard contour and XY plots.\""
  },
  {
    "title": "CERIG vs RBE3, RIGID184 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI07_CERIG_RBE3_RIGID184.zip",
    "description": "\"Constraint equations provide many useful features in ANSYS, such as tying together dissimilar meshes, representing parts of the system not explicitly modeled, or distributing loads. Two automated methods of generating constraint equations are the CERIG and RBE3 commands. Because there is often confusion over their use, this memo hopes to provide some information on differences between the two methods.\n\"Constraint equations in ANSYS are linear, so they are not valid for large-rotation analyses. RIGID184 is a beta element in version 6.1 which provides rigid link/beam capabilities, valid for large-rotation problems. The latter part of this memo will cover some details of this undocumented feature, available in 6.1.\""
  },
  {
    "title": "Understanding Lagrange Multipliers [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI07_Lagrange_Multipliers.pdf",
    "description": "\"Lagrange multipliers are a general term used in different areas of ANSYS, specifically contact and element formulation. This memo hopes to provide the user with a simplified introduction to the most important concepts in using elements with Lagrange multipliers, in hopes that some of the element options and solver selection can be better understood.\nCurrently, at ANSYS 6.0, the node-to-node gap element CONTA178 and the Mixed U-P formulation of the 18x elements (i.e., KEYOPT(6)>0) utilize Lagrange multipliers, so the discussion will focus on these elements.\""
  },
  {
    "title": "Drucker-Prager Models [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI0802_Drucker_Prager.pdf",
    "description": "\"The Drucker-Prager material model is used for pressure-dependent inelastic behavior of materials such as soils, rock, concrete, and powder. Because ANSYS offers three different Drucker-Prager constitutive models, this memo hopes to provide a comparison of the available options.\"\n(Week 44, week of 03/16/08)"
  },
  {
    "title": "Introduction to the Residual Vector Method [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI0803_Residual_Vectors.zip",
    "description": "\"The residual vector method can improve the accuracy of mode-superposition harmonic response or transient analyses, especially when the high-frequency content of the structure is excited. This memo provides details on how users can take advantage of this analysis technique introduced in ANSYS 11.0.\""
  },
  {
    "title": "Basics on Structural Damping (Addendum) [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI0804_Damping.zip",
    "description": "\"Since ANSYS 5.6, there have been numerous enhancements as well as facets of the software program that have changed, including treatment of damping. This article is meant to serve as an addendum to Section 6 of the author’s \"Structural Damping\"memo, which was written in October, 2000.\""
  },
  {
    "title": "Chaboche Nonlinear Kinematic Hardening Model [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI0805_Chaboche.pdf",
    "description": "\"The Chaboche nonlinear kinematic hardening model was added in ANSYS 5.6 to complement the existing isotropic and kinematic hardening rules that users relied on. Despite its availability for nearly ten years as of the time of this writing, the Chaboche model has enjoyed limited popularity, in part because of the perceived complexity of calibrating the material parameters. This memo hopes to introduce the basics related to the Chaboche nonlinear kinematic model.\"\n(Week 47, week of 05/04/08)"
  },
  {
    "title": "User-Defined Output with USEROUT.F [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI0806_USEROUT.zip",
    "description": "\"There are various situations where a user may wish to define specific type of output to postprocess — this can range from simple evaluation of safety factors to more involved damage calculations. While APDL, the ANSYS command language, allows users to manipulate results in any manner one sees fit, user-programmable features (UPFs) also provide a means for users to calculate specific output results efficiently at the solution level.\"\nExample of calculating fatigue and Cap (Extended Drucker-Prager) output."
  },
  {
    "title": "Viscoelasticity [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI0807_Viscoelasticity.zip",
    "description": "\"Viscoelastic constitutive models allow users to analyze the time-dependent relaxation or creep behavior of materials, including glass, polymers, solid rocket propellants, to name a few. One may view viscoelastic materials as containing an elastic and viscous component, similar to a spring and dashpot in series. This memo will introduce viscoelastic input in ANSYS and as well as cover curve-fitting procedures.\""
  },
  {
    "title": "Hill's Potential [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI0808_Hill.zip",
    "description": "\"Anisotropic plasticity using Hill’s yield criterion was introduced in ANSYS 5.7, and the extensions to anisotropic creep and viscoplasticity were added in ANSYS 6.0. While Hill’s stress potential is most commonly used for rolled sheets, it can be used for other situations where three orthogonal planes of symmetry are preserved. This memo will introduce details of the usage of Hill’s potential in ANSYS.\"\n(Week 50, week of 08/31/08)"
  },
  {
    "title": "Using PSOLVE [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI08_PSOLVE.zip",
    "description": "Although most often used for large-deflection prestressed modal analyses, PSOLVE has other applications which make it attractive to use, especially for large models.\n\nPSOLVE can be used for the following situations:\n\nPrecise mass calculations\nDetailed listing of contact pair information\nEvaluation of tabular boundary conditions and loads\n\nSince PSOLVE is a partial solution (namely, calculation of element matrices), it is usually much faster than performing an actual solution. Hence, the user may obtain any (or all) of the above three types of information prior to running an actual analysis, which can be a valuable way of verifying model input and settings prior to solution.\n\n(Week 20, week of 07/14/02.)"
  },
  {
    "title": "Compiling UPFs and Creating Customized ANSYS Executables [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI0901_Compiling_UPFs.pdf",
    "description": "\"ANSYS User Programmable Features (UPFs) are quite powerful means of customizing ANSYS beyond the scripting capabilities of the ANSYS Parametric Design Language (APDL). Writing one’s own constitutive models or complex loading functions or even creating a user-defined element are possible with UPFs. \n\n Because some users may find it challenging to get started using UPFs, this memo hopes to discuss general issues related to compiling and linking a customized version of ANSYS for Windows and Linux environments.\"\n\n (Week 51, week of 02/08/09)"
  },
  {
    "title": "Contact Analysis Tips [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI0902_Contact_Tips.pdf",
    "description": "\"Generally speaking, nonlinear analyses involving contact can be quite challenging to solve when the contacting area changes during the load history. However, ANSYS Workbench Simulation has very robust contact technology, along with diagnostic tools that can help the user obtain converged, accurate solutions. This memo hopes to discuss some tips related to contact analyses in hopes of aiding the user who encounters difficulties when solving contact analyses.\""
  },
  {
    "title": "PSD Postprocessing of Relative Displacement [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI0903_PSD_Postprocessing_2.zip",
    "description": "\"PSD users may wish to determine the relative 1-sigma results between two points. This memo covers three methods to perform this operation, in hopes that it will give users more familiarity with PSD postprocessing in ANSYS.\""
  },
  {
    "title": "STI0904_USERFC.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI0904_USERFC.zip",
    "description": "\"The FC command provides users with the ability to predict first-ply failure using maximum strain, maximum stress, or Tsai-wu failure criteria. In ANSYS 12.0.1, users can also take advantage of the userfc subroutine to define up to nine different criteria.\nThis memo reviews the userfc subroutine, and a sample implementation of the Hashin criterion is included.\""
  },
  {
    "title": "Basics on Structural Damping [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI09_Damping.zip",
    "description": "This is an old document I wrote a while ago on damping which I sometimes use. Although written back at version 5.6, it is still applicable at version 7.0.\n\"Damping is required in many dynamic applications, yet because there are many ways to include it, there is often confusion regarding the implementation of damping in ANSYS. This memo hopes to provide a general summary of the representation of damping available in ANSYS.\""
  },
  {
    "title": "Flotran Enhancements at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI10_Flotran_Enhancements_at_6.0.pdf",
    "description": "\"There have been several enhancements to Flotran at 6.0. These changes include more robust default settings, an additional advection scheme, a new coupling algorithm, and improvements to the ALE mesh morpher.\""
  },
  {
    "title": "Manual Calculation of Strain Energy Density [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI10_Manual_Calculation_of_SEND.zip",
    "description": "\"Output of elastic, plastic, and creep strain energy densities (SEND) was introduced in ANSYS 6.0, although this is limited to 18x elements in nonlinear analyses. Users whose models include core elements with plasticity and creep may also wish to obtain these quantities, and this memo hopes to review this procedure.\"\n(Week 22, week of 12/22/02.)"
  },
  {
    "title": "Plasticity Hardening Rules [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI11_Plasticity_Hardening_Rules.zip",
    "description": "\"ANSYS has a wide range of constitutive models and element technology available to the user. In this memo, the basics of isotropic and kinematic hardening for plasticity will be discussed, specifically related to proportional/non-proportional, monotonic/cyclic loading, and finite strain applications.\""
  },
  {
    "title": "Modal Cyclic Symmetry Enhancements at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI12_Cyclic_Symmetry_at_6.0.pdf",
    "description": "\"At ANSYS 6.0, the modal cyclic symmetry procedure has been significantly improved. New commands, CYCLIC and CYCOPT, replace the older CYCGEN and CYCSOL macros and provide more flexibility and ease-of-use.\""
  },
  {
    "title": "Radiosity Solver [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI65_TNT_Radiosity_Solver.pdf",
    "description": "Information on radiation capabilities of ANSYS, focusing on the radiosity solution method.\nAccompanying input files 1, 2, 3 and 4"
  },
  {
    "title": "Structural Beam Elements Overview [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI69_TNT_Beam_Elements.zip",
    "description": "An overview of beam elements available in ANSYS, including the new BEAM188/189 elements and differences between thin and thick beams."
  },
  {
    "title": "Save Working Loads",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/1_1_4.pdf",
    "description": "Iterative Determination of Save Working Loads (SWL) for Crawler Cranes"
  },
  {
    "title": "Shape Memory Alloy",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/Shape_Memory_Alloy.pdf",
    "description": "Short PDF describing differences between the superelastic and shape memory effect options for Shape Memory Alloy (SMA) material model. Simple input file can be downloaded here."
  },
  {
    "title": "SolderTMC.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/SolderTMC.pdf",
    "description": "SolderTMC.pdf"
  },
  {
    "title": "Sparse Solver Improvements [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI04_Sparse_Solver.pdf",
    "description": "\"There have been various sparse solver improvements in each release of ANSYS. This memo hopes to cover some general information on the solvers available in ANSYS as well as performance improvements between ANSYS 5.6 and 6.0 related to linear static analyses.\""
  },
  {
    "title": "Stuparu.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/Stuparu.pdf",
    "description": "Stuparu.pdf"
  },
  {
    "title": "Surface Effect Elements, General Overview",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/surfeff_final1.zip",
    "description": "An overview presentation and example workshop on generating surface effect elements. This is an old presentation I did at ANSYS 5.6.1, so if you use later versions of ANSYS, some of the menus and dialog boxes may have changed."
  },
  {
    "title": "T51-01.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/T51-01.pdf",
    "description": "T51-01.pdf"
  },
  {
    "title": "Fast Nonlinear Transient Thermal Solver [PDF]",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/THOPT.pdf",
    "description": "Information on the fast nonlinear thermal solution method (THOPT), beta in 5.6 and documented in 5.7"
  },
  {
    "title": "Tabular Boundary Conditions and Function Editor at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI09_ANSYS_6.0_Function_Editor.pdf",
    "description": "\"This tips and tricks is an introductory memo on the use of tabular and function boundary conditions. The use of the Function Editor is also discussed.\""
  },
  {
    "title": "The Building Blocks of Simulation: A New Family of Elements for Stress Analysis",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/elements-18x.pdf",
    "description": "Presentation on 18x family of elements (part of the \"Advanced Analysis with ANSYS\"seminar during the 2002 User's Conference)."
  },
  {
    "title": "Towards Automated Determination of USERMAT for the Nonlinear Constitutive Behavior of Composites",
    "author": "J. Michopoulos, P. Mast, R. Badaliance, L. Gause, T. Chwastyk, R. Foerch",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/towards_automated_determination.pdf",
    "description": "\"Recent advances in finite element techniques and design optimization integration technologies along with the parallel hardware and software evolution have directed the CMS group to turn its attention to utilizing \"of the shelf\"technology of achieving the same goals. Thus, the \"Z-mat\"and \"Z-Optim\"packages from Northwest Numerics, Inc., have been utilized to extract the non-linear constitutive response from the available experimental data in an integrated and automated manner and in conjunction with the ANSYS/Mechanical infrastructure. The automation lies on the fact that the process automatically generates the code of a \"USERMAT\"subroutine that it can be subsequently used with any geometry and loading specification definable within the limits of ANSYS' non-linear element library. The geometry of the single notched specimen of NRL's In Plane has been used for developing and verifying the process.\""
  },
  {
    "title": "Tracqui_AB_04.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/Tracqui_AB_04.pdf",
    "description": "Tracqui_AB_04.pdf"
  },
  {
    "title": "Tu.4.7.4.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Tu.4.7.4.pdf",
    "description": "Tu.4.7.4.pdf"
  },
  {
    "title": "Tunneling-Accelerometer-Paper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/Tunneling-Accelerometer-Paper.pdf",
    "description": "Tunneling-Accelerometer-Paper.pdf"
  },
  {
    "title": "Using Abbreviations to Customize the Toolbar [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI03_Customizing_Toolbar.pdf",
    "description": "\"The ANSYS Toolbar provides a useful means of accessing commonly-used functions, especially for users who use the GUI rather than typing in commands.\"\n\n\"This memo hopes to provide a brief introduction to the ANSYS Toolbar and, more importantly, how to assign macros or specific dialog boxes to the Toolbar buttons, including Fnc_ UIDL granules or ~eui Tcl/Tk dialog boxes.\""
  },
  {
    "title": "VectorRotation.zip",
    "author": "Bob Weathers (Trane)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/VectorRotation.zip",
    "description": "\"These macros rotate a matrix of vectors from one set of Euler angles to another. One macro creates the rotation matrix and a second does the rotation. To test the macros, a pressurized cylinder (or optionally a sphere) is built, meshed, and solved in 6 different coordinate systems. To check accuracy, results are rotated from one CSYS to another by the macros and then compared to ANSYS. Set your text editor's tab stops to 2 for macro readability.\"\n\nIn the zip file, \"zTestRotationVector.mac\"is the test model macro, and \"zRotateVector.mac\"is the main macro to rotate vectors.\n\nUpdate 02/07/2009: correction to zRotateVector.mac provided by David Creech."
  },
  {
    "title": "Visualizing structural matrices in ANSYS using APDL",
    "author": "Aaron Acton (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/acton20081119-visualizing_matrices.pdf",
    "description": "\"This article presents a method of visualizing structural matrices used in finite-element analysis using ANSYS and the ANSYS Parametric Design Language (APDL). The information is intended to provide some insight into the nature of structural matrices used in finite-element codes. Some terms used in sparse-matrix arithmetic are discussed, and methods for calculating certain quantities are provided. A test model is constructed to demonstrate how the stiffness, mass, and damping matrices may be visualized for various systems. The effect of element shape, element type (including superelements), element reordering, and equation reordering on structural matrices is briefly investigated.\""
  },
  {
    "title": "WEP125G.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/WEP125G.pdf",
    "description": "WEP125G.pdf"
  },
  {
    "title": "Converting piezoelectric data [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Week13_TNT_Conversion_of_Piezoelectric_Material_Data.pdf",
    "description": "Conversion of material properties of piezoelectric ceramics (such as PZT) has caused many users confusion because of the difference between manufacturer-supplied data and the format required by ANSYS. This memo hopes to clarify this point and to provide users with information on conversion routines. [Accompanying Spreadsheet]()."
  },
  {
    "title": "Thermal Surface Effect Elements Intro [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/Week_11_Surface_Effect_Elements_Thermal.pdf",
    "description": "Introduction to thermal surface effect elements (SURF151/152)."
  },
  {
    "title": "Memory management and configuration [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/Week_14_Memory_Configuration.pdf",
    "description": "Memo on memory management and configuration, especially in conjunction with the PCG solver and options in linear static analyses."
  },
  {
    "title": "Nonlinear monitoring [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/Week_16_Nonlinear_Monitor.pdf",
    "description": "Memo covering the benefits of the jobname.mntr file and the MONITOR command in nonlinear analyses."
  },
  {
    "title": "Converting pressures to nodal forces [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Week_17_STI52_TNT_converting_pressures_to_nodal_forces.pdf",
    "description": "Tip on converting element pressures to nodal forces. This can be useful for mode superposition methods where LVSCALE may not be suitable.\n SI_P2F Macro and test input file."
  },
  {
    "title": "Multiframe Restarts [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Week_19_tip_of_week_restart.pdf",
    "description": "Memo covering the multiframe restart capability (RESCON) in ANSYS.\nAccompanying input file"
  },
  {
    "title": "Windows file association for ANSYS files [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Week_20_Windows_File_Association.pdf",
    "description": "How to associate database, graphics, and input files with ANSYS under Windows, so one can launch ANSYS more easily without the ANSYS launcher."
  },
  {
    "title": "Structural Shell Elements Overview [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/Week_8_Structural_Shell_Elements.pdf",
    "description": "Overview of structural shell elements in ANSYS, including differences between thin and thick shells, drilling DOF, etc."
  },
  {
    "title": "a020.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/a020.pdf",
    "description": "a020.pdf"
  },
  {
    "title": "Clustering Results Around Peaks for Full-Harmonic Analyses in ANSYS",
    "author": "Aaron Acton (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/aacton20080723-clustering.pdf",
    "description": "\"This article presents a method for obtaining full harmonic solutions clustered around potential peak responses. Full harmonic analyses provide exact solutions, typically calculated at equally spaced intervals over the desired frequency range. Mode-superposition analyses, however, provide approximate solutions, but can be clustered around potential resonant peaks. The hybrid method discussed in this article uses a modal solution to determine natural frequencies, which are then used to calculate clusters of points surrounding those frequencies. Full harmonic solutions can then be performed at these clustered points. Examples and input les are provided in order to utilize this method.\""
  },
  {
    "title": "acton20080825-condition_number.pdf",
    "author": "Aaron Acton (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/acton20080825-condition_number.pdf",
    "description": "\"This article presents an overview of the condition number for a matrix and the potential effect of ill conditioning on the solution of a system of linear equations. The information is intended to be general, although specific information relevant to finite-element analysis is also included. Vector and matrix norms are introduced before defining the condition number, and the choice of matrix norm in the calculation of the condition number is discussed. A method of estimating the condition number is also provided, including a sample implementation in the ANSYS Parametric Design Language (APDL).\""
  },
  {
    "title": "ahieke.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ahieke.pdf",
    "description": "ahieke.pdf"
  },
  {
    "title": "alex-fem.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/alex-fem.pdf",
    "description": "alex-fem.pdf"
  },
  {
    "title": "Advancing Analysis Capabilities In ANSYS Through Solver Technology",
    "author": "Gene Poole, Yong-Cheng Liu, and Jan Mandel",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/amg2001.pdf",
    "description": "\"This paper will describe implementation considerations for the addition of new solver technology to a large legacy code, compare resource requirements for the various solver choices and present some comparative results from several customer generated problems. The AMG solver benefits, both in improved robustness and parallel processing efficiency will be described. The paper will also discuss some of the implementation challenges that have been overcome to add new solver technology to a large existing code. The role of solver technology in meeting current and future demands of large scale commercial analysis codes will be discussed.\""
  },
  {
    "title": "analysis-of-reinforced-concrete.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/analysis-of-reinforced-concrete.pdf",
    "description": "analysis-of-reinforced-concrete.pdf"
  },
  {
    "title": "andersen.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/andersen.pdf",
    "description": "andersen.pdf"
  },
  {
    "title": "ansys25b.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ansys25b.pdf",
    "description": "ansys25b.pdf"
  },
  {
    "title": "ansys_mechanical_wp.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/ansys_mechanical_wp.pdf",
    "description": "ansys_mechanical_wp.pdf"
  },
  {
    "title": "ansys_news_1995_3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/ansys_news_1995_3.pdf",
    "description": "ansys_news_1995_3.pdf"
  },
  {
    "title": "ansys_news_1995_4.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/ansys_news_1995_4.pdf",
    "description": "ansys_news_1995_4.pdf"
  },
  {
    "title": "ansys_news_1996_2.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ansys_news_1996_2.pdf",
    "description": "ansys_news_1996_2.pdf"
  },
  {
    "title": "ansys_news_1996_3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/ansys_news_1996_3.pdf",
    "description": "ansys_news_1996_3.pdf"
  },
  {
    "title": "ansys_nitinol_paper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ansys_nitinol_paper.pdf",
    "description": "ansys_nitinol_paper.pdf"
  },
  {
    "title": "ansys_short_course.pdf",
    "author": "Tim Langlais (University of Minnesota)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/ansys_short_course.pdf",
    "description": "A short course on ANSYS, using ANSYS 5.4."
  },
  {
    "title": "ansys_solutions_2002_winter.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/ansys_solutions_2002_winter.pdf",
    "description": "ansys_solutions_2002_winter.pdf"
  },
  {
    "title": "ansys_solutions_2003_fall.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/ansys_solutions_2003_fall.pdf",
    "description": "ansys_solutions_2003_fall.pdf"
  },
  {
    "title": "ansys_solutions_2003_spring.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/ansys_solutions_2003_spring.pdf",
    "description": "ansys_solutions_2003_spring.pdf"
  },
  {
    "title": "ansys_solutions_2003_summer.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/ansys_solutions_2003_summer.pdf",
    "description": "ansys_solutions_2003_summer.pdf"
  },
  {
    "title": "ansysconf_paper_2004_CAEA.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ansysconf_paper_2004_CAEA.pdf",
    "description": "ansysconf_paper_2004_CAEA.pdf"
  },
  {
    "title": "antonova-C2.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/antonova-C2.pdf",
    "description": "antonova-C2.pdf"
  },
  {
    "title": "app_h.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/app_h.pdf",
    "description": "app_h.pdf"
  },
  {
    "title": "asyed_ectc2004_corrected.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/asyed_ectc2004_corrected.pdf",
    "description": "asyed_ectc2004_corrected.pdf"
  },
  {
    "title": "Smartsizing: Automatic Boundary Sizing for 2D and 3D meshes [PDF]",
    "author": "Alexandre L. Cunha, Sunil Saigal, Scott A. Canann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/auto_boundary_sizing.pdf",
    "description": "\"We present in this paper a simple technique, called smart sizing, which automatically computes high quality initial element sizing on curves for triangular, quadrilateral and tetrahedral elements.\""
  },
  {
    "title": "barni1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/barni1.pdf",
    "description": "barni1.pdf"
  },
  {
    "title": "batch.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/batch.zip",
    "description": "This is an example of how to drag-and-drop a .db file onto a DOS batch file to initiate an analysis. \n\n Unzip the file and rename \"Run Nonlinear.txt \"to Run Nonlinear.bat\". Place it on your desktop. \n\n Place \"solve_batch.inp\"in your D: drive or edit \"Run Nonlinear.bat\"to change the location of this APDL input file. \n\n Drag and drop any .db file containing a ready-to-solve nonlinear analysis onto \"Run Nonlinear.bat\". \n\n You will find that the solution will initiate in the same working directory, and you can also track the nonlinear solution graphically as the solution is solving in batch. "
  },
  {
    "title": "Benchmark Tests on ANSYS Parallel Processing Technology",
    "author": "Kentaro Suzuki",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/benchmar_tests_on_ansys_parallel_proc.pdf",
    "description": "\"ANSYS Inc. has released parallel processing solvers, DDS (Distributed Domain Solver) and AMG (Algebraic Multigrid Solver) in ANSYS version 5.7 in order to meet the requirements from the market.\"\n\n\"In this paper, simple tests are first carried out to confirm the features and capabilities of DDS and AMG for different types of analyses. Furthermore, real-life problems such as thermal stress of an engine block (7.3 million DOF) and elastic-plastic-creep behavior of an IC packaging (about 84,000 DOF) are analyzed. The effectiveness of ANSYS parallel processing solvers is also studied.\""
  },
  {
    "title": "benchmark_1.zip",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/benchmark_1.zip",
    "description": "benchmark_1.zip"
  },
  {
    "title": "bericht92.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/bericht92.pdf",
    "description": "bericht92.pdf"
  },
  {
    "title": "BMSweep: Locating Interior Nodes During Sweeping [PDF]",
    "author": "Matthew L. Staten, Scott A. Canann, and Steve J. Owen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/bmsweep.pdf",
    "description": "\"BMSweep is a new algorithm to determine the location of interior nodes while volume sweeping.\""
  },
  {
    "title": "boot.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/boot.zip",
    "description": "Old model originally created back in ANSYS 6.0. Recently tested and seems to solve fine as-is in ANSYS 12.1, so I expect all versions in-between should run fine, too. Hyperelasticity, self-contact, rigid-deformable contact are present. Animation of same model (with finer mesh) is on the gallery page."
  },
  {
    "title": "bzahn00.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/bzahn00.pdf",
    "description": "bzahn00.pdf"
  },
  {
    "title": "bzahn_ball_via_fatigue_paper.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/bzahn_ball_via_fatigue_paper.pdf",
    "description": "bzahn_ball_via_fatigue_paper.pdf"
  },
  {
    "title": "cardiovascular.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/cardiovascular.pdf",
    "description": "cardiovascular.pdf"
  },
  {
    "title": "cj21-wai.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/cj21-wai.pdf",
    "description": "cj21-wai.pdf"
  },
  {
    "title": "closed_tank.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/closed_tank.zip",
    "description": "Comparison of FLUID30 (acoustic fluid element) and FLUID80 (contained fluid element) for sloshing in a tank."
  },
  {
    "title": "An Approach to Combined Laplacian and Optimization-Based Smoothing for Triangular, Quadrilateral, and Quad-Dominant Meshes [PDF]",
    "author": "Scott A. Canann, Joseph R. Tristano, Matthew L. Staten",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/combined_l_o_smoothing.pdf",
    "description": "\"In this paper, an overall mesh smoothing scheme is presented for meshes consisting of triangular, quadrilateral, or mixed triangular and quadrilateral elements. This paper describes an efficient and robust combination of constrained Laplacian smoothing together with an optimization-based smoothing algorithm.\""
  },
  {
    "title": "comparison_of_biomechanical_breast_models.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/comparison_of_biomechanical_breast_models.pdf",
    "description": "comparison_of_biomechanical_breast_models.pdf"
  },
  {
    "title": "compressive.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/compressive.pdf",
    "description": "compressive.pdf"
  },
  {
    "title": "conflong_castiron.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/conflong_castiron.pdf",
    "description": "conflong_castiron.pdf"
  },
  {
    "title": "conflong_creep.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/conflong_creep.pdf",
    "description": "conflong_creep.pdf"
  },
  {
    "title": "conflong_gasket.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/conflong_gasket.pdf",
    "description": "conflong_gasket.pdf"
  },
  {
    "title": "conflong_hyperel.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/conflong_hyperel.pdf",
    "description": "conflong_hyperel.pdf"
  },
  {
    "title": "conflong_viscoel.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/conflong_viscoel.pdf",
    "description": "Presentation on the viscoelasticity model, introduced in ANSYS 6.1, available for both hypo- and hyper-elasticity (part of the \"Advanced Analysis with ANSYS\"seminar during the 2002 User's Conference)."
  },
  {
    "title": "PDF file summarizing beta contact features at 5.6.1 [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/contact_beta_56.pdf",
    "description": "Presentation on the thermal contact and fluid pressure capabilities of the surface-to-surface contact elements. This was written when these capabilities were beta at 5.6. Thermal capabilites are documented at 5.7.\nAccompanying thermal contact example and fluid pressure example"
  },
  {
    "title": "contact_tech.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/contact_tech.pdf",
    "description": "contact_tech.pdf"
  },
  {
    "title": "coolingreview.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/coolingreview.pdf",
    "description": "coolingreview.pdf"
  },
  {
    "title": "cpainter_SPIE.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/cpainter_SPIE.pdf",
    "description": "cpainter_SPIE.pdf"
  },
  {
    "title": "creating Custom Animations [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI01_Creating_Custom_Animations.zip",
    "description": "\"Animations are quite useful, both in presenting results of an analysis to others as well as obtaining better insight into the complex response of a system. While ANSYS has many built-in animation capabilities, sometimes, it may be necessary to create a macro for a customized animation. This memo covers one method of generating such animations.\""
  },
  {
    "title": "Comparison of Rectangular and Spherical Models",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/cubeandsphere.pdf",
    "description": "\"The purpose of this investigation was to compare the two modelling techniques for an infinite boundary. The first technique involves setting the elements on the edges of the model to have an absorptive property by changing the material properties so that mu=1. The second technique involves the use of infinite elements (infinite129) that must be placed on a constant radius curvature.\""
  },
  {
    "title": "Cyclic Symmetry Analysis",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/cyclic_symmetry_analysis.pdf",
    "description": "Presentation on cyclic symmetry enhancements at ANSYS 6.1 (part of the \"Advanced Analysis with ANSYS\"seminar during the 2002 User's Conference)."
  },
  {
    "title": "dakota.zip",
    "author": "Dave Lindeman (3M)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/dakota.zip",
    "description": "\"I recently experimented with coupling ANSYS and DAKOTA, and thought the list might be interested in the results. DAKOTA, if you're not familiar with it, is a public-domain optimization code available from Sandia National Laboratories (see http://endo.sandia.gov/DAKOTA/). It has several advanced optimization algorithms (e.g., genetic algorithms), supports discrete variables, and has several other features that make it a nice complement to the optimization and probabilistic design modules within ANSYS. And it's FREE.\n\n\"Anyways, the procedure for using DAKOTA with ANSYS consists of creating a DAKOTA input file (DAKOTA in the attachments) that identifies the design variables, state variables, optimization method, etc. Also, within this file you identify the command to be issued to execute the code you are using to generate the response variables (analysis_driver = 'ansys.prl', in the attached example). To execute ANSYS I use an intermediate Perl script (ansys.prl) that translates the design variable file generated by DAKOTA (parameters_file = 'dakota.dv') into something ANSYS can understand (written out to ansys.dv). The Perl script then executes ANSYS. Note that the Perl script is general purpose -- it should work for any application. The only thing you should need to change is filenames, in particular the name of your ANSYS script (in my example, 'ANSYS'). The ANSYS script reads in the design variable file using /INPUT, performs the analysis, then outputs the result variables to a file (results_file = 'dakota.rv') using *CFOPEN and *VWRITE.\n\n\"To execute the analysis you use (for example) the command line: dakota -i DAKOTA > dakota.log &\n\n\"That's pretty much it. Pretty straightforward once you figure out the DAKOTA input file syntax. The attached example is the simple beam optimization problem used in the ANSYS documentation.\""
  },
  {
    "title": "demotlbr.zip",
    "author": "(PADT)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/demotlbr.zip",
    "description": "\"To use this demonstration of the ANSYS toolbar capabilities extract these files to your working directory. You must then copy the tlbrlist61.ans file from the ANSYS installation docu/english/tlbrlist61.ans to your working directory. Add DEMO.TLB to the bottom of the file. Run ANSYS and then move the split bar at the bottom up to show the bottom pane where the demo toolbar is embedded.\"\n Example showing how to customize the ANSYS 6.1 Toolbar."
  },
  {
    "title": "diemold2001.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/diemold2001.pdf",
    "description": "diemold2001.pdf"
  },
  {
    "title": "disrpap.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/disrpap.pdf",
    "description": "disrpap.pdf"
  },
  {
    "title": "DesignSpace Tutorial 2",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/dspace_assembly.zip",
    "description": "Simple tutorial on analyzing assemblies using DesignSpace with focus on compatibility with SolidWorks."
  },
  {
    "title": "DesignSpace Tutorial 1",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/dspace_part.zip",
    "description": "Simple tutorial on analyzing parts using DesignSpace with focus on compatibility with SolidWorks."
  },
  {
    "title": "effects_of_nonlinear_geometric.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/effects_of_nonlinear_geometric.pdf",
    "description": "effects_of_nonlinear_geometric.pdf"
  },
  {
    "title": "elastdata_Unix.zip",
    "author": "Hursha Narayan (Robert Bosch Corporation)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/elastdata_Unix.zip",
    "description": "Macro for a fully automated procedure for calculating M-R coefficients from Test Data\n\"I have developed a macro that fully automates the importing of elastomer test data into ANSYS and calculate the Mooney-Rivlin coefficients. The macro uses Lagrange interpolation technique to calculate the stress data at equal intervals of strain. This can then be read into an array in ANSYS to evaluate the M-R coeffs. I'm sending you Windows and Unix version of the macro. The difference between the two versions are in the awk and script files that I use to manipulate data. The user needs to go through all the files just to change the directories where the files will be located and accessed. The files reformat(Unix) and reformat.csh(windows) should have rwx permissions. The reformat.csh used in windows can be converted to a batch file. Awk utility should be available under windows. The procedure expects Simple Tension, Planar Tension and Biaxial Extension data to be available.\""
  },
  {
    "title": "Physics first, using ANSYS to define the design: Real-life examples from the automotive supplier company Mannesmann VDO",
    "author": "Zlatko Penzar",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/end02111b_pdf.pdf",
    "description": "\"In many non-standard engineering development applications it strongly pays off to invest an effort into understanding the physics of the problem prior to undertaking complex numerical simulations. The better the knowledge of the leading physical effects in a complex system, the simpler and more cost-efficient the analytical model can be. Moreover, the understanding of the most important physical driving effects often enables one to build a simplified, closed-form mathematical effective model. Such models usually give insight into the interplay of various parameters governing the physical behavior of the complex system. In this way, a fast pre-optimization of the desired features is often possible. Subsequently, the rich arsenal of ANSYS multiphysics capabilities can be used to refine the judgements and obtain the desired quantitative solutions.\""
  },
  {
    "title": "erfurt02new_detector-reprint.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/erfurt02new_detector-reprint.pdf",
    "description": "erfurt02new_detector-reprint.pdf"
  },
  {
    "title": "Local Approximation Estimators For Algebraic Multigrid",
    "author": "Jan Mandel",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/estim.pdf",
    "description": "\"We are concerned with the development of Algebraic Multigrid (AMG) for symmetric, positive definite linear systems arizing from finite element discretization of elliptic partial differential equations. AMG methods attempt to create coarse levels from the algebraic system automatically, using no or only a minimum of additional information. The basic idea of the multigrid algorithm is that fine level error on which the smoothing process is not effective should be reduced by the coarse correction. Therefore, a-priori estimates of the approximation of fine level functions by coarse level function are important to guide the design of robust AMG methods.\""
  },
  {
    "title": "expansion.pdf",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/expansion.pdf",
    "description": "This is a description of an ANSYS Workbench 13.0 project and the use of the HSFLD242 (hydrostatic fluid) element. It is a fictitious model of the expansion of a tire and subsequent displacement-loading to a rigid surface (e.g., ground)."
  },
  {
    "title": "fiber_concrete.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/fiber_concrete.pdf",
    "description": "fiber_concrete.pdf"
  },
  {
    "title": "finite-element-levator.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/finite-element-levator.pdf",
    "description": "finite-element-levator.pdf"
  },
  {
    "title": "finite_element_analysis_of_crowning_caps.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/finite_element_analysis_of_crowning_caps.pdf",
    "description": "finite_element_analysis_of_crowning_caps.pdf"
  },
  {
    "title": "finite_element_based_solder_joint_fatigue.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/finite_element_based_solder_joint_fatigue.pdf",
    "description": "finite_element_based_solder_joint_fatigue.pdf"
  },
  {
    "title": "flotran_chills_out.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/flotran_chills_out.pdf",
    "description": "flotran_chills_out.pdf"
  },
  {
    "title": "fp8542.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/fp8542.pdf",
    "description": "fp8542.pdf"
  },
  {
    "title": "frequency_response.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/frequency_response.pdf",
    "description": "frequency_response.pdf"
  },
  {
    "title": "fsi-ansys.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/fsi-ansys.pdf",
    "description": "fsi-ansys.pdf"
  },
  {
    "title": "gasketed_flanges_ordinary_elements_apdl_control.pdf",
    "author": "Yasumasa Shoji, Satoshi Nagata",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/gasketed_flanges_ordinary_elements_apdl_control.pdf",
    "description": "\"The analysis of gasketted flanges is now becoming an essential technique to design pressure vessels or piping, because the design code is being modified. On the other hand, the gasket has an extreme nonlinearity which causes the analysis to be very difficult, especially using linear material properties. A finite element analysis program other than ANSYS has the element library for gasket element, but ANSYS does not have it yet.\"\r\n \r\n \"The authors developed a method to model this nonlinear gasket by using the elements available in ANSYS Rel. 5.5 for 2-dimensional axisymmetric analysis and those in Rel. 5.6 for 3-dimensional analysis. In this paper, the concept and the procedure of the modeling is introduced. The data input is possible using a template, without using any other ANSYS commands. The whole analysis execution is controlled by APDL.\"\r\n \r\n [STI: Gasket elements are available from version 6.1 onwards, after this paper was written]"
  },
  {
    "title": "A DOS-Enhanced Numerical Simulation of Heat Transfer and Fluid Flow Through an Array of Offset Fins with Conjugate Heating in the Bounding Solid",
    "author": "E.M. Sparrow, J.P. Abraham, P.W. Chevalier",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/general_Reports_rptfiles_2005-263.pdf",
    "description": "\"The method of Design of Simulation (DOS) was used to guide and enhance a numerical simulation of fluid flow and heat transfer through offset-fin arrays which form the interior geometry of a cold plate. The basic problem involved 11 independent parameters. This prohibitive parametric burden was lessened by the creative use of nondimensionalization that was brought to fruition by a special transformation of the boundary conditions. Subsequent to the reduction of the number of parameters, the DOS method was employed to limit the number of simulation runs while maintaining an accurate representation of the parameter space. The DOS method also provided excellent correlations of both the dimensionless heat transfer and pressure drop results. The results were evaluated with respect to the Colburn Analogy for heat and momentum transfer. It was found that the offseting of the fins created a larger increase in the friction factor than that which was realized for the dimensionless heat transfer coefficient.\"\n\nSimilar paper can be found here.\n[ANSYS Flotran, version unknown]"
  },
  {
    "title": "groothuis.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/groothuis.pdf",
    "description": "groothuis.pdf"
  },
  {
    "title": "grph2svg.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/grph2svg.zip",
    "description": "This is a quick hack I did to generate SVG files from within ANSYS. There are 3 macros contained in the zip file: GRPH2SVG.MAC is the main one, and the other two are called by GRPH2SVG.\n\n The macro redirects the plot to an ANSYS Graphics file \"stiplot.grph\". Then, the macro parses through the GRPH file and generates an SVG file called \"stiplot.svg\". You can change the font, font size, etc. as you see fit from within the macro. (For details on the contents of the GRPH file, refer to the ANSYS Programmer's Guide for details.)\n\nBecause this parses the GRPH file from within ANSYS, it is slow for complex plots, so I recommend using it only for XY plots — this is only meant to serve as an example of what can be done with APDL and reading the GRPH file contents. Also, I did not bother including support for raster graphics - this macro only supports vector graphics. (If you want raster graphics, use of PNG is better. SVG is really a vector graphics implementation.)\n\nIf you're running Firefox, or if you use Internet Explorer and have the Adobe SVG Viewer Plug-in, you can see a sample contour plot and sample XY plot generated from this macro.\n\nBecause this was created by hand, there may be mistakes - you can let me know if you encounter any. Otherwise, instead of using this macro, you can create an EPS file and use your favorite illustration software to convert it to an SVG file."
  },
  {
    "title": "Example harmonic analysis using the large mass method [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/harmonic-large-mass-method.pdf",
    "description": "Step-by-step instructions on performing an example harmonic analysis using the large mass method."
  },
  {
    "title": "harmonic_and_random.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/harmonic_and_random.zip",
    "description": "This zip file contains a simple example - single input PSD table for base excitation of a fictitious structure - run as both random vibration and harmonic response analyses. The user can review the contents of the two input files and see how one can relate harmonic analyses (the transfer function) to the response PSD in random vibration analyses. (Actually, one can also look it up in any dynamics textbook, but this just shows how one can do it in ANSYS.) \r\n \r\n (See also TFUN undocumented command to get the transfer function after a random vibration analysis.)"
  },
  {
    "title": "harmonic_cms.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/harmonic_cms.zip",
    "description": "Simple beam example showing procedure for using CMS (component mode synthesis). Same results for the full model (no CMS) and the CMS model."
  },
  {
    "title": "hyper_elasticcity_curvefitting.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/hyper_elasticcity_curvefitting.pdf",
    "description": "hyper_elasticcity_curvefitting.pdf"
  },
  {
    "title": "hyperelasti_contact_analysis.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/hyperelasti_contact_analysis.pdf",
    "description": "hyperelasti_contact_analysis.pdf"
  },
  {
    "title": "ibmrd3705C.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ibmrd3705C.pdf",
    "description": "ibmrd3705C.pdf"
  },
  {
    "title": "ibmrd3705E.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/ibmrd3705E.pdf",
    "description": "ibmrd3705E.pdf"
  },
  {
    "title": "icpkg.zip",
    "author": "Steve Groothuis (Micron Technology, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/icpkg.zip",
    "description": "\"An example of IC package assembly using element birth and death - a simple 5-step die attach, injection molding, and cool-down processes during IC packaging. (compliments to Bill Bulat on concept)\"\r\n Unzip the file and read in \"icpkg.inp\"."
  },
  {
    "title": "impedance.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/impedance.zip",
    "description": "Example of the use of complex impedance at a surface, which is a new feature in version 13.0 (for 3D FLUID30, FLUID220, FLUID221 acoustic elements). This is a radiating monopole source. Comparison with infinite FLUID130 shows same results with appropriate value of SF,,IMPD defined."
  },
  {
    "title": "implant_stent.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/implant_stent.pdf",
    "description": "implant_stent.pdf"
  },
  {
    "title": "inistate.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/inistate.zip",
    "description": "This is a very simple example using Workbench Mechanical 12.0.1 to demonstrate use of the INISTATE command in defining initial stress. \r\n Open Workbench 12.0.1 (or 12.1) and use \"File > Restore Archive ...\"and select the zip file to open the model. Solving should take less than a minute. \r\n  The model is a simple bar. The first analysis branch has 10e3 psi initial stress only in the x-direction. Notice that the block is free to expand - it only has symmetry boundary conditions. The final results show basically zero stress and displacement of -8.1455e-4 inches. Since initial stress is 10e3 and elastic modulus is 29e6 with a length of 2.3622 inches: \r\n 10e3 / 29e6 * 2.3622 = 8.1455e-4 \r\n which is the same answer as given by ANSYS. \r\n \r\n The second analysis branch also has 10e3 psi initial stress only in x-direction. However, there is a Frictionless Support preventing the block from expanding. Final results show displacement basically of zero, and stress of 10e3 psi. This is because the initial stress cannot relax due to the boundary conditions, so the final stress = initial stress in this particular case."
  },
  {
    "title": "instantaneous_secant_TCE.zip",
    "author": "Bill Bulat (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/instantaneous_secant_TCE.zip",
    "description": "Macro to convert instantaneous thermal coefficients of expansion to secant values, with example input file. (This is a zipped file)"
  },
  {
    "title": "jb99_14.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/jb99_14.pdf",
    "description": "jb99_14.pdf"
  },
  {
    "title": "jhs.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/jhs.pdf",
    "description": "jhs.pdf"
  },
  {
    "title": "jm0323.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/jm0323.pdf",
    "description": "jm0323.pdf"
  },
  {
    "title": "kurian.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/kurian.pdf",
    "description": "kurian.pdf"
  },
  {
    "title": "kyshen.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/kyshen.pdf",
    "description": "kyshen.pdf"
  },
  {
    "title": "large_area_heinemann.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/large_area_heinemann.pdf",
    "description": "large_area_heinemann.pdf"
  },
  {
    "title": "lau.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/lau.pdf",
    "description": "lau.pdf"
  },
  {
    "title": "limit_load.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/limit_load.pdf",
    "description": "limit_load.pdf"
  },
  {
    "title": "ANSYS PDS article in Machine Design [PDF]",
    "author": "Stefan Reh",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/machdesn_pds.pdf",
    "description": "While this may not be a conventional technical paper, it presents information on ANSYS PDS (Probabilistic Design System), a beta feature in 5.6 and officially released in 5.7. Instead of a deterministic approach, a stochastic method provides better product reliability measures"
  },
  {
    "title": "marval_inzen_mech2007.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/marval_inzen_mech2007.pdf",
    "description": "marval_inzen_mech2007.pdf"
  },
  {
    "title": "mat2001_I1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/mat2001_I1.pdf",
    "description": "mat2001_I1.pdf"
  },
  {
    "title": "matlab.zip",
    "author": "Rick Morgans (Adelaide University)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/matlab.zip",
    "description": "\"On this subject, I've been meaning to post these for ages -> we've been using these macros to transfer variables between ansys and matlab for yonks. They write and read variables from ansys and matlab -> you can check them out to see how they do it (i.e. I cant remember off of the top of my head) -> I think they write out a format header then write the rest of the variable as a single column.\n\nvarread.m\nread variable into matlab\n\nvarread.mac\nread variable into ansys\n\nvarreadc.m\nread 2 column ansys variable into matlab as a complex variable\n\nvarreadcp.m\nread \"packed\"2 column variable into matlab as complex variable\n\nvarreadp.m\nread \"packed\"variable into matlab\n\nvarreadp.mac\nread \"packed\"variable into ansys\n\nvarwrite.m\nwrite a variable from matlab\n\nvarwrite.mac\nwrite a variable from ansys\n\nvarwritep.mac\nwrite a variable from ansys in \"packed\"format using a vmask\""
  },
  {
    "title": "Algebraic Multigrid By Smoothed Aggregation For Second And Fourth Order Elliptic Problems",
    "author": "Petr Van Ek, Jan Mandel, and Marian Brezina",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/meis.pdf",
    "description": "\"An algebraic multigrid algorithm for symmetric, positive definite linear systems is developed based on the concept of prolongation by smoothed aggregation. Coarse levels are generated automatically. We present a set of requirements motivated heuristically by a convergence theory. The algorithm then attempts to satisfy the requirements. Input to the method are the coefficient matrix and zero energy modes, which are determined from nodal coordinates and knowledge of the differential equation. Efficiency of the resulting algorithm is demonstrated by computational results on real world problems from solid elasticity, plate bending, and shells.\""
  },
  {
    "title": "mems-thermal-analogy-fsi-damping.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/mems-thermal-analogy-fsi-damping.pdf",
    "description": "mems-thermal-analogy-fsi-damping.pdf"
  },
  {
    "title": "mems_1_of_3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/mems_1_of_3.pdf",
    "description": "mems_1_of_3.pdf"
  },
  {
    "title": "mems_2_of_3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/mems_2_of_3.pdf",
    "description": "mems_2_of_3.pdf"
  },
  {
    "title": "mems_3_of_3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/mems_3_of_3.pdf",
    "description": "mems_3_of_3.pdf"
  },
  {
    "title": "memsissue1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/memsissue1.pdf",
    "description": "memsissue1.pdf"
  },
  {
    "title": "memsissue2.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/memsissue2.pdf",
    "description": "memsissue2.pdf"
  },
  {
    "title": "memsissue3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/memsissue3.pdf",
    "description": "memsissue3.pdf"
  },
  {
    "title": "memsissue4.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/memsissue4.pdf",
    "description": "memsissue4.pdf"
  },
  {
    "title": "methods_for_modeling_bolts.pdf",
    "author": "Jerome Montgomery",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/methods_for_modeling_bolts.pdf",
    "description": "\"Modeling bolts for three-dimensional finite element applications have, and still continue to raise questions. The limitations on model size sometimes make modeling of solid bolts impractical. Therefore, many analysts choose other methods to model bolts. Line elements with coupled nodes and line elements with spider beams are a couple of alternative approaches. This paper looks at a few methods for modeling pretension bolted joints using the finite element method (ANSYS 5.7). Pretension is modeled using ANSYS pretension elements (PRETS179) which can be used on solid or line element types. Surface-to-surface contact elements are used to account for varying contact distribution along flanges. Bolt head and nut behavior is modeled by, coupled nodes, beam elements, rigid body elements (RBE3), or solids. Bolt stud is modeled by solid elements, beam elements, pipe elements, or link elements. The choice of line elements versus solid elements is determined by the degree of complexity sought. The pros and cons of different simulations are also discussed.\""
  },
  {
    "title": "micro3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/micro3.pdf",
    "description": "micro3.pdf"
  },
  {
    "title": "Modeling Diesel Engine Cylinder Head Gaskets using the Gasket Material Option of the SOLID185 Element",
    "author": "Jonathan Raub",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/modeling_disel_engine_cylinder_gaskets.pdf",
    "description": "\"The modeling of diesel engine cylinder head gasket joints is complicated by the nonlinear response of the head gasket’s materials. Linearization of these material responses can lead to significant errors in the solution’s results. The 1-dimensional nonlinear approximation made by the Gasket material option of the SOLID185 element sufficiently captures the response of the nonlinear gasket materials while maintaining practical solution times for the large model sizes associated with multi-cylinder head gasket joint models. This paper will give an overview of the model building and assembly process used to create a head gasket joint model, describe the nonlinear nature of the materials used in the model, and present comparisons of the model’s results with experimental measurements.\"\n\n[STI: There is a gasket-specific material & element in 6.1, not available at the time of the writing]"
  },
  {
    "title": "Numerial Implementation of Multiaxial High-Cycle Fatigue Criterion to Structural Optimization",
    "author": "Miroslaw Mrzyglód, Andrzej P. Zielinski",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/mrzyg-ziel-3-06.pdf",
    "description": "\"Modern multiaxial high-cycle fatigue criteria were investigated with respect to their application in structural optimization procedures coupled with finite element codes. As a result of tests carried out for several fatigue criteria, the Dang Van hypothesis was used for the detailed numerical study. A way of respective adapting the high-cycle load history was also suggested. The complete algorithm of the fatigue optimization was illustrated by applying the proposed procedures to vehicle parts which are subject to high-cycle loadings. The finite element code ANSYS was used in the structural modeling.\"\n\n[ANSYS Structural, version 8.1]"
  },
  {
    "title": "muffler.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/muffler.zip",
    "description": "This memo provides basic instruction on performing acoustic analyses in Workbench Mechanical 14.0. An example of calculation of transmission loss in a muffler is demonstrated."
  },
  {
    "title": "mutamba2.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/mutamba2.pdf",
    "description": "mutamba2.pdf"
  },
  {
    "title": "mw2000_1031.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/mw2000_1031.pdf",
    "description": "mw2000_1031.pdf"
  },
  {
    "title": "Construction Machinery Cab Vibro-Acoustic Analysis and Optimisation",
    "author": "L. Bregant, G. Miccoli, M. Seppi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/nafems05c.pdf",
    "description": "\"A 3D cavity representing the earth-moving machine cab has been modelled by means of a FE structural mesh (Ansys), reproducing the characteristics of the real structure. Starting from the cab vibration load experimental acquisition, a BEM coupled analysis (Sysnoise) has been carried out to evaluate the cab inner vibro-acoustic field as a function of the physical properties of each structural element. A multi-objective design optimisation code (modeFrontier) drives the analysis process flow taking into account the cab parameter structural modifications and carrying out the vibro-acoustic field optimisation.\"\n[ANSYS Dynamics, version unspecified]"
  },
  {
    "title": "Neighborhood-based Element Sizing Control for Finite Element Surface Meshing [PDF]",
    "author": "Steven Owen, and Sunil Saigal",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/neighborhood_size_control.pdf",
    "description": "\"A method is presented for controlling element sizes on the interior of areas during surface meshing. A Delaunay background mesh is defined over which a neighborhood based interpolation scheme is used to interpolate element sizes.\""
  },
  {
    "title": "nonlinear_domain_decomposition_method.pdf",
    "author": "Iakov Mordukhovich Klebanov, Andrei Nikolaevich Davydov",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/nonlinear_domain_decomposition_method.pdf",
    "description": "\"A new domain decomposition technique for parallelization of physically non-linear problems in solid mechanics is developed. It is extended for any stress-strain diagrams. The approach is based on the approximating generalized models of subdomains that leads to a considerably fewer number of iterations requiring updating of substructure parameters. The analytical proof of the convergence of the theoretical iterative procedure and the demonstration of convergence of its numerical implementation with the help of ANSYS are presented.\""
  },
  {
    "title": "nonlinear_finite_element_modeling_titanium.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/nonlinear_finite_element_modeling_titanium.pdf",
    "description": "nonlinear_finite_element_modeling_titanium.pdf"
  },
  {
    "title": "nonlinear_problems_of_steel_civil_structures.pdf",
    "author": "Milan Vasek",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/nonlinear_problems_of_steel_civil_structures.pdf",
    "description": "\"The civil engineering structures are today designed with respect to the limit state of serviceability and limit states of the strength and stability. The design of more efficient and light structures leads to the nonlinear analysis of deflections and stresses. Some parts of structure could reach the yield point under the design load. Some parts of structure could lose their local stability. These complex problems of a different nature are possible to solve by FEM methods.\""
  },
  {
    "title": "numib695.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/numib695.pdf",
    "description": "numib695.pdf"
  },
  {
    "title": "An Object Oriented Approach to Geometry Defeaturing for Finite Element Meshing [PDF]",
    "author": "Anton V. Mobley, Michael P. Carroll, and Scott A. Canann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/object_oriented_defeaturing.pdf",
    "description": "\"In this paper, an object-oriented approach to automatic geometry defeaturing is presented. The geometric and finite element data abstractions are given, along with the basic algorithms used.\""
  },
  {
    "title": "Design Optimization of an Automotive Universal Joint Considering Manufacturing Cost",
    "author": "Nick Cristello and Il Yong Kim",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/p499-cristello.pdf",
    "description": "\"This paper presents the shape optimization of an automotive universal joint, by simultaneously considering manufacturing cost, maximum drivable joint angle and part volume. Comprised of three main components - two yokes and a cross trunnion - a universal joint is a linkage used to transmit rotational motion from one shaft to another when the axes are coplanar, but not coinciding. In this research, universal joint designs are analyzed and compared using a weighted sum of three objective functions: minimization of machining cost, maximization of adjoining shaft joint angle, and minimization of total part volume. Part modeling and analysis is conducted using the Finite Element Analysis package ANSYS and optimization is implemented using MATLAB. The results show Pareto frontiers for both the flange and weld yoke, constructed using the Adaptive Weighted Sum technique. These frontiers clearly illustrate the trade-off between machining cost and joint angle; that is, to increase the joint angle, a corresponding increase in the cost of the part is required. It has been shown that maximization of driveable joint angle requires a simultaneous increase in machining cost of 4.4% and 2.7% for the flange and weld yoke, respectively.\"\n[ANSYS Structural, version 9.0]"
  },
  {
    "title": "An Introduction to the Conjugate Gradient Method Without the Agonizing Pain",
    "author": "Jonathan R. Shewchuk",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/painless-conjugate-gradient.pdf",
    "description": "This paper presents a very well-written explanation of conjugate gradient methods. It is helpful in understanding better the idea behind CG solvers in ANSYS (PCG, JCG, ICCG, AMG, etc.)."
  },
  {
    "title": "penny3d.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/penny3d.zip",
    "description": "Simple example using ANSYS Workbench 12.0 to show one way to generate a penny-shaped crack (3D crack) for fracture mechanics (using CINT command to evaluate J-integral and stress intensity factors)."
  },
  {
    "title": "popelar1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/popelar1.pdf",
    "description": "popelar1.pdf"
  },
  {
    "title": "popelar3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/popelar3.pdf",
    "description": "popelar3.pdf"
  },
  {
    "title": "Post Refinement Element Shape Improvement for Quadrilaterial Meshes [PDF]",
    "author": "Matthew L. Staten and Scott A. Canann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/post_refinement_quad.pdf",
    "description": "\"This paper presents techniques for improving the quality of quadrilateral meshes after Schneiders' refinement. Improvement techniques use topology and node valence optimization rather than shape metrics. Hence, improvement is computationally inexpensive.\""
  },
  {
    "title": "prony.zip",
    "author": "John Thompson (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/prony.zip",
    "description": "Macro to do curve-fitting for TB,PRONY constants for given relaxation data.\n[STI: Note that, at 8.0 and above, curve-fitting of TB,PRONY is directly available in ANSYS with the TBFT command.]"
  },
  {
    "title": "Radiation article in ANSYS Solutions Magazine [PDF]",
    "author": "Dave Looman (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/radiation.pdf",
    "description": "Overview of ANSYS's radiation capabilities, including a discussion on the radiosity solution method."
  },
  {
    "title": "rbcm22.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/rbcm22.pdf",
    "description": "rbcm22.pdf"
  },
  {
    "title": "Creep Resistance and Creep Bending Resistance of Light Metal Matrix Composites for Research in Airframe Structural Effiency",
    "author": "E. Neubauer and H.Peter Degischer",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/report35.pdf",
    "description": "\"Main aim of the research in the frame of the AMTT programme was the testing of a fiber reinforced Al-alloy. For investigation of the creep behaviour of this material, creep tests under bending were performed. The tested material was Al99.85+0.1%Mg reinforced with Al2O3 fibers (Altex/Sumitomo), which was prepared by means of gas pressure infiltration. Main benefit of such a material for application would be the lowering of the weight of the material without a loss of properties.\"(see Appendix A for ANSYS use in this document)"
  },
  {
    "title": "roller.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/roller.zip",
    "description": "Simple example of a hollow metal pipe being bent by rollers. Rigid-deformable contact, metal plasticity, use of Joints (MPC184) are in the Workbench Mechanical 12.1 model."
  },
  {
    "title": "siysdcap",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/siysdcap.zip",
    "description": "Tip on visualizing the Drucker-Prager Cap model yield surface."
  },
  {
    "title": "skinner_thesis.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/skinner_thesis.pdf",
    "description": "skinner_thesis.pdf"
  },
  {
    "title": "ANSYS Equation Solvers: Usage and Guidelines",
    "author": "Gene Poole (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/solver_2002.pdf",
    "description": "Discussion of ANSYS solvers, focusing on the sparse direct solver and PCG iterative solver.\nOriginally presented at the 2002 Conference."
  },
  {
    "title": "spice1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/spice1.pdf",
    "description": "spice1.pdf"
  },
  {
    "title": "spice2.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/spice2.pdf",
    "description": "spice2.pdf"
  },
  {
    "title": "spie98.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/spie98.pdf",
    "description": "spie98.pdf"
  },
  {
    "title": "sprs_mprs.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/sprs_mprs.zip",
    "description": "The attached zip file includes a simple example demonstrating the procedure to perform a single-point response spectrum (SPRS), where the excitation in 3 direction is applied together (using SRSS combination), not independently. The procedure for multi-point response spectrum (MPRS) is included as well for the same situation. An Excel spreadsheet shows that the results obtained for this simple model is the same for both methods (compare the mode coefficients for each squared mode in the spreadsheet)."
  },
  {
    "title": "st_wave00.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/st_wave00.pdf",
    "description": "st_wave00.pdf"
  },
  {
    "title": "substr-fullpost.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/substr-fullpost.zip",
    "description": "Fictitious model used to demonstrate substructuring. SETRAN and SESYMM are used to translate and reflect a superelement. RSPLIT and RSTOFF are also used, and postprocessing of the entire model (superelements and non-superelements) is shown."
  },
  {
    "title": "Structural surface Effect Elements, General Overview",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/surfeff_final2.zip",
    "description": "An overview presentation and example workshop on structural surface effect elements. This is an old presentation I did at ANSYS 5.6.1, so if you use later versions of ANSYS, some of the menus and dialog boxes may have changed."
  },
  {
    "title": "Thermal surface Effect Elements, General Overview",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/surfeff_final3.zip",
    "description": "An overview presentation and example workshop on thermal surface effect elements. This is an old presentation I did at ANSYS 5.6.1, so if you use later versions of ANSYS, some of the menus and dialog boxes may have changed."
  },
  {
    "title": "t2107.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/t2107.pdf",
    "description": "t2107.pdf"
  },
  {
    "title": "ta_94-1.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ta_94-1.pdf",
    "description": "ta_94-1.pdf"
  },
  {
    "title": "tan_wei_200804_phd.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/tan_wei_200804_phd.pdf",
    "description": "tan_wei_200804_phd.pdf"
  },
  {
    "title": "Thermal contact overview [PDF]",
    "author": "Yongyi Zhu (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/tcontact.pdf",
    "description": "Presentation on the thermal contact capabilities of the surface-to-surface contact elements, beta at 5.6.\nInput file for pressure-dependent thermal conductance"
  },
  {
    "title": "Predicting Human Thermal Comfort in a Transient Nonuniform Thermal Environment",
    "author": "J.P. Rugh, R.B. Farrington, D. Bharathan, A. Vlahinos, R. Burke, C. Huizenga, and H. Zhang",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/thermal_comfort.pdf",
    "description": "\"The National Renewable Energy Laboratory (NREL) has developed a suite of thermal comfort tools to assist in the development of smaller and more efficient climate control systems in automobiles. These tools, which include a 126-segment sweating manikin, a finite element physiological model of the human body, and a psychological model based on human subject testing, are designed to predict human thermal comfort in transient nonuniform thermal environments such as automobiles. The manikin measures the heat loss from the human body in the vehicle environment and sends the heat flux from each segment to the physiological model. The physiological model predicts the body’s response to the environment, determines 126 segment skin temperatures, sweat rates, and breathing rate, and transmits the data to the manikin. The psychological model uses temperature data from the physiological model to predict the local and global thermal comfort as a function of local skin and core temperatures and their rates of change. Results of initial integration testing show the thermal response of a manikin segment to transient environmental conditions.\"\n\n[ANSYS Thermal, version unknown]"
  },
  {
    "title": "tmi98.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/tmi98.pdf",
    "description": "tmi98.pdf"
  },
  {
    "title": "tms95.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/tms95.pdf",
    "description": "tms95.pdf"
  },
  {
    "title": "transducers-paper_3.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/transducers-paper_3.pdf",
    "description": "transducers-paper_3.pdf"
  },
  {
    "title": "Fully Automatic Adaptive Mesh Refinement Integrated into the Solution Process",
    "author": "Joseph R. Tristano, Zhijan Chen, D. Alfred Hancq, Wa Kwok",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/tristano03.pdf",
    "description": "\"Finite element analysts and designers need to feel confident in the results of their analyses before sending a product to prototype or production. Mesh discretization can greatly influence the desired results. In this paper we present framework for adaptive mesh refinement to obtain FEA results with a desired accuracy. The process involves adaptively refining the mesh based on solution error norms until the result desired converges to certain accuracy. The adaptive refinement/meshing process must be fully automatic and very robust. We present an exhaustive method to create a fully automatic and integrated process that takes advantage of many of the mesh refinement and mesh optimization algorithms found in literature. The results of the process provide the user with the desired accuracy in the smallest number of iterations possible.\"\n\n[Workbench Simulation, version 7.1]"
  },
  {
    "title": "ultrasonic2000.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ultrasonic2000.pdf",
    "description": "ultrasonic2000.pdf"
  },
  {
    "title": "user01.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/user01.zip",
    "description": "Very simple example showing use of user-defined command (USER01).\n\nThis UPF command simply reads and interpolates a defined table array. Use of the parevl() is also shown in this simple input."
  },
  {
    "title": "Advanced Tools for Design and Analyses of High Temperature Cyclic Loaded Turbine Components",
    "author": "U. Gampe, I. Martynov, J. Keyser",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/user_def1.pdf",
    "description": "\"The paper presents a new concept to predict viscoplastic deformations in components under thermal mechanical loading. This approach is based both on material data from uniaxial creep tests and additional laboratory component tests to consider the influence of multiaxiality. This concept was used for analysis of feature tests of flat tensile specimens with central hole. The maximum test temperature was 600 °C and the surface of the hole was attacked by cyclic thermal shocks.\"(This paper refers to use of ANSYS User-Defined Materials. A related paper is Laboratory Component Testing for Investigation of Material Degradation from Creep-Fatigue Interaction.)"
  },
  {
    "title": "usermat.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/usermat.pdf",
    "description": "Document describing the USERMAT user material subroutine."
  },
  {
    "title": "Converting Prony Series to Frequency Domain",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/visco_harmonic.zip",
    "description": "Simple example showing how to convert Prony series for viscoelasticity from time domain to frequency domain. This is to convert TB,PRONY to TB,ELASTIC/SDAMP for use in harmonic response analyses."
  },
  {
    "title": "VM256 with Workbench Mechanical",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/vm256.zip",
    "description": "Created a Workbench 12.0 version of VM256.\nUseful for users who may wish to get a better understanding of implementing the CINT command inside of Workbench Mechanical for J-integral and stress intensity factor calculations."
  },
  {
    "title": "VM267 with Workbench Mechanical",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/vm267.zip",
    "description": "Created a Workbench 12.0 version of VM267.\nUseful for users who may wish to get a better understanding of implementing the CINT command inside of Workbench Mechanical for stress intensity factor calculations."
  },
  {
    "title": "wam95_ufluidics.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/wam95_ufluidics.pdf",
    "description": "wam95_ufluidics.pdf"
  },
  {
    "title": "Text and compression utilities [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/week10-Text_Compression_Utilities.pdf",
    "description": "Memo on text editors which support syntax highlighting, useful in editing input files and/or macros. Also discusses compression utilities to reduce filesize of database and results files. (Also see \"bzip2\"compression utility, not discussed in memo)"
  },
  {
    "title": "Modeling preloaded bolts [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/week12-STI43_TNT_Bolt_preload.pdf",
    "description": "Modeling preload in bolts via contact offset, thermal contraction, or the new pretension elements PRETS179.\nPRELOAD1, PRELOAD2, and PRELOAD3 input files"
  },
  {
    "title": "Load vs. displacement control in contact problems [PDF]",
    "author": "Karen Dhuyvetter (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/week2-contact1.pdf",
    "description": "Discussion on load vs. displacement control for contact problems."
  },
  {
    "title": "Random Vibration Analysis of a Circuit Board [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/week23-random_vibrations_tow.pdf",
    "description": "Example of random vibration analysis of a circuit board in ANSYS.\nInput files in zip format"
  },
  {
    "title": "Different Methods of Connecting Parts Together [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/week24-connecting_models_tow.pdf",
    "description": "Connecting Parts - A study of Continuous Mesh versus Bonded Contact versus Constraint Equations."
  },
  {
    "title": "week25-ETABLE.pdf",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/week25-ETABLE.pdf",
    "description": "Short description on the usage and features of element tables in ANSYS."
  },
  {
    "title": "Calculating effective Coefficient of Thermal Expansion [PDF]",
    "author": "Bill Bulat (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/week4-effective_cte.pdf",
    "description": "Tips on how to define coefficient of thermal expansion and converting that material data to format that ANSYS can use."
  },
  {
    "title": "Structural Surface Effect Elements Intro [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/week5_Surface_Effect_Elements.pdf",
    "description": "Introduction to structural surface effect elements (SURF153/154).\nBOLTLOAD input file"
  },
  {
    "title": "Sine sweep simulation [PDF]",
    "author": "David Haberman (CSI",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/week6-compar-lm-dd3.pdf",
    "description": "Discussion on harmonic sweeps, either via the direct displacement method or the large mass method.\nDirect displacement method example input file and Large mass method example input file"
  },
  {
    "title": "License monitoring and reporting [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/week7-TNT_License_Reporting.pdf",
    "description": "Information on license monitoring and reporting for Elan (ANSYS 5.4-5.6). At 5.7, licensing has reverted back to FlexLM, and this document is not applicable."
  },
  {
    "title": "QR Damped Modal Analysis [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/week_29_STI68_TNT_Damped_Modal.pdf",
    "description": "Presentation on different damped eigenvalue extraction methods in ANSYS, focusing on the newer QR Damped method.\nInput files in zip format"
  },
  {
    "title": "ws_jss2002.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/ws_jss2002.pdf",
    "description": "ws_jss2002.pdf"
  },
  {
    "title": "zej-2012-anand-2.pdf",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/zej-2012-anand-2.pdf",
    "description": "zej-2012-anand-2.pdf"
  }
]
