[
  {
    "title": "*GET/*VGET Sheet",
    "author": "(PADT)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Get_Summary_2005_08_15.pdf",
    "description": "This is a handy sheet with *GET and *VGET items. A user can print this out as a reference sheet when writing APDL macros."
  },
  {
    "title": "180 Series Elements: Why Should One Use Them in Linear Analysis",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/180xAdvantages.pdf",
    "description": "Presentation on 18x elements (continuum, beam, shell) and its features related to both linear and nonlinear analyses."
  },
  {
    "title": "22x Coupled-Field Elements [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI0602_Coupled-Field_Elements.pdf",
    "description": "\"The 22x direct coupled-field elements (PLANE223, SOLID226-227) provide a wide array of material behavior for multiphysics applications - these include piezoelectricity, piezoresistivity, thermoelasticity, and thermoelectricity. This memo hopes to introduce some of the pertinent features of these elements.\""
  },
  {
    "title": "3-Dimensional thermal analysis and active cooling of short-length high-power fiber lasers",
    "author": "L. Li, H. Li, T. Qiu, V. L. Temyanko, M. M. Morrell, and A. Schülzgen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/89E56210-BDB9-137E-C5E99E1403B17F75_83733.pdf",
    "description": "A fully 3-dimensional finite element model has been developed that simulates the internal temperature distribution of short-length high-power fiber lasers. We have validated the numerical model by building a short, cladding-pumped, Er-Yb-codoped fiber laser and measuring the core temperature during laser operation. A dual-end-pumped, actively cooled, fiber laser has generated >11 W CW output power at 1535 nm from only 11.9 cm of active fiber. Simulations indicate power-scaling possibilities with improved fiber and cooling designs."
  },
  {
    "title": "A 3D Dynamical Biomechanical Tongue Model to Study Speech Motor Control",
    "author": "Jean-Michel Gérard, Reiner Wilhelms-Tricarico, Pascal Perrier & Yohan Payan",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Gerard_et_al.pdf",
    "description": "\"A 3D biomechanical dynamical model of human tongue is presented, that is elaborated in the aim to test hypotheses about speech motor control. Tissue elastic properties are accounted for in Finite Element Modeling (FEM). The FEM mesh was designed in order to facilitate the implementation of muscle arrangement within the tongue. Therefore, its structure was determined on the basis of accurate anatomical data about the tongue. Mechanically, the hypothesis of hyperelasticity was adopted with the Mooney-Rivlin formulation of the strain energy function. Muscles are modeled as general force generators that act on anatomically specified sets of nodes of the FEM structure. The 8 muscles that are known to be largely involved in the production of basic speech movements are modeled. The model and the solving of the Lagrangian equations of movement are implemented using the ANSYS™ software. Simulations of the influence of muscle activations onto the tongue shape are presented and analyzed.\""
  },
  {
    "title": "A 64-Pixel Linear Thermopile Array Chip Designed for Vacuum Environment",
    "author": "U. Dillner, E. Kessler, V. Baier, A. Berger, T. Eick, D. Behrendt, H. Urban",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/IRS2006_reprint.pdf",
    "description": "\"We report on the development of a 64-pixel high performance linear thermopile array chip designed for vacuum environment based on a silicon nitride membrane as substrate, Bi0.87Sb0.13/Sb as thermoelectric materials combination and an Ag-black broadband absorber layer. The array chip was mounted on a ceramic substrate and placed on the socket of a commercial hybrid package with 64 pins. Measurements of the linear array chip in vacuum environment and in absence of an entrance filter delivered a responsivity of 245 V/W, a sensitivity of 166 µVm˛/W, a specific detectivity of 1.6x109 cmHz1/2/W at an electrical resistance of 9 k and a thermal time constant of 150 ms. The pixelto- pixel cross-talk was reduced to less than 0.4 % due to slits in the membrane between adjacent pixels made by dry etching.\"\n[ANSYS Thermal, version unknown]"
  },
  {
    "title": "A Compilation of Anand Parameters for Selected SnPb and Pb-free Solder Alloys",
    "author": "Zane Johnson (University of Minnesota)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/zej-2012-anand-2.pdf",
    "description": "\"Finite-element (FE) simulation is widely used in electronic packaging. It is particularly useful in the design of solder joint attachments. To ensure fidelity, FE simulation must capture the highly nonlinear behavior of solder. One useful material model for solder is Anand’s viscoplastic model. A compilation of Anand parameters reported in the literature for a variety of solder alloys is provided.\""
  },
  {
    "title": "A DOS-Enhanced Numerical Simulation of Heat Transfer and Fluid Flow Through an Array of Offset Fins with Conjugate Heating in the Bounding Solid",
    "author": "E.M. Sparrow, J.P. Abraham, P.W. Chevalier",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/general_Reports_rptfiles_2005-263.pdf",
    "description": "\"The method of Design of Simulation (DOS) was used to guide and enhance a numerical simulation of fluid flow and heat transfer through offset-fin arrays which form the interior geometry of a cold plate. The basic problem involved 11 independent parameters. This prohibitive parametric burden was lessened by the creative use of nondimensionalization that was brought to fruition by a special transformation of the boundary conditions. Subsequent to the reduction of the number of parameters, the DOS method was employed to limit the number of simulation runs while maintaining an accurate representation of the parameter space. The DOS method also provided excellent correlations of both the dimensionless heat transfer and pressure drop results. The results were evaluated with respect to the Colburn Analogy for heat and momentum transfer. It was found that the offseting of the fins created a larger increase in the friction factor than that which was realized for the dimensionless heat transfer coefficient.\"\n\nSimilar paper can be found here.\n[ANSYS Flotran, version unknown]"
  },
  {
    "title": "A Finite Element Model For Pre- And Post-Test Calculations of the FOREVER-Experiments",
    "author": "H. G. Willschuetz, E. Altstadt, F. P. Weiss, B. R. Sehgal",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/fp8542.pdf",
    "description": "\"An axis-symmetric Finite Element (FE) model is developed based on the multi-purpose code ANSYS/Multiphysics. Using the Computational Fluid Dynamics (CFD) module the temperature field within the melt pool and within the vessel wall is evaluated. The transient structural mechanical calculations are then performed applying a creep model which takes into account large temperature, stress and strain variations.\" (Document 2)"
  },
  {
    "title": "A High-Performance Tunneling Accelerometer",
    "author": "Edward Boyden, Osamah El Rifai, Brian Hubert, Maurice Karpman, Dave Roberts",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/Tunneling-Accelerometer-Paper.pdf",
    "description": "Design of a MEMS tunneling accelerometer. Uses ANSYS for part of the design verification. In Acrobat, search for occurences of \"ANSYS\" in the PDF file."
  },
  {
    "title": "A Highly-sensitive fiber bragg grating transverse strain sensor using micro-structure fibers",
    "author": "Charles M. Jewart",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Jewart_etd_2006.pdf",
    "description": "A Highly-sensitive fiber bragg grating transverse strain sensor using micro-structure fibers"
  },
  {
    "title": "A Microchip-Based PCR Device Using Flexible Printed Circuit Technology",
    "author": "Keyue Shen, Xiaofang Chen, Min Guo, Jing Cheng",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/kyshen.pdf",
    "description": "\"Rapid heat transfer is crucial for an efficient polymerase chain reaction (PCR), and this makes temperature control one of the most essential features in a micro-PCR system, which always includes a heater and a sensor composing a closed-loop. Yet, the fabrication of the heater and the sensor often prevented micro-PCR systems from achieving both cost-effectiveness and fabrication-easiness. For most of the early researches micromachining techniques were used to allow sensors and heaters be integrated on a silicon or glass chip. However, the cost prevented them from wide applications. The work described in this paper is part of our effort to solve the cost/fabrication dilemma. An innovative digital temperature control system was developed by introducing a heater/sensor switching procedure. Only one temperature controlling element fabricated by flexible printed circuit technology was utilized in the constructed PCR device with minimum fabrication steps. The glass chip-based device was made from low cost materials and assembled with adhesive bonding. Through seemingly simple steps, we obtained both disposability and portability at the same time. Temperature stability within ±0.3 ?C and a transitional rate of 8 ?C/s during heating/cooling was achieved. A 244 bp DNA fragment of hepatitis C virus was successfully amplified in our device by a three-stage thermal cycling process. Further improvement was assisted by finite element analysis, and demonstrated by experiment.\"\n[ANSYS Thermal, version 7.0]"
  },
  {
    "title": "A New High Resolution Thermal Detector Array",
    "author": "U. Dillner, R. Riesenberg",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/erfurt02new_detector-reprint.pdf",
    "description": "\"The performance of the new thermal detector array arrangement is calculated using thermal finite element analysis. The influence of the thermal intra- and inter-subarray cross-talk on the resolution in dependence on some geometrical dimensions of the array is presented.\"\n[ANSYS Thermal, version 5.7] "
  },
  {
    "title": "A New Type of High Bandwidth RF MEMS Switch - Toggle Switch",
    "author": "Bernd Schauwecker, Karl M. Strohm, Winfried Simon, Jan Mehner, and Johann-Friedrich Luy",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/ws_jss2002.pdf",
    "description": "\"A new type of RF MEMS switch for low voltage actuation, high broadband application and high power capability is presented. Mechanical and electromagnetic simulations of this new RF MEMS switch type are shown and the fabrication process and measurement results are given. The switching element consists of a cantilever which is fixed by a suspension spring to the ground of the coplanar line. The closing voltage is 16V. The switches exhibit low insertion loss (<0.85dB@30GHz) with good isolation (>22dB@30GHz). I.\""
  },
  {
    "title": "A Non-Linear Domain Decomposition Method",
    "author": "Iakov Mordukhovich Klebanov, Andrei Nikolaevich Davydov",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/nonlinear_domain_decomposition_method.pdf",
    "description": "\"A new domain decomposition technique for parallelization of physically non-linear problems in solid mechanics is developed. It is extended for any stress-strain diagrams. The approach is based on the approximating generalized models of subdomains that leads to a considerably fewer number of iterations requiring updating of substructure parameters. The analytical proof of the convergence of the theoretical iterative procedure and the demonstration of convergence of its numerical implementation with the help of ANSYS are presented.\""
  },
  {
    "title": "A Novel Micromachined 2x128-Element Linear Themoelectric Infrared Radiation Sensor Array",
    "author": "Jurgen Muller, Volker Baier, Ulrich Dillner, Rudolf Guttich, Ernst Kessler",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/MICROtec2000.pdf",
    "description": "\"As a component for infrared spectrometric analytical instruments a 2x128-element thin-film thermopile linear array sensor with a staggered pixel arrangement was constructed. Contrary to most of the known 1-dimensional and 2-dimensional thermoelectric infrared sensor arrays working all on the base of doped polysilicon, we use the material group Bi-Sb-Te to obtain highest values of thermoelectric efficiency and specific detectivity to realize an optimum of spectral wavelength resolution.\"[ANSYS Thermal, version unknown]"
  },
  {
    "title": "A Parametric Study of Flip Chip Reliability Based on Solder Fatigue Modelling",
    "author": "Scott Popelar",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/popelar1.pdf",
    "description": "\"The solder fatigue model has been utilized to investigate the reliability of flip chip joints subjected to thermal cycling. In particular, a parametric study had been performed which shows how various flip chip design parameters will affect solder joint fatigue. Finite element models have been developed to analyze the effect of die size, die thickness, solder joint height, cap diameter and underfill properties on solder fatigue.\" (This is Part I of the study. Part II of this paper is available here.)"
  },
  {
    "title": "A SMA Actuated Artificial Earthworm",
    "author": "A. Menciassi, S. Gorini, G. Pernorio, P. Dario",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Bioloch_ICRA04.pdf",
    "description": "\"This paper presents the design and development of a microrobot which aims to replicate the locomotion principle of earthworms. The undulatory locomotion of living earthworms has been investigated deeply from the biological point of view, but attempts of replication of earthworm models in real size are limited. The authors designed an artificial earthworm with four modules which can be driven independently according to defined undulatory patterns with a typical frequency of 0.5 Hz. Each module is actuated by one or more SMA springs whose configuration has been designed in order to limit the wiring problems and optimizing working frequency. The robot is covered by a shaped silicone material which can be used as a platform to insert tiny legs for obtaining differential friction conditions. Preliminary tests demonstrate that the earthworm prototypes can move with a speed of 0.22 mm/s, thus approximating the behavior of biological earthworms. earthworms. Hopefully, the artificial moving earthworm will constitute a platform for improving the knowledge of mechanisms regulating motion and perception abilities of these creatures.\"\nModel in paper does not use TB,SMA constitutive model."
  },
  {
    "title": "A Software Package Linking PE2D and ANSYS for SSC Magnet Design",
    "author": "Nick Kallas, Chris Haddock, Jay Jayakumar, David Orrell, Greg Snitchler, Giancarlo Spigo, Jon Turner",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/PAC1991_2197.pdf",
    "description": "\"The design of the Cold Mass(CM) of superconducting magnets at the Magnet Systems Division(MSD) of the Superconducting Super Collider Laboratory(SSCL) involves among others the optimization of field quality and structural performance as related to the quench behavior of the magnets. It is desirable to be able to study the changes in field quality due to dimensional changes of the cold mass components under stress as the magnet is cooled and energized. This document describes a software package of functions which enable the computer aided study of this aspect of cold mass design.\"\n[ANSYS Structural, version 4.4a]"
  },
  {
    "title": "A Stress-Induced Thermal Actuator for Optical Purpose",
    "author": "Gang Liu, Sebaek Oh",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/EE245.pdf",
    "description": "\"We present a micromachined, stress-induced, thermal bimorph actuator for optical purpose. Piston motions of more than 3um are demonstrated by FEM simulation. Upon the release from the substrate, the actuators lift off the substrate due to a large built-in bending moment arising from the compressive residual stress in the poly-silicon layer and tensile residual stress in the metal layer. Large displacement and low operating voltage (<2V) are obtained simultaneously.\""
  },
  {
    "title": "A Three-Dimensional Finite Element Analysis of Stress Distribution in a Coronary Atherosclerotic Plaque: In-Vivo Prediction of Plaque Rupture Location",
    "author": "Jacques Ohayon, Gérard Finet, François Treyve, Gilles Rioufol and Olivier Dubreuil",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Ohayon_BACAS_05.pdf",
    "description": "\"This paper aims at predicting the plaque rupture location of one patient with stable angina and scheduled to undergo percutaneous coronary intervention. The peak circumferential stress (PCS) is considered as the determining biomechanical factor in the mechanisms leading to rupture of the atherosclerotic plaque and is often used as a predictor of atherosclerotic plaque rupture location. Up to now, to define the site of PCS concentrations, twodimensional (2D) finite element (FE) analyses were performed on the smallest luminal cross-sectional area of the coronary plaque. In-vivo three-dimensional (3D) FE modeling of atherosclerotic coronaries may be very valuable and more accurate than the 2D FE analysis in helping cardiologists evaluate the risk of spontaneous plaque rupture in a patient. In this work, the performances of the 2D and 3D FE approaches have been compared and the limits of the 2D structural analysis has been pointed out.\"\n[ANSYS Structural, version 8.0]"
  },
  {
    "title": "A Vision-Based Technique for Objective Assessment of Burn Scars",
    "author": "Leonid V. Tsap, Dmitry B. Goldgof, Sudeep Sarkar, and Pauline S. Powers",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/tmi98.pdf",
    "description": "\"In this paper a method for the objective assessment of burn scars is proposed. The quantitative measures developed in this research provide an objective way to calculate elastic properties of burn scars relative to the surrounding areas. The approach combines range data and the mechanics and motion dynamics of human tissues. Active contours are employed to locate regions of interest and to find displacements of feature points using automatically established correspondences. Changes in strain distribution over time are evaluated. Given images at two time instances and their corresponding features, the finite element method is used to synthesize strain distributions of the underlying tissues.\""
  },
  {
    "title": "ANSYS Cast Iron Material Model Matches Experimental Data",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/cast_iron.doc.pdf",
    "description": "\"[The purpose of this paper is to] verify the accuracy of the ANSYS cast iron material model. Results from ANSYS are compared with experimental data for a biaxially loaded cruciform geometry.\""
  },
  {
    "title": "ANSYS Equation Solvers: Usage and Guidelines",
    "author": "Gene Poole (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/solver_2002.pdf",
    "description": "Discussion of ANSYS solvers, focusing on the sparse direct solver and PCG iterative solver.\nOriginally presented at the 2002 Conference."
  },
  {
    "title": "ANSYS Material Modeling: Hyperelastic Material Characterization",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/hyper_elasticcity_curvefitting.pdf",
    "description": "Overview of the hyperelastic curve-fitting capabilities introduced in ANSYS 7.0."
  },
  {
    "title": "ANSYS Mechanical - A Powerful Nonlinear Simulation Tool",
    "author": "Grama Bhashyam (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/ansys_mechanical_wp.pdf",
    "description": "A whitepaper describing various ANSYS features in the area of nonlinear mechanics, including element formulation, constitutive models, and contact technology."
  },
  {
    "title": "ANSYS Multiphysics Capabilities for MEMS Modeling and Simulation - Part 1 of 3",
    "author": "Jan Mehner, Juergen Wibbeler",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/mems_1_of_3.pdf",
    "description": "Part 1 of 3: Analyzing electrostatic-structural interactions in Micro Electro Mechanical Systems\nANSYS Solutions Vol. 3, Number 2"
  },
  {
    "title": "ANSYS Multiphysics Capabilities for MEMS Modeling and Simulation - Part 2 of 3",
    "author": "Jan Mehner, Juergen Wibbeler",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/mems_2_of_3.pdf",
    "description": "Part 2 of 3: Analyzing fluid-structural interactions\nANSYS Solutions Vol. 3, Number 3"
  },
  {
    "title": "ANSYS Multiphysics Capabilities for MEMS Modeling and Simulation - Part 3 of 3",
    "author": "Jan Mehner, Juergen Wibbeler, Fouad Bennini",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/mems_3_of_3.pdf",
    "description": "Part 3 of 3: Exporting macromodels for circuit and system simulation tools.\nANSYS Solutions Vol. 3, Number 4"
  },
  {
    "title": "ANSYS PDS article in Machine Design [PDF]",
    "author": "Stefan Reh",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/machdesn_pds.pdf",
    "description": "While this may not be a conventional technical paper, it presents information on ANSYS PDS (Probabilistic Design System), a beta feature in 5.6 and officially released in 5.7. Instead of a deterministic approach, a stochastic method provides better product reliability measures"
  },
  {
    "title": "ANSYS PDS overview [PDF]",
    "author": "Stefan Reh",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/PDS_Overview.pdf",
    "description": "A three-page overview/summary sent on the XANSYS Mailing list on PDS, beta in ANSYS 5.6, officially released at 5.7."
  },
  {
    "title": "ANSYS news",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/ansys_news_1996_1.pdf",
    "description": "First Issue of ANSYS News"
  },
  {
    "title": "ANSYS-Structural Design of Micromachined Fabry-Pérot Filters for WDM Applications",
    "author": "K. Mutamba, J. Pfeiffer, J. Peerlings, R. Riemenschneider and N. Dragojevic",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/mutamba2.pdf",
    "description": "\"Due to the recent progress in the fabrication of micro-optical devices and the maturity reached in the integration of electromechanical functions on various semiconductor micro-devices, new concepts for optical microelectromechanical systems (OMEMS) have emerged... Analyses have been carried out with the ANSYS FEM (Finite Elements Method) Program for two types of electrostatically actuated Fabry-Pérot filters.\""
  },
  {
    "title": "ANSYS_Function_Builder.pdf",
    "author": "Achuth Rao (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/ANSYS_Function_Builder.pdf",
    "description": "When using the ANSYS Function Editor and Function Loader to define Function Boundary Conditions, a special type of table is used. This document outlines the syntax of the function loading table."
  },
  {
    "title": "ANSYS_distributed_tutorial_8.1.zip",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ANSYS_distributed_tutorial_8.1.zip",
    "description": "This is a document for ANSYS 8.1 distributed solvers and how to set them up, specifically for Windows and Linux."
  },
  {
    "title": "APDL Coding Standards [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI05_APDL_Coding_Standards.pdf",
    "description": "\"Because of the flexibility and automation APDL (ANSYS Parametric Design Language) provides, many users tend to write input files and macros in addition to using the GUI.\nThere are currently no recognized ‘standards’ of writing APDL macros or input files, although there may exist standards within companies on APDL coding. The lack of APDL coding standards may make inheriting someone else’s input files or macros more difficult. Also, parameter or component conflicts may also arise when using multiple macros.\nThis memo hopes to provide some ideas for groups or individuals wishing to develop APDL standards in writing macros or input files.\""
  },
  {
    "title": "APDL Implementation of a 3D FEM Capacitance Simulator for Arbitrarily Shaped Interconnects [PDF]",
    "author": "Andreas Hieke",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ahieke.pdf",
    "description": "Alternative download link here\nAn alternate CMATRIX macro created by A. Hieke called CAMACO."
  },
  {
    "title": "APDL and Vector Operations [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI02_APDL_and_Vector_Operations.zip",
    "description": "\"Vector and matrix operations in APDL are an invaluable method of manipulating array data, as they provide very fast, computationally efficient means of helping the user perform pre- or post-processing operations on the model.\nThere are many ways of storing data, ranging from arrays to tables to strings. Moreover, manipulation of numerical data can be in the form of vectors or matrices via the *Vxxx and *Mxxx commands, respectively. The user is referred to the APDL Programmer’s Guide in the ANSYS online help for a thorough discussion of the capabilities of APDL, but, in this memo, a basic introduction to vector operations will be covered.\""
  },
  {
    "title": "ATLAS TRT Barrel Electronics Cooling: Duke mockup measurements and FEA calculations",
    "author": "W. Ebenstein, J. Fowler, S. Oh, V. Vassilakopoulos, and C. Wang",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/coolingreview.pdf",
    "description": "\"This report summarizes measurements and calculations using the most recently proposed cooling scheme. Heat generated by the ASDBLR and DTMROC stamp boards is conducted to an aluminum plate sandwiched between the upper and lower stamp boards (hereafter referred to as the 'middle cooling plate'). The heat is then carried up through a vertical aluminum post, and finally to a large aluminum plate above all of the upper stamp boards (the 'upper cooling plate'), to which cooling tubes are attached.\""
  },
  {
    "title": "Accumulated Creep Strain and Energy Density Based Thermal Fatigue Life Prediction Models for SnAgCu Solder Joints",
    "author": "Ahmer Syed",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/asyed_ectc2004_corrected.pdf",
    "description": "\"This paper describes in detail the life prediction models for SnAgCu solder joints. The models are based on published constitutive equations for this alloy and thermal cycle fatigue data on actual components. The approach uses advance finite element modeling and analysis techniques and is based on mechanics of deformation. Both accumulated creep strain and creep strain energy density based models are developed. The model has been correlated with a number of data points and predicts life within 25% in most cases. The framework of modeling and prediction methodology described here is fully compatible with the framework used for SnPb solder previously.\""
  },
  {
    "title": "Acoustic Elements [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI01_Acoustic_Elements.zip",
    "description": "\"For many years, ANSYS has 2D and 3D acoustic elements, including those used to model an “infinite” boundary. These elements can be used in modal, harmonic, and transient analyses, and fluid-structural interaction can also be accounted for in these simulations.\n\nThis memo hopes to review the following topics related to harmonic acoustic analyses: basic comparison of structural and acoustic elements, modeling complex impedance boundary conditions, and defining complex pressure loading. A set of input files, which analyze the case of a simple radiating sphere, is included with this memo.\""
  },
  {
    "title": "Acoustic Postprocessing [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI0706_Acoustic_Postprocessing.zip",
    "description": "\"Acoustic analyses in ANSYS provides insight to the propagation of sound, and both visual and aural postprocessing can aid in this objective. This memo hopes to cover postprocessing methods for acoustic problems other than standard contour and XY plots.\""
  },
  {
    "title": "Advanced Analysis Of Structural Reliability Using Commercial FE-Codes",
    "author": "Christian Bucher, Dagmar Hintze, and Dirk Roos",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/772.pdf",
    "description": "\"The paper focuses on two main issues, i.e. (a) The application of existing code for probabilistic analysis together with existing Finite Element Code for advanced Monte Carlo analysis (b) Presentation of a local-global approximation strategy for the response surface method. This so-called \"weighted radii\" approximation appears to provide the flexibility and accuracy needed for the reliability analysis of complex structures.\" (Probabilistics)"
  },
  {
    "title": "Advanced Mask Modeling Accuracy and Stability Study-University of Wisconsin Mask Modeling",
    "author": "R. Scott Mackay",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/3964aeng.pdf",
    "description": "\"As lithography error budgets on pattern placement become more stringent for sub-130 nm technology, it is imperative that all mask-related distortions be quantified, controlled, and minimized. It will be essential to identify the influence of thin film stress on pattern placement errors. In this research, the effect of mask material properties, manufacturing, and usage on image placement will be evaluated. Finite element (FE) models have been developed to simulate this pattern transfer process, using equivalent modeling techniques. Analytical, experimental, and FE procedures have been combined to accurately determine these effects on final pattern distortions.\""
  },
  {
    "title": "Advanced Tools for Design and Analyses of High Temperature Cyclic Loaded Turbine Components",
    "author": "U. Gampe, I. Martynov, J. Keyser",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/user_def1.pdf",
    "description": "\"The paper presents a new concept to predict viscoplastic deformations in components under thermal mechanical loading. This approach is based both on material data from uniaxial creep tests and additional laboratory component tests to consider the influence of multiaxiality. This concept was used for analysis of feature tests of flat tensile specimens with central hole. The maximum test temperature was 600 °C and the surface of the hole was attacked by cyclic thermal shocks.\"(This paper refers to use of ANSYS User-Defined Materials. A related paper is Laboratory Component Testing for Investigation of Material Degradation from Creep-Fatigue Interaction.)"
  },
  {
    "title": "Advancing Analysis Capabilities In ANSYS Through Solver Technology",
    "author": "Gene Poole, Yong-Cheng Liu, and Jan Mandel",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/amg2001.pdf",
    "description": "\"This paper will describe implementation considerations for the addition of new solver technology to a large legacy code, compare resource requirements for the various solver choices and present some comparative results from several customer generated problems. The AMG solver benefits, both in improved robustness and parallel processing efficiency will be described. The paper will also discuss some of the implementation challenges that have been overcome to add new solver technology to a large existing code. The role of solver technology in meeting current and future demands of large scale commercial analysis codes will be discussed.\""
  },
  {
    "title": "Algebraic Multigrid By Smoothed Aggregation For Second And Fourth Order Elliptic Problems",
    "author": "Petr Van Ek, Jan Mandel, and Marian Brezina",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/meis.pdf",
    "description": "\"An algebraic multigrid algorithm for symmetric, positive definite linear systems is developed based on the concept of prolongation by smoothed aggregation. Coarse levels are generated automatically. We present a set of requirements motivated heuristically by a convergence theory. The algorithm then attempts to satisfy the requirements. Input to the method are the coefficient matrix and zero energy modes, which are determined from nodal coordinates and knowledge of the differential equation. Efficiency of the resulting algorithm is demonstrated by computational results on real world problems from solid elasticity, plate bending, and shells.\""
  },
  {
    "title": "An Approach to Combined Laplacian and Optimization-Based Smoothing for Triangular, Quadrilateral, and Quad-Dominant Meshes [PDF]",
    "author": "Scott A. Canann, Joseph R. Tristano, Matthew L. Staten",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/combined_l_o_smoothing.pdf",
    "description": "\"In this paper, an overall mesh smoothing scheme is presented for meshes consisting of triangular, quadrilateral, or mixed triangular and quadrilateral elements. This paper describes an efficient and robust combination of constrained Laplacian smoothing together with an optimization-based smoothing algorithm.\""
  },
  {
    "title": "An Architecture for Fluid/Structure Analysis of Turbomachinery Blading",
    "author": "David A. Johnston, Charles J. Cross, J. Mitch Wolff",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/10_0130_Cross_paper.pdf",
    "description": "\"Aeroelastic stability and response analyses used in the design of turbomachinery blading are typically uncoupled: the unsteady aerodynamics and structural dynamics are treated in separate models, with boundary conditions sequentially updated after stationary periodic convergence is met. Higher fidelity simulations are achieved by coupling the fluid and structure domains such that boundary conditions are updated once or several times per physical time step of the simulation.\"\"As a starting point, the turbomachinery CFD research code TURBO (Chen and Briley, 2001) and the commercial structural solver ANSYSŪ has been chosen for coupling, although FSI is designed with modularity for future inclusion of other fluid and structural solvers.\"\n[ANSYS Dynamics, version unspecified]"
  },
  {
    "title": "An Efficient FETI Implementation on Distributed Shared Memory Machines with Independent Numbers of Subdomains and Processors",
    "author": "Michel Lesoinne and Kendall Pierson",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/B0-8218-0988-1-03024-7.pdf",
    "description": "\"Until now, many implementations of the FETI method have been designed either as sequential codes on a single CPU, or as parallel implementations with a One Subdomain per Processor approach. This approach has been particularly typical of implementations on distributed memory architectures such as the IBM SP2. In the last couple of years, several computer manufacturers have introduced new machines with a Distributed Shared Memory (DSM) programming model {e.g. SGI Origin 2000, or HP Exemplar. In such architectures, the physical memory is distributed among the processors or CPU boards but any memory location can be accessed logically by any CPU independently of where the particular memory page being accessed has physically been allocated. As more and more machines of this type are available with a relatively small number of processors, the interest in implementing FETI with an independent number of subdomains and processor has increased. We report on such an implementation of FETI and highlight the benefits of this feature. We have found that medium size to large problems can be solved even on a sequential machine with time and memory requirements that are one to two order of magnitude better than a direct solver.\""
  },
  {
    "title": "An Interpretation of the Physics of Fluid-Structure Interaction in the Frequency Domain",
    "author": "Jan Christian Anker",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/CADFEM05_anker_paper.pdf",
    "description": "\"This paper constitutes an attempt to interpret the physics of FSI where the structure is vibrating. The structure considered is a very simple physical device, namely a flat cantilever plate. Many presumably important details are only briefly mentioned, other are left completely out of the discussion. The intention with the paper is to emphasize that there are cases where Fluid - Structure Interaction can be successfully simulated without having to utilize a Navier-Stokes Solver coupled with a (non-linear) Structural Analysis Program, a concept that requires vast amounts of computer time for linear vibrations (but is highly relevant for other applications).\""
  },
  {
    "title": "An Introduction to the Conjugate Gradient Method Without the Agonizing Pain",
    "author": "Jonathan R. Shewchuk",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/painless-conjugate-gradient.pdf",
    "description": "This paper presents a very well-written explanation of conjugate gradient methods. It is helpful in understanding better the idea behind CG solvers in ANSYS (PCG, JCG, ICCG, AMG, etc.)."
  },
  {
    "title": "An Investigation into Vibration in Switched Reluctance Motors",
    "author": "Pragasen Pillay and William (Wei) Cai",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/25.pdf",
    "description": "\"Two disadvantages of the switched reluctance motor (SRM) are its torque ripple and acoustic noise. Previous work on vibration modes and resonant frequencies of the laminations of an 8-6 SRM is extended here to include the effects of the frame. Both a smooth frame and a ribbed frame are examined, and the presence of numerous additional vibratory modes in the ribbed frame demonstrated. Accelerometer tests behind a pole verify some of the theoretical predictions.\"[ANSYS Dynamics, version unspecified]"
  },
  {
    "title": "An Object Oriented Approach to Geometry Defeaturing for Finite Element Meshing [PDF]",
    "author": "Anton V. Mobley, Michael P. Carroll, and Scott A. Canann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/object_oriented_defeaturing.pdf",
    "description": "\"In this paper, an object-oriented approach to automatic geometry defeaturing is presented. The geometric and finite element data abstractions are given, along with the basic algorithms used.\""
  },
  {
    "title": "Analysis Of Gasketed Flanges With Ordinary Elements Using APDL Control",
    "author": "Yasumasa Shoji, Satoshi Nagata",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/gasketed_flanges_ordinary_elements_apdl_control.pdf",
    "description": "\"The analysis of gasketted flanges is now becoming an essential technique to design pressure vessels or piping, because the design code is being modified. On the other hand, the gasket has an extreme nonlinearity which causes the analysis to be very difficult, especially using linear material properties. A finite element analysis program other than ANSYS has the element library for gasket element, but ANSYS does not have it yet.\"\r\n \r\n \"The authors developed a method to model this nonlinear gasket by using the elements available in ANSYS Rel. 5.5 for 2-dimensional axisymmetric analysis and those in Rel. 5.6 for 3-dimensional analysis. In this paper, the concept and the procedure of the modeling is introduced. The data input is possible using a template, without using any other ANSYS commands. The whole analysis execution is controlled by APDL.\"\r\n \r\n [STI: Gasket elements are available from version 6.1 onwards, after this paper was written]"
  },
  {
    "title": "Analysis Of Reinforced Concrete Structures Using ANSYS Nonlinear Concrete Model",
    "author": "Antonio F. Barbosa and Gabriel O. Ribeiro",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/analysis-of-reinforced-concrete.pdf",
    "description": "\"This paper considers the practical application of nonlinear models in the analysis of reinforced concrete structures. The results of some analyses performed using the reinforced concrete model of the general purpose finite element code ANSYS are presented and discussed.\""
  },
  {
    "title": "Analysis Of The FOREVER-Experiments Using A Finite Element Model",
    "author": "Eberhard Altstadt, Thomas Moessner, Baj Ral Sehgal, Hans-Georg Willschütz",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/jb99_14.pdf",
    "description": "\"An axis-symmetric Finite Element (FE) model is developed based on the multi-purpose code ANSYS/Multiphysics. Using the Computational Fluid Dynamics (CFD) module the temperature field within the melt pool and within the vessel wall is evaluated. The transient structural mechanical calculations are then performed applying a creep model which takes into account large temperature, stress and strain variations.\" (Document 1)"
  },
  {
    "title": "Analysis and Modeling of Fiber-Wrapped Columns and Concrete-Filled Tubes",
    "author": "Mohsen Shahawy, Tom Beitelman, and Amir Mirmiran",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/fiber_concrete.pdf",
    "description": "\"Carbon-wrapping of concrete column adds to its strength and ductility. The behavior of carbon-wrapped concrete is in general very similar to that of glass-wrapped concrete. The bilinear confinement that was developed- for glass-wrapped concrete can be applied to carbon-wrapped concrete. However, a better fit can be obtained by re-calibrating the model for an entire database that consists of both carbon-wrapped and glass-wrapped concrete. Such database needs to be accompanied by a set of accurate coupon tests on the properties of the jacket. The finite element modeling is also useful in predicting the response of carbon-wrapped concrete. A more accurate estimate of jacket properties make the analysis fit the test results better.\""
  },
  {
    "title": "Analysis and Simulation of the Ultrasonic/Sonic Driller/Corer(USDC)",
    "author": "X. Bao, Z. Chang, S. Sherrit, B.P. Dolgin, Y. Bar-Cohen, D.S. Pal, S. Du, T. Peterson",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/SPIE-02-SS-4701-36-USDC.pdf",
    "description": "\"An ultrasonic/sonic driller/corer (USDC) was developed to address the challenges to the NASA objective of planetary in-situ rock sampling and analysis. The USDC uses a novel drive mechanism, transferring ultrasonic vibration into impacts on a drill stem at sonic frequency using a free-flying mass block (free-mass). The main parts of the device and the interactions between them were analyzed and numerically modeled to understand the drive mechanism and allow design of effective drilling mechanism. A computer program was developed to simulate the operation of the USDC and successfully predicted the characteristic behavior of the new device. This paper covers the theory, the analytical models and the algorithms that were developed and the predicted results.\"\n[ANSYS Piezoelectric, version 5.4]"
  },
  {
    "title": "Analysis and Testing of Graphite/Epoxy Concrete Bridge Girders Under Static Loading",
    "author": "B. M. Kavlicoglu, F. Gordaninejad, M. Saiidi, Y. Jiang",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/21.pdf",
    "description": "\"An innovative graphite/epoxy-concrete (G/E-C) cross-section was developed and tested under two-point static loading. Finite element analysis and theoretical modeling of the cross-section was performed. The cross-section was a box girder with an outer G/E U-beam and inner G/E box beam with concrete webs and flange in between. Shear connection between G/E box beam and concrete slab was provided by a two-part structural epoxy resin. Additional shear connection was provided by steel stirrups located at 254 mm (10 in.) spacing along longitudinal axis of the test specimen. It was observed that, steel stirrups contributed the load carrying capacity after initiation of slippage between G/E beams and concrete. Moreover, a series of bond strength tests were performed to examine the behavior of structural epoxy resin for connection between G/E and concrete. Six G/E strips were subjected to tensile tests to evaluate the longitudinal and transverse elastic moduli of the laminate. Using the proper material properties and assumptions, it was possible to demonstrate the behavior of the section under static loads theoretically and in finite element analysis.\"\n[ANSYS Structural, version 5.5]"
  },
  {
    "title": "Analytical Modeling Of Glued Laminated Girder Bridges Using ANSYS",
    "author": "Anil Kurian",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/kurian.pdf",
    "description": "\"This paper aims at developing a finite element model of glued laminated girder bridges that can predict accurately the analytical behavior of the bridges. Two models have been developed to study the characteristics of this type of bridge. Two case studies have been considered to validate the accuracy of the models. The first case study is a long span single-lane bridge, the Tuscaloosa Bridge, in Alabama. The second case study is a medium span two-lane bridge, the Cow Gu lch Bridge, in Montana. The models show good correlation with the experimental data and hence, the models can be used to find the maximum deflections in the bridge.\"Use of ANSYS 5.0 (1992 version)"
  },
  {
    "title": "Analytical Simulation of a 1D Single Crystal Silicon Electrostatic Micromirror [PDF]",
    "author": "H. Camon, F. Larnaudie, F. Rivoirard, B. Jammes",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/MSM99_CNRS_umirror.pdf",
    "description": "A torsional micromirror. Use of ANSYS to extract lumped parameters for use in SABER model. (MEMS)"
  },
  {
    "title": "Analyzing Hyperelastic Materials w/ Some Practical Considerations",
    "author": "Paris Altidis and Vince Adams",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ANSYS_Users_Group_Hyperelastic_Materials.pdf",
    "description": "Presentation from the Midwest ANSYS User Group\n[ANSYS Nonlinear, version unspecified]"
  },
  {
    "title": "Analyzing Microminiature Devices [PDF]",
    "author": "Steve Groothuis",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/memsissue1.pdf",
    "description": "(from ANSYS Solutions magazine, volume 1, #1) (MEMS)"
  },
  {
    "title": "Anisotropic Plasticity and Failure Prediction in Wood Composites",
    "author": "David M. Moses, Helmut G.L. Prion",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/anisotropic_plasticity_failure_prediction_wood.pdf",
    "description": "\"Two case studies are summarized using anisotropic plasticity and the Weibull weakest link failure model to predict the behavior of wood and wood composites. The linear elastic orthotropic model normally used for wood is shown to be insufficient for the prediction of ultimate strength in wood. Non-linear, non-recoverable behavior in compression in each of the orthogonal material directions is of particular interest in cases where localized crushing governs the load-displacement behavior of wood.\"\r\n \r\n \"The anisotropic plasticity option in ANSYS was used to predict yielding and post-yield behavior for the wood composite used in this study because yield stresses in orthogonal directions were found to be in the ratio of 1:1.2:5. A user-programmable Fortran subroutine was developed for ANSYS to carry out the failure analysis (and to calculate the volume integration of the stresses) at each load-step in post-processing. The model was verified using two cases: I) the ASTM D143 shear block test, and II) bolted connections.\""
  },
  {
    "title": "Application of the Finite Element Method In Cold Forging Processes",
    "author": "Cristina Maria Oliveira Lima Roque, Sérgio Tonini Button",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/rbcm22.pdf",
    "description": "\"In this study, the application of a commercial general finite element software - ANSYS - has been applied to model a forming operation. Models have been developed to simulate the ring compression test and to simulate a basic forming operation (upsetting) that is applied in most of the cold forging parts sequences.\" (Plasticity, contact, finite strain)"
  },
  {
    "title": "Applying Anand Model to Represent the Viscoplastic Deformation Behavior of Solder Alloys",
    "author": "G. Z. Wang, Z. N. Cheng, K. Becker, J. Wilde",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/587.pdf",
    "description": "\"A unified viscoplastic constitutive law, the Anand model, was applied to represent the inelastic deformation behavior for solders used in electronic packaging. The material parameters of the constitutive relations for 62Sn36Pb2Ag, 60Sn40Pb, 96.5Sn3.5Ag, and 97.5Pb2.5Sn solders were determined from separated constitutive relations and experimental results. The achieved unified Anand model for solders were tested for constant strain rate testing, steady-state plastic flow and stress/strain responses under cyclic loading. It is concluded that the Anand model can be applied for representing the inelastic deformation behavior of solders at high homologous temperature and can be recommended for finite element simulation of the stress/strain responses of solder joints in service.\"\n[ANSYS Nonlinear, version unknown]"
  },
  {
    "title": "BMSweep: Locating Interior Nodes During Sweeping [PDF]",
    "author": "Matthew L. Staten, Scott A. Canann, and Steve J. Owen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/bmsweep.pdf",
    "description": "\"BMSweep is a new algorithm to determine the location of interior nodes while volume sweeping.\""
  },
  {
    "title": "Basics of ANSYS Macros [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/week_28_totw-macros.pdf",
    "description": "Basics of creating and using macros (APDL) in ANSYS."
  },
  {
    "title": "Basics on Structural Damping (Addendum) [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI0804_Damping.zip",
    "description": "\"Since ANSYS 5.6, there have been numerous enhancements as well as facets of the software program that have changed, including treatment of damping. This article is meant to serve as an addendum to Section 6 of the author’s \"Structural Damping\"memo, which was written in October, 2000.\""
  },
  {
    "title": "Basics on Structural Damping [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI09_Damping.zip",
    "description": "This is an old document I wrote a while ago on damping which I sometimes use. Although written back at version 5.6, it is still applicable at version 7.0.\n\"Damping is required in many dynamic applications, yet because there are many ways to include it, there is often confusion regarding the implementation of damping in ANSYS. This memo hopes to provide a general summary of the representation of damping available in ANSYS.\""
  },
  {
    "title": "Behavioural modeling for heterogeneous systems based on FEM descriptions",
    "author": "Joachim Haase, Sven Reitz, Peter Schwarz",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/spice1.pdf",
    "description": "\"To simulate more complex systems using Spice-compatible circuit and system simulation programs, behavioural models of the components are required. The focus of the paper is to discuss two possibilities to derive such models from FEM descriptions.\""
  },
  {
    "title": "Benchmark Tests on ANSYS Parallel Processing Technology",
    "author": "Kentaro Suzuki",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/benchmar_tests_on_ansys_parallel_proc.pdf",
    "description": "\"ANSYS Inc. has released parallel processing solvers, DDS (Distributed Domain Solver) and AMG (Algebraic Multigrid Solver) in ANSYS version 5.7 in order to meet the requirements from the market.\"\n\n\"In this paper, simple tests are first carried out to confirm the features and capabilities of DDS and AMG for different types of analyses. Furthermore, real-life problems such as thermal stress of an engine block (7.3 million DOF) and elastic-plastic-creep behavior of an IC packaging (about 84,000 DOF) are analyzed. The effectiveness of ANSYS parallel processing solvers is also studied.\""
  },
  {
    "title": "Beta Electrical Contact Features at 6.0 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI01_Electrical_Contact_Beta_6.0.zip",
    "description": "\"This issue describes a beta feature at 6.0, which is electrical contact capability of 17x surface-to-surface contact elements. This new capability allows contact in thermal-electric and structural-thermal-electric problems.\"\n(Week 13, week of 01/07/02.)"
  },
  {
    "title": "Biomechanical Interaction Between Cap Thickness, Lipid Core Composition and Blood Pressure in Vulnerable Coronary Plaque: Impact on Stability or Insta",
    "author": "Gerard Finet, Jacques Ohayon and Gilles Rioufo",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Finet_CAD_04.pdf",
    "description": "\"A ‘thin’ fibrous cap atheroma is the typical morphological characteristic of vulnerable plaque. Yet the very pathological studies that have provided these descriptions have also shown the actual prediction of plaque rupture to be rather less exact. Other relevant characteristics must be involved in the mechanisms of plaque rupture—blood pressure loading (P) and the material properties of the soft atheromatous core—as predictors of the distribution of the peak circumferential stress (PCS) locations.\"\n[ANSYS Structural, version 5.7]"
  },
  {
    "title": "Buckling in Workbench Simulation [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI0705_Buckling.pdf",
    "description": "\"Buckling may be a concern for some situations, where a user may need to modify the design to prevent buckling within a given load range. Conversely, failure analysis may need to be performed when a structure has collapsed.\nANSYS and Workbench Simulation have many tools to aid users in solving geometric instability problems, ranging from linear (eigenvalue) buckling to nonlinear, post-buckling analyses.\"\n(Week 41, week of 10/14/07)"
  },
  {
    "title": "Building Parametric Models [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Week_22_totw-parametric-model.pdf",
    "description": "This memo provides an overview of APDL, defining parameters, and creating parametric models."
  },
  {
    "title": "CERIG vs RBE3, RIGID184 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI07_CERIG_RBE3_RIGID184.zip",
    "description": "\"Constraint equations provide many useful features in ANSYS, such as tying together dissimilar meshes, representing parts of the system not explicitly modeled, or distributing loads. Two automated methods of generating constraint equations are the CERIG and RBE3 commands. Because there is often confusion over their use, this memo hopes to provide some information on differences between the two methods.\n\"Constraint equations in ANSYS are linear, so they are not valid for large-rotation analyses. RIGID184 is a beta element in version 6.1 which provides rigid link/beam capabilities, valid for large-rotation problems. The latter part of this memo will cover some details of this undocumented feature, available in 6.1.\""
  },
  {
    "title": "COMPMENU.zip",
    "author": "Jim Patterson (Hendrickson Trailer Suspension Systems)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/COMPMENU.zip",
    "description": "\"I have a set of macros to generate toolbars based on the defined components in the db. You can then call these toolbars from the main toolbar to aid in the selecting of the components. This includes \"select\", \"also select\", and \"unselect\". You can also \"remake\"the components from the toolbar. As someone who works with assemblies of shell models almost constantly, this has been a huge time saver for me.\"\n Tested on 5.7 through 6.1. Unzip the file and read the supplied Word document for instructions."
  },
  {
    "title": "Calculating effective Coefficient of Thermal Expansion [PDF]",
    "author": "Bill Bulat (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/week4-effective_cte.pdf",
    "description": "Tips on how to define coefficient of thermal expansion and converting that material data to format that ANSYS can use."
  },
  {
    "title": "Calculations on Micromachined Electro-Thermal Sensor Devices",
    "author": "Bernd Folkmer, Martin Hirt, Michael Vosseler, Hartmut Glosch, Frank Hedrich, Sophie Billat, Walter L",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/1_4_4.pdf",
    "description": "\"In this contribution the experiences gained using ANSYS/Multiphysics software for analysis of micro machined electro-thermal sensor devices are described.\""
  },
  {
    "title": "Cast Iron Plasticity",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/conflong_castiron.pdf",
    "description": "Presentation on Cast Iron plasticity model introduced in ANSYS 6.1 (part of the \"Advanced Analysis with ANSYS\" seminar during the 2002 User's Conference)."
  },
  {
    "title": "Cavity mechanics and vibrations under Lorentz forces excitation",
    "author": "Danilo Barni",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/barni1.pdf",
    "description": "(Harmonic, modal analyses)"
  },
  {
    "title": "Chaboche Nonlinear Kinematic Hardening Model [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI0805_Chaboche.pdf",
    "description": "\"The Chaboche nonlinear kinematic hardening model was added in ANSYS 5.6 to complement the existing isotropic and kinematic hardening rules that users relied on. Despite its availability for nearly ten years as of the time of this writing, the Chaboche model has enjoyed limited popularity, in part because of the perceived complexity of calibrating the material parameters. This memo hopes to introduce the basics related to the Chaboche nonlinear kinematic model.\"\n(Week 47, week of 05/04/08)"
  },
  {
    "title": "Characterization and Analysis on the Solder Ball Shear Testing Conditions",
    "author": "Xingjia Huang, S.W. Ricky Lee, Chien Chun Yan, and Sam Hui",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/ECTC2001-paper.pdf",
    "description": "\"This paper presents both experimental investigation and computational analysis on the solder ball shear testing conditions for ball grid array (BGA) packages.\" (Creep, contact)"
  },
  {
    "title": "Closing the Gaps on Data Interoperability [PDF]",
    "author": "Don Hemmelgarn",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Don_HemmelgarnITI_Interoperability_Pres.pdf",
    "description": "PowerPoint presentation"
  },
  {
    "title": "Clustering Results Around Peaks for Full-Harmonic Analyses in ANSYS",
    "author": "Aaron Acton (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/aacton20080723-clustering.pdf",
    "description": "\"This article presents a method for obtaining full harmonic solutions clustered around potential peak responses. Full harmonic analyses provide exact solutions, typically calculated at equally spaced intervals over the desired frequency range. Mode-superposition analyses, however, provide approximate solutions, but can be clustered around potential resonant peaks. The hybrid method discussed in this article uses a modal solution to determine natural frequencies, which are then used to calculate clusters of points surrounding those frequencies. Full harmonic solutions can then be performed at these clustered points. Examples and input les are provided in order to utilize this method.\""
  },
  {
    "title": "Collaborative Virtual Prototyping: A Product Development Imperative [PDF]",
    "author": "Marc Halpern",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Marc_Halpern7CVP_mh.pdf",
    "description": "PowerPoint presentation"
  },
  {
    "title": "Comparison of FLUID29 and FLUID79 Elements",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/FLUID29andFLUID79.pdf",
    "description": "\"Analyses were conducted to verify that similar results could be obtained by using the displacement formulated fluid elements FLUID79 or the pressure formulated fluid elements FLUID29.\""
  },
  {
    "title": "Comparison of Linear and Non-linear Soft Tissue Models with Post-operative CT Scan in Maxillofacial Surgery",
    "author": "Matthieu Chabanas, Yohan Payan, Christophe Marecaux, Pascal Swider, and Franck Boutault",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/LNCS3078_Chabanas.pdf",
    "description": "\"A Finite Element model of the face soft tissue is proposed to simulate the morphological outcomes of maxillofacial surgery. Three modelling options are implemented: a linear elastic model with small and large deformation hypothesis, and an hyperelastic Mooney-Rivlin model. An evaluation procedure based on a qualitative and quantitative comparison of the simulations with a post-operative CT scan is detailed. It is then applied to one clinical case to evaluate the differences between the three models, and with the actual patient morphology. First results shows in particular that for a “simple” clinical procedure where stress is less than 20%, a linear model seams sufficient for a correct modelling.\""
  },
  {
    "title": "Comparison of Rectangular and Spherical Models",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/cubeandsphere.pdf",
    "description": "\"The purpose of this investigation was to compare the two modelling techniques for an infinite boundary. The first technique involves setting the elements on the edges of the model to have an absorptive property by changing the material properties so that mu=1. The second technique involves the use of infinite elements (infinite129) that must be placed on a constant radius curvature.\""
  },
  {
    "title": "Compiling UPFs and Creating Customized ANSYS Executables [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI0901_Compiling_UPFs.pdf",
    "description": "\"ANSYS User Programmable Features (UPFs) are quite powerful means of customizing ANSYS beyond the scripting capabilities of the ANSYS Parametric Design Language (APDL). Writing one’s own constitutive models or complex loading functions or even creating a user-defined element are possible with UPFs. \n\n Because some users may find it challenging to get started using UPFs, this memo hopes to discuss general issues related to compiling and linking a customized version of ANSYS for Windows and Linux environments.\"\n\n (Week 51, week of 02/08/09)"
  },
  {
    "title": "Comprehensive Solder Fatigue And Thermal Characterization Of A Silicon Based Multi-Chip Module Package Utilizing Finite Element Analysis Methodologies",
    "author": "Bret A. Zahn",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/bzahn00.pdf",
    "description": "\"Viscoplastic finite-element simulation methodologies were utilized to predict ball and bump solder joint reliability for a silicon based five-chip multi-chip module package under accelerated temperature cycling conditions.\" (Nonlinear, Anand)"
  },
  {
    "title": "Compressive Strength of Solid Clay Brick Masonry under Eccentric Loading",
    "author": "A. Brencich, C. Corradi, L. Gambarotta, G. Mantegazza, E. Sterpi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/compressive.pdf",
    "description": "\"Arches, vaults and pillars generally experience eccentric normal force. As a consequence, the classical theories of masonry collapse, developed for concentrically compressed brickwork, are not directly applicable. In this paper experimental data on solid clay brick and lime-mortar masonry prisms, eccentrically loaded, are presented. Comparing the results to the response of a FEM model, some hints on the collapse mechanism of masonry show that the edge effects greatly affect the load carrying capacity of the brickwork. Besides, the plane section assumption is found to be acceptable up to the ultimate compressive strength, allowing relatively simple models to be used for arch-type structures.\" (Concrete SOLID65)"
  },
  {
    "title": "Conceptual Design for the SRRC Elliptically Polarizing Undulator EPU5.6. Part II: Magnetic Loading and Structure Deformation",
    "author": "Ch. Wang, M.C. Lin, C.H. Chang, L.H. Chang, H.H. Chen, T.C. Fan, K.T. Hsu, J.Y. Hsu, C.S. Hwang, K.T",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/WEP125G.pdf",
    "description": "\"In part II of the conference paper, we address our efforts on the determination of the maximal magnetic loading on the individual magnetic arrays, and on the estimation of the resulting structure deformation by using the 3D finite element code ANSYS.\""
  },
  {
    "title": "Constellation Pathfinder: A University Nanosatellite",
    "author": "C.D. Rayburn, H.E. Spence, H.E. Petschek, M. Bellino, J. Vickers, M. Murphy",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Rayburn_USU_Paper.pdf",
    "description": "\"This paper updates the progress of the Constellation Pathfinder Mission (CPM) design. Specifically, preliminary results in areas including satellite design, orbital mechanics, thermal design, structural design, and attitude determination and control are discussed.\""
  },
  {
    "title": "Constitutive Relationship Development, Modeling and Measurement of Heat Stressing of Micro-SMD Assembly with Sn3.9Ag0.6Cu SAC Alloy",
    "author": "Qiang Xiao, William Armstrong, James Pitarresi, Satish Chaparala, Brian Rogeman, Bahgat Sammakia, Lu",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/IPACK2005-73239.pdf",
    "description": "\"The thermal-mechanical response of electronic packages was simulated using the commercial finite element code ANSYS coupled with the Garofalo model to represent the solder constitutive creep response. The measured properties for bulk and thin-cast Sn3.9Ag0.6Cu SAC alloy were used in the FE modeling.\""
  },
  {
    "title": "Construction Machinery Cab Vibro-Acoustic Analysis and Optimisation",
    "author": "L. Bregant, G. Miccoli, M. Seppi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/nafems05c.pdf",
    "description": "\"A 3D cavity representing the earth-moving machine cab has been modelled by means of a FE structural mesh (Ansys), reproducing the characteristics of the real structure. Starting from the cab vibration load experimental acquisition, a BEM coupled analysis (Sysnoise) has been carried out to evaluate the cab inner vibro-acoustic field as a function of the physical properties of each structural element. A multi-objective design optimisation code (modeFrontier) drives the analysis process flow taking into account the cab parameter structural modifications and carrying out the vibro-acoustic field optimisation.\"\n[ANSYS Dynamics, version unspecified]"
  },
  {
    "title": "Contact Analysis Tips [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI0902_Contact_Tips.pdf",
    "description": "\"Generally speaking, nonlinear analyses involving contact can be quite challenging to solve when the contacting area changes during the load history. However, ANSYS Workbench Simulation has very robust contact technology, along with diagnostic tools that can help the user obtain converged, accurate solutions. This memo hopes to discuss some tips related to contact analyses in hopes of aiding the user who encounters difficulties when solving contact analyses.\""
  },
  {
    "title": "Contact Analysis of Workpiece-Fixture System Under Time-Varying Machining Loads Using Finite Element Method",
    "author": "N. Kaya, F. Öztürk",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/diemold2001.pdf",
    "description": "\"Proper fixture design is crucial to product quality in terms of precision, accuracy and finish of the machined part. Fixturing systems must be capable of positioning, holding and supporting the workpiece throughout the machining process. In this paper, modular fixture design verification analysis is carried out for time-varying machining forces using nonlinear finite element analysis. Chip removal effect is taken into account using element death technique and the frictional contact between workpiece and fixture elements is also considered. This paper also adresses applying optimal clamping forces in order to minimize the deformation. A case study is presented to demonstrate the suggested methodology.\""
  },
  {
    "title": "Contact Wizard Enhancements at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI05_ANSYS_6.0_Contact_Wizard.pdf",
    "description": "Describes some of the enhancements made to the Contact Wizard at ANSYS 6.0, including support of 17x contact elements' thermal features and ability to edit contact pair options through same interface.\n(Week 5, week of 10/22/01.)"
  },
  {
    "title": "Converting Prony Series to Frequency Domain",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/visco_harmonic.zip",
    "description": "Simple example showing how to convert Prony series for viscoelasticity from time domain to frequency domain. This is to convert TB,PRONY to TB,ELASTIC/SDAMP for use in harmonic response analyses."
  },
  {
    "title": "Converting piezoelectric data [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Week13_TNT_Conversion_of_Piezoelectric_Material_Data.pdf",
    "description": "Conversion of material properties of piezoelectric ceramics (such as PZT) has caused many users confusion because of the difference between manufacturer-supplied data and the format required by ANSYS. This memo hopes to clarify this point and to provide users with information on conversion routines. [Accompanying Spreadsheet]()."
  },
  {
    "title": "Converting pressures to nodal forces [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Week_17_STI52_TNT_converting_pressures_to_nodal_forces.pdf",
    "description": "Tip on converting element pressures to nodal forces. This can be useful for mode superposition methods where LVSCALE may not be suitable.\n SI_P2F Macro and test input file."
  },
  {
    "title": "Coupled Structural-Acoustic Analysis Using ANSYS [PDF]",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/fsi-ansys.pdf",
    "description": "Paper on using SHELL63 and SOLID45 with FLUID30 in acoustic analyses."
  },
  {
    "title": "Coupling low-order elements to high-order elements in ANSYS",
    "author": "Aaron Acton",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/acton20080620-coupling_low_to_high.pdf",
    "description": "\"This article presents several methods for obtaining coupling at the interface between low- and high-order elements in ANSYS. This situation can be encountered when modelling the fluid-structure interaction between a solid domain, modelled with quadratic elements, and an acoustic fluid domain, modelled with linear elements. The two methods determined to be most suitable for achieving this coupling are by using either constraint equations or contact elements, both of which are likely more-robust methods than by simply attaching coincident nodes on matching meshes. Examples are provided for each case described herein, and the results from each are compared to the ANSYS 11.0 verification problem VM177.\""
  },
  {
    "title": "Creating APDL Macros [PDF]",
    "author": "Mike Rife (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/week9-apdl-2.pdf",
    "description": "The use of the Ansys Parametric Design Language, APDL, to create simple but reusable macros can be a significant time saver. This Tip of the Week will show two examples of macros written for current Ansys users. These macros may be extended or used as templates for future macros."
  },
  {
    "title": "Creating a Helical Path",
    "author": "Paul McGarry (Galway-Mayo Institute of Technology)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/Helical_Path.pdf",
    "description": "\"A step by step GUI method for creating a left or right-handed helix, in any axis, for any pitch or diameter.\""
  },
  {
    "title": "Creep Resistance and Creep Bending Resistance of Light Metal Matrix Composites for Research in Airframe Structural Effiency",
    "author": "E. Neubauer and H.Peter Degischer",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/report35.pdf",
    "description": "\"Main aim of the research in the frame of the AMTT programme was the testing of a fiber reinforced Al-alloy. For investigation of the creep behaviour of this material, creep tests under bending were performed. The tested material was Al99.85+0.1%Mg reinforced with Al2O3 fibers (Altex/Sumitomo), which was prepared by means of gas pressure infiltration. Main benefit of such a material for application would be the lowering of the weight of the material without a loss of properties.\"(see Appendix A for ANSYS use in this document)"
  },
  {
    "title": "Customizing GUI Behavior [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI06_Customize_GUI.pdf",
    "description": "\"The /UIS and /MSTART commands provide the user with control over much of the GUI behavior. At 5.7 and 6.0, this has been extended to include control over the multilegend feature, background color, and mouse button assignment for dynamic rotations. Used in conjunction with the startxx.ans file, this allows the user to change GUI behavior in each ANSYS session.\""
  },
  {
    "title": "Cyclic Symmetry Analysis",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/cyclic_symmetry_analysis.pdf",
    "description": "Presentation on cyclic symmetry enhancements at ANSYS 6.1 (part of the \"Advanced Analysis with ANSYS\"seminar during the 2002 User's Conference)."
  },
  {
    "title": "Delamination in Patterned Films",
    "author": "X.H. Liu, M.W. Lane, T.M. Shaw, E. Simonyi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/IJSS2007.pdf",
    "description": "\"When the dielectric constant of an insulator in an interconnect is reduced, mechanical properties are often compromised, giving rise to significant challenges in interconnect integration and reliability. Due to low adhesion of the dielectric an interfacial crack may occur during fabrication and testing. To understand the effect of interconnect structure, an interfacial fracture mechanics model has been analyzed for patterned films undergoing a typical thermal excursion during the integration process. It is found that the underlayer pattern generates a driving force for delamination and changes the mode mixity of the delamination. The implications of our findings to interconnect processes and reliability testing have been discussed.\"\n[ANSYS Structural, version unknown]"
  },
  {
    "title": "Design And Manufacturing Of Micro Via-In-Pad Substrates For Solder Bumped Flip Chip Applications",
    "author": "John Lau, Chris Chang, Ricky Lee, Tsung-Yuan Chen, David Cheng, Tzyy Jang Tseng, Dyna Lin",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/lau.pdf",
    "description": "\"A novel and low-cost micro via-in-pad (VIP) substrate for supporting a solder bumped flip chip is presented in this study. Non-linear finite element analyses are used to determine the stress and strain in the copper VIP and the solder joint. Time-dependent non-linear analysis is used to predict the thermal-fatigue life of the VIP solder joint.\" (Nonlinear, Anand)"
  },
  {
    "title": "Design Optimization of an Automotive Universal Joint Considering Manufacturing Cost",
    "author": "Nick Cristello and Il Yong Kim",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/p499-cristello.pdf",
    "description": "\"This paper presents the shape optimization of an automotive universal joint, by simultaneously considering manufacturing cost, maximum drivable joint angle and part volume. Comprised of three main components - two yokes and a cross trunnion - a universal joint is a linkage used to transmit rotational motion from one shaft to another when the axes are coplanar, but not coinciding. In this research, universal joint designs are analyzed and compared using a weighted sum of three objective functions: minimization of machining cost, maximization of adjoining shaft joint angle, and minimization of total part volume. Part modeling and analysis is conducted using the Finite Element Analysis package ANSYS and optimization is implemented using MATLAB. The results show Pareto frontiers for both the flange and weld yoke, constructed using the Adaptive Weighted Sum technique. These frontiers clearly illustrate the trade-off between machining cost and joint angle; that is, to increase the joint angle, a corresponding increase in the cost of the part is required. It has been shown that maximization of driveable joint angle requires a simultaneous increase in machining cost of 4.4% and 2.7% for the flange and weld yoke, respectively.\"\n[ANSYS Structural, version 9.0]"
  },
  {
    "title": "Design and Analysis of Ultrasonic Actuator in Consideration of Length-Reduction for a USDC (Ultrasonic/Sonic Driller/Corer)",
    "author": "Z. Chang, S. Sherrit, M. Badescu, X. Bao, and Y. Bar-Cohen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/SPIE-05_Zensheu-USDC-modeling.pdf",
    "description": "\"The USDC uses a novel driving mechanism, transferring ultrasonic vibration to sonic frequency impacts with the aid of a free-flying mass block (free-mass). The free mass then drives the drill bit. The actuator consists of a stack of piezoelectric disks with a horn that amplifies the induced vibration amplitudes. The standard USDC is a slender device, and some times its length is too long for specific NASA missions. It is of current interest to have novel designs that reduce the length of the device. For this purpose, two novel horn designs were examined analytically. One is the flipped horn, the other is the planar folded horn. The new designs of the horn were analyzed using finite element modeling and the results allow for the determination of the control parameters that can optimize the performance of the ultrasonic horn in terms of the tip displacement and velocity. The results of the modeling are described and discussed in this paper.\"\n[ANSYS Piezoelectric, version 5.4]"
  },
  {
    "title": "Design and Characterization of Thin Film Microcoolers",
    "author": "Chris LaBounty, Ali Shakouri, John E. Bowers",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/micro3.pdf",
    "description": "\"Thin film coolers can provide large cooling power densities compared to bulk thermoelectrics due to the close spacing of hot and cold junctions. Important parameters in the design of such coolers are investigated theoretically and experimentally. A three-dimensional finite element simulator (ANSYS) is used to model self-consistently thermal and electrical properties of a complete device structure.\"\n[ANSYS Thermal, version 5.5.3]"
  },
  {
    "title": "Design and Implementation of a Flow Microsensor by using Silicon Microelectronics Technology",
    "author": "Roberto Rodrigues and Rogerio Furlan",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Artigo.pdf",
    "description": "\"This work presents the design of a gas flow microsensor that was implemented by using silicon microelectronics technology. Its main features are a low power consumption (tens of mW) and the possibility of integration in flow microactuators. It was adopted a calorimetric device with free-standing microfilaments and thermoresistive sensor elements. Analytical and numerical modeling were developed for device analyses and design. The free-standing microfilaments were fabricated using surface micromachining. Characteristic curves, of output voltage vs. flow, were obtained by using a commercial flow sensor for calibration. A good agreement was obtained comparing the flow microsensor experimental characteristic curves with numerical simulation results.\""
  },
  {
    "title": "Design, Fabrication, and Testing of Fixed-Valve Micro-Pumps [PDF]",
    "author": "F. Forster, R. Bardell, M. Afromowitz, N. Sharma, and A. Blanchard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/wam95_ufluidics.pdf",
    "description": "Use of Flotran for micropump analysis. (MEMS"
  },
  {
    "title": "DesignSpace Tutorial 1",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/dspace_part.zip",
    "description": "Simple tutorial on analyzing parts using DesignSpace with focus on compatibility with SolidWorks."
  },
  {
    "title": "DesignSpace Tutorial 2",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/dspace_assembly.zip",
    "description": "Simple tutorial on analyzing assemblies using DesignSpace with focus on compatibility with SolidWorks."
  },
  {
    "title": "Designing the Liquid-Nitrogen Injection Rakes for the European Transonic Windtunnel Project",
    "author": "Ian Glendinning",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/9601-010.pdf",
    "description": "Article from Heat Engineering magazine, back in 1993. Static and transient stress and thermal analysis performed in ANSYS 4.4a."
  },
  {
    "title": "Developing The Basis For Target Injection And Tracking In Inertial Fusion Energy Power Plants",
    "author": "D.T. Goodin, C.R. Gibson, R.W. Petzoldt, N.P. Siegel, L. Thompson, A. Nobile, G.E. Besenbruch, K.R.",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/A23417.pdf",
    "description": "The use of ANSYS's thermal and CFD capabilities to analyze the target injection and tracking of an Inertial Fusion Energy power plant"
  },
  {
    "title": "Development of CAD Model for MEMS Micropumps [PDF]",
    "author": "M. Arik, S. M. Zurn, A. Bar-Cohen, Y. Nam, D. Markus, and D. Polla",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/MSM99_UMN_ufluidic.pdf",
    "description": "Use of ANSYS in modal and harmonic analysis of micropumps (PZT cantilever beams). (MEMS)"
  },
  {
    "title": "Development of Convective Reflow-Projection Moiré Warpage Measurement System and Prediction of Solder Bump Reliability on Board Assemblies Affected by",
    "author": "Wei Tan (Georgia Institute of Technology)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/tan_wei_200804_phd.pdf",
    "description": "\"The effect of PWB warpage on the low cycle fatigue of the solder bumps on board assemblies was investigated using FEM and experimental study. The three- dimensional (3-D) models of PWBAs with varying board warpage were used to estimate the solder bump fatigue life for different types of plastic ball grid array (PBGA) packages mounted on PWBs. In order to improve the accuracy of FE results, the projection moiré technique was used to measure the initial warpage of PWBs, and this warpage was used as a geometric input to the FEM. Both Sn-Pb and lead-free solder materials were used in this study. The simulation results were validated and correlated with the experimental results obtained using the projection moiré system and accelerated thermal cycling tests. Design of experiments and an advanced prediction model were generated to predict board level solder bump fatigue life based on the initial PWB warpage, package dimensions and locations, and solder bump materials.\""
  },
  {
    "title": "Different Methods of Connecting Parts Together [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/week24-connecting_models_tow.pdf",
    "description": "Connecting Parts - A study of Continuous Mesh versus Bonded Contact versus Constraint Equations."
  },
  {
    "title": "Disruption Load Calculations Using ANSYS Transient Electromagnetic Simulations for the ALCATOR C-MOD Antennas",
    "author": "Peter H. Titus",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/disrpap.pdf",
    "description": "\"ANSYS has been used to compute eddy current loads in C-Mod antenna components due to a disruption. The antennas are on the outbuard mid-plane, away from the direct involvement with halo currents, which characterize loading in the inner divertor and wall. Only inductively driven currents are computed. A rather complex but manageable electromagnetic model is used. Three of the antennas used in C-Mod were analyzed, Lower Hybrid, ICRH, and MHD antennas. The goal of these simulations was principally to quantify upper bound disruption loads.\""
  },
  {
    "title": "DistributedLoad.zip",
    "author": "Paris Altidis (Borg Warner)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/DistributedLoad.zip",
    "description": "Zip file containing two example macros of applying distributed pressures."
  },
  {
    "title": "Drucker-Prager Models [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI0802_Drucker_Prager.pdf",
    "description": "\"The Drucker-Prager material model is used for pressure-dependent inelastic behavior of materials such as soils, rock, concrete, and powder. Because ANSYS offers three different Drucker-Prager constitutive models, this memo hopes to provide a comparison of the available options.\"\n(Week 44, week of 03/16/08)"
  },
  {
    "title": "Dynamic FEA and Simulation for A Series of Blast-Resist-door",
    "author": "Lu Xinzheng and Jiang Jianjing",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/12.pdf",
    "description": "\"A series of blast-resist-door were used widely. In order to know the behavior of the doors under blast load and verify the safety of the doors, dynamic finite element analysis and simulation are carried out with advanced FEA software, ANSYS/LS-DYNA and SAP. Contact surfaces are introduced to simulate the relation between the door leaf and doorframe, as well as the relation between the door hinges and bearings. Altogether 24 different load cases are analyzed to simulate various load conditions.\"\n[ANSYS LS-DYNA, version unspecified]"
  },
  {
    "title": "Dynamic Pile Testing and Finite Element Calculations for the Bearing Capacity of a Quay Wall Foundation",
    "author": "F. Kirsch, B. Plaßmann, T. Huch, W. Rodatz",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/st_wave00.pdf",
    "description": "\"In April 1999 the construction of a new quay wall in the port of Hamburg started. In a first stage two new berths with an overall length of 1400 m will be built. In order to proof the bearing capacity of the foundation dynamic pile testing is performed to a great extent. To date more than thirty different piles were tested by the Institute for Foundation Engineering and Soil Mechanics of the Technical University of Braunschweig. In order to check for possible set-up effects redriven tests were performed. For comparison reasons static load tests were also carried out, one of which was done with an instrumented pile to allow skin friction and end bearing to be evaluated separately. The CAPWAP results proofed to be very helpful especially in those cases where the testing situation differed from the later service condition. Special questions called for detailed finite element analysis of the load-settlement behaviour of single piles in certain construction stages.\"\nAlthough ANSYS is not explicitly mentioned, F. Kirsch also used ANSYS in two related papers, Stability of the vault developing over Soilcrete bodies and Ground Improvement and Its Numerical Analysis. "
  },
  {
    "title": "Economic Method for the Collection of Complex Materials Data for the Design of Microsystems [PDF]",
    "author": "Jürgen Wilde, Markus Thoben, Klaus Becker",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/mat2001_I1.pdf",
    "description": "Use of Anand model."
  },
  {
    "title": "Effect of Package Design and Layout on BGA Solder Joint Reliability of an Organic C4 Package",
    "author": "Biju Chandran, Deepak Goyal, and Jeffrey Thomas",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/s30p5a.pdf",
    "description": "\"Ball Grid Array (BGA) is currently the interconnect of choice for attaching microprocessors on a printed circuit board (PCB). The reliability of solder joints is one of the critical issues in BGA surface mount technology (SMT). During reliability testing, BGA fatigue failures were observed on test vehicles (TV). Finite element analysis and physical failure analysis were used to determine the risk to the product in the field. As part of this effort, parametric finite element analysis was carried out to determine the effect of design features like the package size, and BGA pattern on the propensity of fatigue failure. The results of the finite element analysis and physical failure analysis showed that the risk to fatigue failure was much greater on a peripheral / partial grid array package than in a full grid array package.\""
  },
  {
    "title": "Effect of Simulation Methodology on Solder Joint Crack Growth Correlation",
    "author": "Robert Darveaux",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/RDARV_Article1200.pdf",
    "description": "\"A generalized solder joint fatigue life model for surface mount packages was previously published in Refs [1,2]. The model is based on correlation to measured crack growth data on BGA joints during thermal cycling. It was subsequently discovered by Anderson et.al. that the ANSYS TM 5.2 finite element code used in the model had an error in its method for calculating plastic work [3]. It was shown that significant error in life prediction could result by using a recent version of the code where the bug has been fixed. The error comes about since the original crack growth constants were derived based on plastic work calculations that had the bug.\nIn this paper, crack initiation and growth constants are re-calculated using ANSYS 5.6. In addition, several other model related issues are explored with respect to the crack growth correlations. For example, 3D slice models were compared to quarter symmetry models. Anand’s constitutive model was compared with Darveaux’s constitutive model. It was shown that the crack growth rate dependence on strain energy density always had an exponent of 1.10 +/- 0.15. This is in the range of the original correlation, so the accuracy of relative predictions should still be within +/- 25%. However, the accuracy of absolute predictions could be off by a factor of 7 in the worst case, if the analyst uses a modeling procedure that is not consistent with that used for the crack growth correlation. The key to good accuracy is to maintain consistency in the modeling procedure.\""
  },
  {
    "title": "Effects of Nonlinear Geometric and Material Properties on the Seismic Response of Fluid/Tank Systems",
    "author": "He Liu, Daniel H. Schubert",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/effects_of_nonlinear_geometric.pdf",
    "description": "\"To explore the effects large deformation and nonlinear material properties have on the seismic response of fluid/tank systems, the computer program ANSYS was selected to develop a Finite Element Analysis (FEA) model of a ground level, cylindrical steel shell and roof tank structure with contained fluid under seismic load. The ANSYS program was selected for its ability to include shell and structural steel elements, contained fluid elements, fluid-structure interactions, material and geometric nonlinearities, and contact type elements. For purposes of this study, analysis results from a linear elastic, small deformation fixed base model are compared with an elasto-plastic material property model with large deformation assumptions. Results show the significant difference in results based on the assumptions used and indicate that current design code based values may not be conservative in resultant loading calculations.\""
  },
  {
    "title": "Elastic Foundation Stiffness",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/EFS.pdf",
    "description": "Short explanation of what elastic foundation stiffness (SURF154) is and how to calculate the resulting stiffness for non-planar cases. In Workbench Mechanical, this feature is referred to as an \"Elastic Support\"."
  },
  {
    "title": "Electromagnetic, Thermal, and Structural Analysis of RF Cavities Using ANSYS",
    "author": "N. Hartman, R. A. Rimmer",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/MPPH060.pdf",
    "description": "\"We report on techniques developed for producing electromagnetic, thermal, and structural solutions to RF cavity design problems in ANSYS, using one model. Methods for preparing imported geometry from solid modeling programs are discussed, and meshing techniques are suggested. A study of mesh density is presented, comparing mesh size with heat flux and Q factor convergence. The general analysis protocol is presented in a stepwise fashion, describing the macros that are used for conducting RF calculations. Finally, these techniques are applied to a proposed RF cavity for the NLC damping rings, which is shown as an example.\""
  },
  {
    "title": "Electromechanical Transducer Element for MEMS Analysis in ANSYS [PDF]",
    "author": "Miklos Gyimesi, Dale Ostergaard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/MSM99_ANSYS_trans126.pdf",
    "description": "Presented at MSM 1999. (MEMS)"
  },
  {
    "title": "Electromechanical analysis of micromechanical SOI-fabricated RF resonators",
    "author": "T. Lamminmaki, K. Ruokonen, I. Tittonen, T. Mattila, O. Jaakkola, A. Oja, H. Seppa, P. Seppala, and",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/T51-01.pdf",
    "description": "\"In this paper, finite element method (FEM) simulations are used to model mechanical properties of MEMS resonators. Using a static displacement analysis the effective spring constant and mass are calculated. Nonlinearity of the mechanical restoring force is simulated to analyze large amplitude behavior of the resonator.\""
  },
  {
    "title": "Element for Modelling of Interaction Between Foundations and Bedrock in ANSYS Software",
    "author": "Radim Cajka, Ondrej Víta",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/2522-3EN.pdf",
    "description": "\"Ansys provides standard solutions to contact tasks. It is a high-performing computing tool that offers several modifications, making it possible to create a new element and adjust the calculation to individual requirements. When dealing with specific problems relating to the contact between the foundation and the foundation soil, it is possible to create an element that will take into account the behaviour of a soil layer under the foundation exposed to shear. The shearing load can be caused by undermining, concrete creep, or concrete shrinkage.\"\nExample of user-defined element (older USER100-105)\n[ANSYS Nonlinear, version 5.7.1] "
  },
  {
    "title": "Evaluation of Acoustic Propagation Paths into the Human Head",
    "author": "William D. O’Brien, Jr. and Yuhui Liu",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/OBrien-NATO-15-2005.pdf",
    "description": "\"The overall goal has been to develop an acoustic wave propagation model using well-understood and documented computational techniques that track and quantify an air-borne incident acoustic wave propagated around, into and in the human head. This model serves as a computational tool to elucidate the acoustic wave propagation around, into and in the human head. Specifically, the model determines two features: (1) alternate acoustic propagation paths to the cochlear shell that exist besides the normal air-borne acoustic propagation path (eardrum-ossical path) through the auditory canal and (2) sound pressure amplitude in the cochlear shell (relative to the air-borne sound pressure amplitude) via the alternate propagation paths. A 3D finite-element solid mesh was constructed using a digital image database of an adult male head. Coupled acoustic-mechanical finite-element analysis (FEA) was used to model the wave propagation through the fluid-solid-fluid media.\"\n[ANSYS Acoustics, version 6.1]"
  },
  {
    "title": "Example harmonic analysis using the large mass method [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/harmonic-large-mass-method.pdf",
    "description": "Step-by-step instructions on performing an example harmonic analysis using the large mass method."
  },
  {
    "title": "FE Analysis of ATLAS: End Cap Support Structure - PSD Spectrum Analysis",
    "author": "C.J.Nelson",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/frequency_response.pdf",
    "description": "\"This report investigates the effect of a PSD (Power Spectral Density) random input load on an early FE model of the ATLAS EndCap Support Structure. Statistical predictions of the maximum displacement are presented.\"[ANSYS Structural, version 5.3]"
  },
  {
    "title": "FFTDFT.zip",
    "author": "Juan Carlos Lancha (OHL, S.A.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/FFTDFT.zip",
    "description": "From the author:\n\n\"These small APDL macros perform Fourier transforms (FFT and DFT) of discrete signals. This procedure decomposes a time domain signal into a sum of harmonic (frequency domain) signals. It’s a useful APDL tool when dealing with dynamic and harmonic problems in ANSYS.\""
  },
  {
    "title": "FINITE ELEMENT MODELING OF DAMAGE ACCUMULATION IN BOLTED COMPOSITE JOINTS UNDER INCREMENTAL TENSILE LOADING",
    "author": "Th. Kermanidis, G. Labeas, K.I. Tserpes and Sp. Pantelakis",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/306.pdf",
    "description": "A three-dimensional progressive damage model was developed in order to simulate the damage accumulation of bolted single-lap composite joints under in-plane tensile loading. This model is capable of predicting the residual strength and residual stiffness of laminates with arbitrary lay-ups, geometries and bolt positions. The parametric study includes stress analysis, failure analysis and material property degradation. Stress analysis of the three-dimensional geometry was performed using the ANSYS FE code. Failure analysis and degradation of material properties were implemented using a progressive damage model, which is incorporated in an ANSYS macro-routine. The progressive model utilizes a set of stress-based Hashin-type criteria and a set of appropriate degradation rules. A parametric study was performed to examine the effect of bolt position and friction upon residual strength and damage accumulation."
  },
  {
    "title": "FLOTRAN Chills Out Hot Aerospace Electronics",
    "author": "Mark Troscinski, Jiang Guangnan, Zhang Minyi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/flotran_chills_out.pdf",
    "description": "Examples of use of Flotran for electronics applications.\nFrom ANSYS Solutions, Vol. 4 Number 2."
  },
  {
    "title": "Fast Nonlinear Transient Thermal Solver [PDF]",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/THOPT.pdf",
    "description": "Information on the fast nonlinear thermal solution method (THOPT), beta in 5.6 and documented in 5.7"
  },
  {
    "title": "Fatigue Code Benchmark",
    "author": "Riccardo Testi (Piaggio & C. spa)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/benchmark_1.zip",
    "description": "A comparison of fatigue codes — LMS Virtual.Lab (Durability), FEMFAT, and MSC.Fatigue — for use with ANSYS"
  },
  {
    "title": "Finite Deformations Of An Earthworm Segment",
    "author": "H. Kunz",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/Pilsen00.pdf",
    "description": "Use of Mooney-Rivlin model."
  },
  {
    "title": "Finite Element Analysis Of Crowning Sealing Caps",
    "author": "Henri Champliaud, L Van Ngan",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/finite_element_analysis_of_crowning_caps.pdf",
    "description": "\"Metal closures, with an integrated gasket, are widely used in the food industry to ensure the sealing of the glass bottles by setting. The success of this bottle-capping is due to the relevant choice of the variables in the manufacturing process. Actually, the effects of the various variables of the process are not precisely understood.\"\n\n\"In this paper, the leakage pressure of an assembly, with given parameters of a standard setting operation is predicted. The study is concentrated firstly on the simulation of setting the cap on the bottle, and secondly, on the global distribution of the efforts of contact on the gasket according to the internal pressure. Finally, the leakage pressure of the assembly is determined using practical tests that relate the leakage pressure with the global force exerted on the gasket.\""
  },
  {
    "title": "Finite Element Analysis Of Plasticity-Induced Crack Closure For Inclined Cracks",
    "author": "L. W. Wei and M. N. James",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/LiPaperECF13.pdf",
    "description": "\"The contact occurring in inclined cracks is a general contact problem, and thus a general contact analysis must be implemented in which a combined load and displacement control procedure is used. The commercial FE code ANSYS 5.4 used in this work provides the utilities to deal with general contact problems.\""
  },
  {
    "title": "Finite Element Analysis To Investigate The Significance Of Functional Gradients In Dental Restorations [PDF]",
    "author": "Tan Kok Wai, Alex and Anand Asundi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/alex-fem.pdf",
    "description": "Use of SOLID46 element."
  },
  {
    "title": "Finite Element Analysis at Mannesmann VDO Fuel Systems [PDF]",
    "author": "Zlatko Penzar",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/Dr_Penzar.pdf",
    "description": "Finite Element Analysis at Mannesmann VDO Fuel Systems - ppt presentation"
  },
  {
    "title": "Finite Element Analysis for Solder Ball Connect (SBC) Structural Design Optimization",
    "author": "J.S. Corbin",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ibmrd3705C.pdf",
    "description": "\"Solder Ball Connect (SBC) is a second-level surface mount electronics packaging technology in which ceramic modules containing one or more chips are joined to a circuit card (FR-4) by means of an array of nonhomogeneous solder columns. These columns consist of a high-temperature-melting 90%Pb/lO%Sn solder sphere attached to the module and card with eutectic solder fillets. The solder structures accommodate the bulk of the strain (which is due to the thermal- expansion mismatch between FR-4 and the 9211 ceramic of the modules) generated during power cycling. If the solder structures are not properly designed, the thermal strain can be a source of premature fatigue failure. In this work, finite element analysis is used to characterize the plastic strains that develop in the SBC interconnection during thermal cycling. Since plastic strain is a dominant parameter that influences low-cycle fatigue, it is used as a basis of comparison for various structural alternatives. Designed experiment techniques are used to systematically evaluate the thermal strain sensitivity to structural variables. Results are used to identify an optimally reliable structure that is robust in terms of assembly-process variables.\""
  },
  {
    "title": "Finite Element Based Reduced Order Modeling of MEMS [PDF]",
    "author": "Dale Ostergaard, Miklos Gyimesi",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/MSM00_ANSYS_romfin.pdf",
    "description": "Presented at MSM 2000. (MEMS)"
  },
  {
    "title": "Finite Element Based Solder Joint Fatigue Life Predictions for a Same Die Stacked Chip Scale Ball Grid Array Package",
    "author": "Bret Zahn",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/finite_element_based_solder_joint_fatigue.pdf",
    "description": "\"Viscoplastic finite-element simulation methodologies were utilized to predict solder joint reliability for a same die size, stacked, chip scale, ball grid array package under accelerated temperature cycling conditions (-40C to +125C, 15min ramps/15min dwells). The effects of multiple die attach material configurations were investigated along with the thickness of the mold cap and spacer die. The solder structures accommodate the bulk of the plastic strain that is generated during accelerated temperature cycling due to the thermal expansion mismatch between the various materials that encompass the stacked die package. Since plastic strain is a dominant parameter that influences low-cycle fatigue, it was used as a basis for evaluation of solder joint structural integrity. The paper discusses the analysis methodologies as implemented in the ANSYS finite element simulation software tool and the corresponding results for the solder joint fatigue life. Some ANSYS parametric design language commands are included for the benefit of those readers who are familiar with the tool.\""
  },
  {
    "title": "Finite Element Limit Load Analysis of Thin-Walled Structures by ANSYS (Implicit), LS-DYNA (Explicit) and in Combination",
    "author": "Wilhelm Rust",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/limit_load.pdf",
    "description": "\"After discussing general properties of implicit Finite Element analysis using ANSYS and explicit analysis using LS-DYNA it is shown when and how quasi-static limit load analyses can be performed by a transient analysis using explicit time integration. Then we focus on the remaining benefits of implicit analysis and how a proper combination of ANSYS and LS-DYNA can be used to prepare the transient analysis by common preprocessing and static analysis steps. Aspects of discretization, solution control, consideration of imperfections and methods of checking the results are outlined.\"[ANSYS LS-DYNA, Nonlinear, version unspecified]"
  },
  {
    "title": "Finite Element Method Analysis Of Non-Linear Behaviour Of Implants And Stents [PDF]",
    "author": "J. Awrejcewicz, M. Ciach, K. Wlodarczyk",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/implant_stent.pdf",
    "description": "Example of using ANSYS for stent application (Mooney-Rivlin and kinematic hardening plasticity)."
  },
  {
    "title": "Finite Element Modeling of Capacitor Micromachined Ultrasonic Transducers",
    "author": "Yongrae Roh and Butrus T. Khuri-Yakub",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/5B1.pdf",
    "description": "\"A finite element model of cMUTs is constructed using the commercial code ANSYS. The complex load impedance seen by individual cells is compared with the plane wave real impedance seen by a parallel combination of the cells to make a transducer. The result shows the origin and level of crosstalk between array elements, with evidence of coupling through Stoneley and Lamb waves.\" (acoustics)"
  },
  {
    "title": "Finite Element Modeling of Elastic Modulus in Ductile Irons: Effect of Graphite Morphology",
    "author": "S.H. Pundale, R.J. Rogers, G.R. Nadkarni",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/98-102.pdf",
    "description": "\"This investigation is the first to deal with the modeling and prediction of effective elastic modulus of ductile irons using finite elements. Both plane stress and axisymmetric formulations were used to predict elastic moduli. With finite elements, it is possible to include microstructural parameters that are extremely difficult or impossible to model analytically. Assuming that the graphite nodules act as voids, the effective elastic modulus was modeled by considering the effect of small strains for nodule variables of volume fraction, shape, size and distribution. (No matrix variables have been considered.)\""
  },
  {
    "title": "Finite Element Predictions of Plasticity-Induced Fatigue Crack Closure in Three-Dimensional Cracked Geometries",
    "author": "Jeffrey Skinner, Jr.",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/skinner_thesis.pdf",
    "description": "\"Elastic-plastic finite element analyses were performed to predict the crack opening level profiles in semi-elliptical surface cracks.\""
  },
  {
    "title": "Finite Elements for Thermoelectric Device Analysis in ANSYS",
    "author": "Elena Antonova and David Looman",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/antonova-C2.pdf",
    "description": "\"A new set of ANSYS coupled-field elements enables users to accurately and efficiently analyze thermoelectric devices. This paper reviews the finite element formulation, which, in addition to Joule heating, includes Seebeck, Peltier, and Thomson effects. Examples of steady-state and transient simulations of a thermoelectric generator and a single-stage Peltier cooler are presented for thermoelectric analysis verification. An analysis of a multistage thermoelectric cooler is performed to demonstrate ANSYS parametric analysis capability.\""
  },
  {
    "title": "First Micromachined Silicon Load Cell for Loads up to 1000 kg",
    "author": "Henk Wensink, Meint J. de Boer, Remco J. Wiegerink, Robert A.F. Zwijze, Miko C. Elwenspoek",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/spie98.pdf",
    "description": "\"In this paper, a bulk micromachined silicon load cell is presented, designed for loads up to 1000 kg. ANSYS simulations were used to determine the load cell dimensions and strain gauge positions.\""
  },
  {
    "title": "Flip Chip Reliability Modeling Based on Solder Fatigue as Applied to Flip Chip on Laminate Assemblies",
    "author": "Scott Popelar, Michael Roesch",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/popelar3.pdf",
    "description": "\"A 63Sn/Pb solder fatigue model has been previously developed based on a correlation of flip chip solder fatigue data combined with nonlinear finite element analysis. This model has been successfully applied in the prediction of PBGA and CSP fatigue lives as well as a parametric study investigating the reliability of flip chip assemblies and the influence of specific design parameters. In this investigation, flip chip reliability predictions are generated based on solder fatigue modeling and compared to actual thermal cycling reliability data. The influence of both solder fatigue and underfill delamination are considered in interpretation of the experimental data.\""
  },
  {
    "title": "Flotran Enhancements at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI10_Flotran_Enhancements_at_6.0.pdf",
    "description": "\"There have been several enhancements to Flotran at 6.0. These changes include more robust default settings, an additional advection scheme, a new coupling algorithm, and improvements to the ALE mesh morpher.\""
  },
  {
    "title": "Formatting output text of results (PRxxxx family of commands) [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/week1-formatting-output-text.pdf",
    "description": "This memo outlines some of the options available in ANSYS to produce and to format output listings: (1) the use of the /FORMAT statement with the PRxxxx series of commands and (2) the application of *VWRITE to create custom output. This memo outlines some of the options available in ANSYS to produce and to format output listings: (1) the use of the /FORMAT statement with the PRxxxx series of commands and (2) the application of *VWRITE to create custom output."
  },
  {
    "title": "Fully Automatic Adaptive Mesh Refinement Integrated into the Solution Process",
    "author": "Joseph R. Tristano, Zhijan Chen, D. Alfred Hancq, Wa Kwok",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/tristano03.pdf",
    "description": "\"Finite element analysts and designers need to feel confident in the results of their analyses before sending a product to prototype or production. Mesh discretization can greatly influence the desired results. In this paper we present framework for adaptive mesh refinement to obtain FEA results with a desired accuracy. The process involves adaptively refining the mesh based on solution error norms until the result desired converges to certain accuracy. The adaptive refinement/meshing process must be fully automatic and very robust. We present an exhaustive method to create a fully automatic and integrated process that takes advantage of many of the mesh refinement and mesh optimization algorithms found in literature. The results of the process provide the user with the desired accuracy in the smallest number of iterations possible.\"\n\n[Workbench Simulation, version 7.1]"
  },
  {
    "title": "Gasket Materials",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/conflong_gasket.pdf",
    "description": "Presentation on the gasket materials and companion interface elements, introduced at ANSYS 6.1 (part of the \"Advanced Analysis with ANSYS\" seminar during the 2002 User's Conference)."
  },
  {
    "title": "General ANSYS Tips (5.5)",
    "author": "Carl Howard (University of Adelaide)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ansys_tips.pdf",
    "description": "Where to get help \n  Insufficient disk space \n Bulk compression mode \n Choice of solver \n  Element Normals \n Boolean operations on solid models \n  Meshing \n Loading an array from a file \n Using ETABLE and extracting the results to an array \n Output when using the GUI \n Generating editable WMF figures "
  },
  {
    "title": "Geometrical Aspects of a Hollow-Cathode Magnetron (HCM)",
    "author": "Zhehui Wang and Samuel A. Cohen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/PPPL-3321.pdf",
    "description": "\"A hollow-cathode magnetron (HCM), built by surrounding a planar sputtering-magnetron cathode with a hollow-cathode structure (HCS), is operable at substantially lower pressures than its planar-magnetron counterpart... Detailed magnetic field distribution was calculated using the ANSYS code, and confirmed by Hall probe measurements.\""
  },
  {
    "title": "HDPUG's Design for Lead-Free Solder Joint Reliability of High-Density Packages",
    "author": "J. Lau, W. Dauksher, J. Smetana, R. Horsley, D. Shangguan, T. Castello, I. Menis, D. Love, B. Sulliv",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/S42-2_Dauksher.pdf",
    "description": "\"The lead-free solder-joint reliability of the high-density packages, 256-pin PBGA (plastic ball grid array), 388-pin PBGA, and 1657-pin CCGA (ceramic column grid array), on PCB (printed circuit board) subjected to temperature cycling is investigated. Emphasis is placed on the determination of the creep responses (e.g., stress, strain, and strain energy density) of the lead-free solder joints of these packages. The lead-free solder is assumed to obey the Garofalo-Arrhenius creep constitutive law. The results presented herein should be useful for a better understanding of the thermal-mechanical behaviors of the lead-free solder joints in these high-density package assemblies.\""
  },
  {
    "title": "High End Workbench Tip",
    "author": "PADT",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/HE_WB.zip",
    "description": "Taken from PADT's SWAU group meeting on performing high-end analyses with Workbench Simulation."
  },
  {
    "title": "Hill's Potential [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI0808_Hill.zip",
    "description": "\"Anisotropic plasticity using Hill’s yield criterion was introduced in ANSYS 5.7, and the extensions to anisotropic creep and viscoplasticity were added in ANSYS 6.0. While Hill’s stress potential is most commonly used for rolled sheets, it can be used for other situations where three orthogonal planes of symmetry are preserved. This memo will introduce details of the usage of Hill’s potential in ANSYS.\"\n(Week 50, week of 08/31/08)"
  },
  {
    "title": "History of ANSYS University Support Program",
    "author": "D.E. Dietrich (Curtiss-Wright Electro-Mechanical Corporation)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/ANSYS_University_Support_Program.pdf",
    "description": "This document describes the history of the ANSYS University Support Program as well as history of ANSYS/ED software."
  },
  {
    "title": "Human Heart Valves. Hyperelastic Material Modeling",
    "author": "Mihai Stuparu",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/Stuparu.pdf",
    "description": "\"Performing a finite element analysis (FEA) on a hyperelastic material is difficult due to nonlinearity, large deformation, and material instability. This paper provides a brief review of the hyperelastic theory and discusses several important issues that should be addressed when using ANSYS. Analysis on a fatigue specimen is used as an example of one of our product development challenges upon which these issues were illuminated. We believe that a stable material model in combination with a good understanding of structural instability for traditional materials is the key to success in simulating hyperelastic materials using ANSYS.\""
  },
  {
    "title": "Hybrid Finite Element - Trefftz Method for Open Boundary Analysis [PDF]",
    "author": "Miklos Gyimesi, Igor Tsukerman and Doug Lavers",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/MSM00_ANSYS_trefftz.pdf",
    "description": "Presented at MSM 2000. (MEMS)"
  },
  {
    "title": "Hybrid P-Element and Trefftz Method for Capacitance Computation [PDF]",
    "author": "Miklos Gyimesi, Jian-She Wang, Dale Ostergaard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/MSM00_ANSYS_tzpcfin.pdf",
    "description": "Presented at MSM 2000. (MEMS)"
  },
  {
    "title": "Hyper-Elastic Contact Analysis of a Push-Button Diaphragm Seal",
    "author": "Jeffrey R. Annis",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/hyperelasti_contact_analysis.pdf",
    "description": "\"Presented is the non-linear finite element analysis of a rubber diaphragm seal utilizied in a pushbutton design. Analysis considerations encompassed, nonlinear hyper-elastic material behavior of the rubber, large deflection analysis of seal complex motion, and contact analysis with mating parts. Design parameters of primary interest were, seal deflection patterns and seal actuation force as a function of travel.\""
  },
  {
    "title": "Hyperelasticity",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/conflong_hyperel.pdf",
    "description": "Presentation on the various hyperelastic strain energy functions available in ANSYS (part of the \"Advanced Analysis with ANSYS\" seminar during the 2002 User's Conference).erel.pdf"
  },
  {
    "title": "INTERP.zip",
    "author": "Vladimir Tkach (NPO Energomash)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/INTERP.zip",
    "description": "\"This example interpolates stress-strain curve by polynomial function - Strain=A1+A2*StressA3*Stress^2, in temperature area between Proportional, Yield and Ultimate stresses and reads it into ANSYS db-file.\""
  },
  {
    "title": "Identification Methodology of Electrical Equivalent Circuit of the Piezoelectric Transformers by FEM",
    "author": "Pigache François, Nadal Clément",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Ansys_PT_EEC.pdf",
    "description": "Methodology using Ansys analyses for the identification of Electrical Equivalent Circuit of piezoelectric transformer. The demonstration is done with typical multilayered Rosen transformer but the method is relevant for any kind of transformer structures."
  },
  {
    "title": "Impact Of Ball Via Configurations On Solder Joint Reliability In Tape Based Chip-Scale Packages [PDF]",
    "author": "Bret Zahn",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/bzahn_ball_via_fatigue_paper.pdf",
    "description": "\"Three-dimensional finite element analysis has been applied to determine the time-dependent solder joint fatigue response of a tape based chip-scale package under accelerated temperature cycling.\" (Nonlinear, Anand)"
  },
  {
    "title": "Implicit Creep",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/conflong_creep.pdf",
    "description": "Presentation on implicit creep (part of the \"Advanced Analysis with ANSYS\" seminar during the 2002 User's Conference)."
  },
  {
    "title": "Improvements to Time-History Postprocessing at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI08_ANSYS_6.0_Variable_Viewer.pdf",
    "description": "\"This tips and tricks focuses on improvements at 6.0 on the Time-History postprocessor. (After I did this, I realized that a lot of this was already covered in the 6.0 Update seminar, but, oh well...)\""
  },
  {
    "title": "Integrating ANSYS with Modern Numerical Optimization Technologies",
    "author": "Shen-Yeh Chen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/Ans-Mag1b.pdf",
    "description": "\"Design automation with finite element analysis as a simulation and evaluation tool is becoming more and more desired. The ability to do automatic design iteration has constantly been a popular research and engineering topic. In this article, we will show how Honeywell Engines & Systems took advantage of the flexible environment of ANSYS to achieve this goal.\" (Optimization, APDL)"
  },
  {
    "title": "Introduction to the Residual Vector Method [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI0803_Residual_Vectors.zip",
    "description": "\"The residual vector method can improve the accuracy of mode-superposition harmonic response or transient analyses, especially when the high-frequency content of the structure is excited. This memo provides details on how users can take advantage of this analysis technique introduced in ANSYS 11.0.\""
  },
  {
    "title": "Iterative Determination of Save Working Loads (SWL) for Crawler Cranes",
    "author": "G. Kolarov, K.-H.Reckziegel, T.Göllnitz",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/1_1_4.pdf",
    "description": "\"A program for the calculation of Save Working Loads (SWL) is introduced. It uses ANSYS and its parametric design language. The models are based on large displacements, small strains and linear-elastic material. The limit state method with partial safety coefficients is applied. For a crawler crane many configurations exist and they have to be calculated for different positions and load cases. Special attention is paid to the overall structural stability of the crane and to the effectiveness of the calculations.\""
  },
  {
    "title": "LS-DYNA Simulations of Thermal Shock in Solids",
    "author": "Goran Skoro",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/GSkoro1.pdf",
    "description": "PowerPoint presentation on thermal shock on rod.\n[ANSYS LS-DYNA, version unspecified]"
  },
  {
    "title": "Large-Area, High-Transparency Extraction System for Negative Ions",
    "author": "B. Heinemann, J. Bucalossi, P. Frank, R. Riedl, A. Simonin, E. Speth, O. Vollmer",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/large_area_heinemann.pdf",
    "description": "(Thermal analysis)"
  },
  {
    "title": "Legend_Example.zip",
    "author": "Bob Weathers (Trane)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Legend_Example.zip",
    "description": "Example of customizing legend with annotations. See \"Read Me\"file for details, along with AVI animation.\"Essentially, I turn off the legend and write annotations into this area. It gives me considerable control over what appears there. I have also found that I can better communicate results to my customers by, say, having a legend that's reads 1.23 mils rather than 0.123E-02 inches or by referencing drawing and revision numbers, test results, material properties, and so on.\"\n\"You might need to change some of the character size and line spacing dimensions in the macros. Again, though, they work just fine for my hardware.\""
  },
  {
    "title": "License monitoring and reporting [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/week7-TNT_License_Reporting.pdf",
    "description": "Information on license monitoring and reporting for Elan (ANSYS 5.4-5.6). At 5.7, licensing has reverted back to FlexLM, and this document is not applicable."
  },
  {
    "title": "Load vs. displacement control in contact problems [PDF]",
    "author": "Karen Dhuyvetter (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/week2-contact1.pdf",
    "description": "Discussion on load vs. displacement control for contact problems."
  },
  {
    "title": "Local Approximation Estimators For Algebraic Multigrid",
    "author": "Jan Mandel",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/estim.pdf",
    "description": "\"We are concerned with the development of Algebraic Multigrid (AMG) for symmetric, positive definite linear systems arizing from finite element discretization of elliptic partial differential equations. AMG methods attempt to create coarse levels from the algebraic system automatically, using no or only a minimum of additional information. The basic idea of the multigrid algorithm is that fine level error on which the smoothing process is not effective should be reduced by the coarse correction. Therefore, a-priori estimates of the approximation of fine level functions by coarse level function are important to guide the design of robust AMG methods.\""
  },
  {
    "title": "Long Parameter and Component Names at 6.0 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI04_Long_Names_and_Strings.zip",
    "description": "\"Starting from version 5.7, strings have been introduced to replace character arrays. Strings allow for up to 128 characters for APDL purposes, instead of the 8-letter limit of character parameters. The /INQUIRE command as well as string manipulation functions (see *GET online help) extend the usefulness of strings to retrieve and manipulate data. *VWRITE has also been enhanced to support C-format statements, useful in writing out long strings.\"\n\"At 6.0, the 8-character limitation on parameters, components, and /POST26 variables has been removed. Users can now specify up to 32 character for these items, allowing for much more descriptive names. In /POST26, variables can also be referred to by name when plotting or listing.\""
  },
  {
    "title": "Low Creep and Hysteresis Load Cell Based on a Force to Liquid Pressure Transformation",
    "author": "Robert A.F. Zwijze, Remco J. Wiegerink, Theo S. J. Lammerink, and Miko Elwenspoek",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Dutchsensorconf98.pdf",
    "description": "\"Important problems in load cells are creep and hysteresis. Expensive high grade steels are used in order to reduce these effects. In this paper a load cell design based on a force to liquid pressure transformation is presented. The design is insensitive to hysteresis and creep and can be made at very low costs. Analytical, numerical and experimental results are in very close agreement with each other.\" (FLUID79)"
  },
  {
    "title": "Manipulating FE Mesh [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI04_Manipulating_FE_Mesh.zip",
    "description": "\"There are some special situations where a user may be required to generate or manipulate a database consisting mainly of finite element entities without solid model geometry. With some careful planning, dealing with mesh-only databases can prove to be relatively easy. \n\n Typical situations that may arise include the following: \n\n Import of mesh from Workbench Simulation or AI*Environment/ICEM CFD \n  Generation of repetitive geometry \n\n This memo hopes to cover these situations in more detail.\""
  },
  {
    "title": "Manual Calculation of Strain Energy Density [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI10_Manual_Calculation_of_SEND.zip",
    "description": "\"Output of elastic, plastic, and creep strain energy densities (SEND) was introduced in ANSYS 6.0, although this is limited to 18x elements in nonlinear analyses. Users whose models include core elements with plasticity and creep may also wish to obtain these quantities, and this memo hopes to review this procedure.\"\n(Week 22, week of 12/22/02.)"
  },
  {
    "title": "Mass property calculation methods [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/week3-Mass_Calculation_Macros.pdf",
    "description": "This memo covers some ways to determine mass properties of an ANSYS model."
  },
  {
    "title": "Memory management and configuration [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/Week_14_Memory_Configuration.pdf",
    "description": "Memo on memory management and configuration, especially in conjunction with the PCG solver and options in linear static analyses."
  },
  {
    "title": "Mesh Discretization Error and Criteria for Accuracy of Finite Element Solutions",
    "author": "Chandresh Shah",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/9.pdf",
    "description": "\"Any finite element analysis performed by an engineer is subject to several types of errors that can compromise the validity of the results. These errors can be broadly classified under the following categories: 1) user error - incorrect usage of FE software or input by the FE analyst, 2) errors due to assumptions and simplifications used in the model and 3) errors due to insufficient mesh discretization. User errors can be prevented by developing and utilizing a comprehensive pre and post processing checklist and by appropriate training in the basics of finite element analysis and usage of FE software. Errors due to modeling assumptions and simplifications can be alleviated by adding complexity to the model so that it better represents the physics of the problem being analyzed. Errors due to the inadequacy or coarseness of the mesh are often overlooked by the analyst. These errors due to mesh discretization can be fixed by evaluating the quality of the mesh and by developing and utilizing criteria that characterize the accuracy of the FE solution. This paper describes the source of mesh discretization error and presents several criteria that can be used by an FE analyst to evaluate the accuracy of the FE solution.\"\n\n[ANSYS 5.7, 2002 Conference] "
  },
  {
    "title": "Meshing in Workbench [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI0801_Meshing.pdf",
    "description": "\"Mechanical users have long enjoyed access to a variety of powerful meshing tools inside of ANSYS to generate high-quality shell, tetrahedral, and swept meshes. During the past several years, meshing in ANSYS Workbench Simulation has not only grown to encompass traditional meshing algorithms in ANSYS but has also developed many features requested by ANSYS users as well as integrated meshing technologies from ANSYS CFX and ANSYS ICEM CFD.\""
  },
  {
    "title": "Methods for Modeling Bolts in the Bolted Joint",
    "author": "Jerome Montgomery",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/methods_for_modeling_bolts.pdf",
    "description": "\"Modeling bolts for three-dimensional finite element applications have, and still continue to raise questions. The limitations on model size sometimes make modeling of solid bolts impractical. Therefore, many analysts choose other methods to model bolts. Line elements with coupled nodes and line elements with spider beams are a couple of alternative approaches. This paper looks at a few methods for modeling pretension bolted joints using the finite element method (ANSYS 5.7). Pretension is modeled using ANSYS pretension elements (PRETS179) which can be used on solid or line element types. Surface-to-surface contact elements are used to account for varying contact distribution along flanges. Bolt head and nut behavior is modeled by, coupled nodes, beam elements, rigid body elements (RBE3), or solids. Bolt stud is modeled by solid elements, beam elements, pipe elements, or link elements. The choice of line elements versus solid elements is determined by the degree of complexity sought. The pros and cons of different simulations are also discussed.\""
  },
  {
    "title": "Micromachined Piezoelectric Ultrasonic Transducers Based On Parylene Diaphragm In Silicon Substrate",
    "author": "Cheol-Hyun Han and Eun Sok Kim",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ultrasonic2000.pdf",
    "description": "\"This paper describes the techniques used in fabricating the transducers, their performance characteristics, and finite element analyses (FEA) with ANSYS 5.6. With ANSYS, we have calculated the stress and strain (under a static pressure load) and the dynamic mode shapes over a certain frequency range. Also, with appropriate piezoelectric matrices incorporated into the ANSYS batch model, a piezoelectric coupled-field analysis has been performed.\" (MEMS)"
  },
  {
    "title": "Microsystem Design Using Simulator Coupling",
    "author": "S. Wünsche, C. Clauß, P. Schwarz, F. Winkler",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/spice2.pdf",
    "description": "\"A methodology for simulating the performance of complex microsystems using simulator coupling is presented. The technique is based on the coupling of the FEM program ANSYS with the circuit and system simulator SABER.\""
  },
  {
    "title": "Modal Cyclic Symmetry Enhancements at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI12_Cyclic_Symmetry_at_6.0.pdf",
    "description": "\"At ANSYS 6.0, the modal cyclic symmetry procedure has been significantly improved. New commands, CYCLIC and CYCOPT, replace the older CYCGEN and CYCSOL macros and provide more flexibility and ease-of-use.\""
  },
  {
    "title": "Modeling Approach for CVD-Diamond-based Mechanical Structures [PDF]",
    "author": "P. Schmid, M. Adamschik, S. Ertl, P. Gluche, and E. Kohn",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/MSM99_ULM_cvd.pdf",
    "description": "Analysis of diamond-based MEMS devices (instead of silicon) with ANSYS."
  },
  {
    "title": "Modeling Diesel Engine Cylinder Head Gaskets using the Gasket Material Option of the SOLID185 Element",
    "author": "Jonathan Raub",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/modeling_disel_engine_cylinder_gaskets.pdf",
    "description": "\"The modeling of diesel engine cylinder head gasket joints is complicated by the nonlinear response of the head gasket’s materials. Linearization of these material responses can lead to significant errors in the solution’s results. The 1-dimensional nonlinear approximation made by the Gasket material option of the SOLID185 element sufficiently captures the response of the nonlinear gasket materials while maintaining practical solution times for the large model sizes associated with multi-cylinder head gasket joint models. This paper will give an overview of the model building and assembly process used to create a head gasket joint model, describe the nonlinear nature of the materials used in the model, and present comparisons of the model’s results with experimental measurements.\"\n\n[STI: There is a gasket-specific material & element in 6.1, not available at the time of the writing]"
  },
  {
    "title": "Modeling MEMS Resonant Devices Over a Broad Temperature Range [PDF]",
    "author": "Russell DeAnna, Shuvo Roy, Christian A. Zorman, Mehran Mehregany",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/memsissue2.pdf",
    "description": "(from ANSYS Solutions magazine, volume 1, #2) (MEMS)"
  },
  {
    "title": "Modeling Of Aluminum Reduction Cells Using Finite Element Analysis Techniques",
    "author": "Imad Tabsh, Marc Dupuis",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/tms95.pdf",
    "description": "\"This paper summarizes the authors' experience in using FEA to model Hall-Héroult reduction cells. FEA capabilities necessary to adequately simulate thermo-electric, electro-magnetic and stress fields within the cell are identified.\" (Used ANSYS 4.4A and 5.0)\nAvailable is an older, related paper on Thermo-Electric Coupled Field Analysis of Aluminum Reduction Cells Using the ANSYS Parametric Design Language."
  },
  {
    "title": "Modeling Viscous Behavior [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/STI0604_Viscous_Behavior.zip",
    "description": "\"Amorphous solids or solids at elevated temperatures may exhibit viscous behavior. It may be difficult for some users to determine how best to model such behavior. This memo hopes to describe some available options in ANSYS and to differentiate between viscoelastic and viscoplastic constitutive models.\""
  },
  {
    "title": "Modeling an Electrostatically Actuated MEMS Diaphragm Pump",
    "author": "James Nabity",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/FSI.projects.Nabity.paper.pdf",
    "description": "The recent advent of microelectromechanical systems (MEMS) or micro-devices has generated excitement in many diverse fields. In the area of micro-fluidics liquid pumps are highly desirable for fluid transport and atomization.  A recent and popular example of this is the inkjet, which self-aspirates ink from a reservoir and then transports it to a chamber for expulsion as a single droplet during the printing process. Extending this technology to other potential applications requires analytical and computational tools for design. Several computational software packages are commercially available, such as CoventorWareTM, FLUENTTM, and  ANSYSTM [1-3], but each is difficult to use and to date only ANSYS has been able to solve this fully coupled multi-physics problem. Thus, simplified analytical models are attractive for preliminary design and analysis.  This paper describes a quasi one-dimensional model developed for the design and analysis of an electrostatically actuated diaphragm pump.  The attributes and assumptions of this model will be presented.  Finally, performance results obtained for a MEMS diaphragm pump will be compared to ANSYS three-dimensional time-accurate results."
  },
  {
    "title": "Modeling of the Piezoelectric Micropump for Improving the Working Parameters [PDF]",
    "author": "Oana Tatiana Nedelcu, Victor Moagar-Poladian",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/MSM99_IMT_upump.pdf",
    "description": "A piezo micropump. Used ANSYS for analysis of deflection of pump. (MEMS)"
  },
  {
    "title": "Modeling preloaded bolts [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/week12-STI43_TNT_Bolt_preload.pdf",
    "description": "Modeling preload in bolts via contact offset, thermal contraction, or the new pretension elements PRETS179.\nPRELOAD1, PRELOAD2, and PRELOAD3 input files"
  },
  {
    "title": "Modelling and Experimental Investigations on Degradation of Microcomponents in Power Cycling",
    "author": "M. Thoben, W. Staiger, J. Wilde",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/mw2000_1031.pdf",
    "description": "\"Thermomechanical damage is one of the principal failure causes of microcomponents and microsystems. Often the basic defect mechanisms are crack initiation and subsequent crack propagation in interfaces or materials. The fatigue behavior of microcomponents can in many cases be described by the Manson-Coffin-Formula. This model is well-suited for comparison of different designs relative to each other but it will fail when a realistic lifetime prognosis is expected. Therefore we worked out a concept which is based on the computation of the strain range distribution in the interconnection by finite elements simulations and subsequent calculation of the cyclic crack propagation rate. Using this method in combination with calibration measurements it is possible to predict the lifetime of electronic assemblies with significantly improved precision compared to the Low-Cycle-Fatigue approaches.\""
  },
  {
    "title": "Multi-Criteria Shape Optimization of a Funnel in Cathode Ray Tubes Using Response Surface Model",
    "author": "Tae Hee Lee, Kwangki Lee, Kwang Soon Lee",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/3rdASMO-UK-THLeeKKLee.pdf",
    "description": "\"The ultimate goal of simulation that represents the behaviour of structures is to optimize their response performances within the specific requirements and needs with respect to the design variables. The first step of the design of cathode ray tubes is to design the glass geometry, called funnel geometry, to endure the vacuum stress because it is a main structure of cathode ray tubes. In order to create 3-dimensional funnel geometry in the cathode ray tubes, higher order response surface model is used instead of NURBS (non-uniform rational B-splines) or Bezier curve because it is more robust for understanding the geometry change in finite element analysis. By combining finite element analysis, response surface model and sequential quadratic programming within the process integration framework, the shape optimization of a funnel is successfully performed and the maximum stress is reduced to almost half of the current one.\""
  },
  {
    "title": "Multiframe Restarts [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/Week_19_tip_of_week_restart.pdf",
    "description": "Memo covering the multiframe restart capability (RESCON) in ANSYS.\nAccompanying input file"
  },
  {
    "title": "Neighborhood-based Element Sizing Control for Finite Element Surface Meshing [PDF]",
    "author": "Steven Owen, and Sunil Saigal",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/neighborhood_size_control.pdf",
    "description": "\"A method is presented for controlling element sizes on the interior of areas during surface meshing. A Delaunay background mesh is defined over which a neighborhood based interpolation scheme is used to interpolate element sizes.\""
  },
  {
    "title": "Nested macros, local parameters, trailing underscores",
    "author": "Martin Herrenbruck (Technische Universität München)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Nested_macros-all-files.zip",
    "description": "\"A macro file is a file which contains Ansys commands. If you save your macro in your working directory or in the macro directory (see /PSEARCH command) you just enter the macro name in the command line and all these commands will be executed. You can even nest macros: from your main file you call e.g. zzmacro1 which again calls zzmacro2. The only problem is that a macro could change - and you would probably not notice that - the value of a parameter you are using in your main input file. This will be the case if the same parameter name is used accidentally in both the macro and your main input. Let's see how one can avoid these nasty errors - just click on the link!\""
  },
  {
    "title": "Non-Linear Elastic Properties of the Lingual and Facial Tissues Assessed by Indentation Technique: Application to the Biomechanics of Speech Production",
    "author": "J.M. Gerard, J. Ohayon, V. Luboz, P. Perrier, Y. Paya",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/MEP_2005.pdf",
    "description": "\"This paper aims at characterizing the mechanical behavior of two human anatomical structures, namely the tongue and the cheek. For this, an indentation experiment was provided, by measuring the mechanical response of tongue and cheek tissues removed from the fresh cadaver of a 74 year old woman. Non-linear relationships were observed between the force applied to the tissues and the corresponding displacements. To infer the mechanical constitutive laws from these measurements, a finite element (FE) analysis was provided. This analysis aimed at simulating the indentation experiment. An optimization process was used to determine the FE constitutive laws that provided the non-linear force/displacements observed during the indentation experiments. The tongue constitutive law was used for simulations provided by a 3D FE biomechanical model of the human tongue. This dynamical model was designed to study speech production. Given a set of tongue muscular commands, which levels correspond to the force classically measured during speech production, the FE model successfully simulated the main tongue movements observed during speech data.\"\n[ANSYS Nonlinear, version 5.7]"
  },
  {
    "title": "Non-linear Finite Element Modeling of the Titanium Briquettes Hot Extrusion Process",
    "author": "Alexey I. Borovkov, Denis V. Shevchenko",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/nonlinear_finite_element_modeling_titanium.pdf",
    "description": "\"In this paper the mathematical model is developed to perform mathematical simulation of the hot extrusion process. The model makes it possible to observe the influence of various system parameters on the extrusion process. All researches were carried out with the use of the ANSYS 5.6 RFS FE-software system. During the research the modeling and analysis of various events that can be observed (material dead zone appearing, capsule crimping, capsule damage etc.) was successfully carried out. The mathematical model was created on the basis of contact thermo-mechanics relations with physical and geometrical non-linearities.\""
  },
  {
    "title": "Nonlinear Contact Analysis Techniques Using ANSYS",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/contact_tech.pdf",
    "description": "Presentation on various aspects of 17x contact technology (part of the \"Advanced Analysis with ANSYS\" seminar during the 2002 User's Conference)."
  },
  {
    "title": "Nonlinear Mechanics of Suspension Beams for a Micromachined Gyroscope",
    "author": "W. O. Davis and A. P. Pisano",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/MSM2001_paper.pdf",
    "description": "\"We present a method for the calculation of the coefficients of cubic stiffening for tether-suspended micromachined systems. The analysis is based on a nonlinear rod theory, and enables the prediction of the maximum achievable motion amplitude prior to the onset of nonlinear behavior. The analysis is applied in detail to a microgyroscope. Comparisons with a finite element model and experimental data are used to validate the analysis, and issues pertaining to the optimal design of the gyroscope's suspension are investigated.\" (MEMS)"
  },
  {
    "title": "Nonlinear Models of Reinforced and Post-tensioned Concrete Beams",
    "author": "P. Fanning",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/20010202.pdf",
    "description": "\"Commercial finite element software generally includes dedicated numerical models for the nonlinear response of concrete under loading. These models usually include a smeared crack analogy to account for the relatively poor tensile strength of concrete, a plasticity algorithm to facilitate concrete crushing in compression regions and a method of specifying the amount, the distribution and the orientation of any internal reinforcement. The numerical model adopted by ANSYS is discussed in this paper. Appropriate numerical modelling strategies are recommended and comparisons with experimental load-deflection responses are discussed for ordinary reinforced concrete beams and post-tensioned concrete T-beams.\" (Concrete SOLID65)"
  },
  {
    "title": "Nonlinear Submodeling [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI02_Nonlinear_Submodeling.zip",
    "description": "\"Submodeling is often used to efficiently obtain solutions at local areas. Although submodeling may be commonly thought of as being applicable to linear static structural solutions, it can also be applied to nonlinear and transient analyses, as well as other disciplines. This memo hopes to cover the specific case of nonlinear static structural submodeling.\"\n(Week 14, week of 01/14/02.)"
  },
  {
    "title": "Nonlinear monitoring [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/Week_16_Nonlinear_Monitor.pdf",
    "description": "Memo covering the benefits of the jobname.mntr file and the MONITOR command in nonlinear analyses."
  },
  {
    "title": "Novel Horn Designs for Ultrasonic/Sonic Cleaning Welding, Soldering, Cutting and Drilling",
    "author": "S. Sherrit, S.A. Askins, M. Gradziol, B.P. Dolgin, X. Bao, Z. Chang, and Y. Bar-Cohen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/SPIE-02-SS-4701-34-horn.pdf",
    "description": "\"In this paper we will present a variety of novel horn designs, which overcome some of the limitations discussed above. One particular design that has been found to overcome these limitations is the folded horn. In this design the horn elements are folded which reduce the overall length of the resonator (physical length) but maintain or increase the acoustic length. In addition initial experiments indicate that the tip displacement can be further adjusted by phasing the bending displacements and the extensional displacements. The experimental results for a variety of these and other novel horn designs will be presented and compared to the results predicted by theory.\"\n[ANSYS Piezoelectric, version unknown]"
  },
  {
    "title": "Numerial Implementation of Multiaxial High-Cycle Fatigue Criterion to Structural Optimization",
    "author": "Miroslaw Mrzyglód, Andrzej P. Zielinski",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/mrzyg-ziel-3-06.pdf",
    "description": "\"Modern multiaxial high-cycle fatigue criteria were investigated with respect to their application in structural optimization procedures coupled with finite element codes. As a result of tests carried out for several fatigue criteria, the Dang Van hypothesis was used for the detailed numerical study. A way of respective adapting the high-cycle load history was also suggested. The complete algorithm of the fatigue optimization was illustrated by applying the proposed procedures to vehicle parts which are subject to high-cycle loadings. The finite element code ANSYS was used in the structural modeling.\"\n\n[ANSYS Structural, version 8.1]"
  },
  {
    "title": "Numerical And Analytical Modeling Of The Piezoelectric Transformer And Experimental Verification [PDF]",
    "author": "S. Hallaert , E. Sarraute and B. Le Pioufle",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/MSM99_LIMMS_piezo.pdf",
    "description": "Use of ANSYS for modal analysis of miniature piezo transformer. (MEMS)"
  },
  {
    "title": "Numerical Modeling for Systematization of Line Heating Process",
    "author": "Jong-Gye Shin, Won-Don Kim, and Jang-Hyun Lee",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/jhs.pdf",
    "description": "\"In this paper, we first propose a conceptual configuration for ship production system of plate forming. It is necessary to integrate lofting and plate forming activities for minimum thermal energy in line heating process. The modeling of heating torch, water cooling, and plate to be formed is proposed for the finite element analysis after the mechanics of line heating is studied. A three-dimensional 8-node solid elements of ANSYS were chosen for analysis.\"\n(Thermal-Stress)"
  },
  {
    "title": "Numerical Simulations of Flat-walled Diffuser Elements for Valveless Micropumps [PDF]",
    "author": "Anders Olsson, Goran Stemme, and Erik Stemme",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/MSM99_RITS_upump.pdf",
    "description": "Use of ANSYS/Flotran for analysis of micropump. (MEMS)"
  },
  {
    "title": "Off-Axis Loads Cause Failure of the Distal Radius at Lower Magnitudes than Axial Loads: A Finite Element Analysis",
    "author": "Karen L. Troy and Mark D. Grabiner",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/26.pdf",
    "description": "\"Distal radius fractures are among the most common fall-related injuries in older women. Numerous studies have quantified upper extremity fall biomechanics with the goal of identifying possible interventions to reduce the peak force on the wrists, thereby reducing the number of fractures. Fracture initiation depends both on the force applied to the bone and upon the strength of the bone itself; thus, poor bone quality has been implicated as a factor in distal radius fractures. Generally, an intervention to improve bone quality (such as antiresorptive therapy) is considered successful if bone mineral density (BMD) can be increased by 2-4%.\nCadaver and finite element studies have previously quantified the force required to cause a distal radius fracture. To date, however, only simple axial loads on the radius have been considered. Because most falls onto the hands result in off-axis loads, we considered the possibility that a combination of loading modes would significantly influence the fracture strength of the distal radius. Here, we used a validated finite element model of the distal radius, scaphoid, and lunate, to explore the effects of loading direction and changes in BMD on predicted fracture strength.\"\n[ANSYS Structural, version 10.0]"
  },
  {
    "title": "On Stress Analysis For a Hyperelastic Material [PDF]",
    "author": "Xiao-Yan Gong and Riyand Moe",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/Hyper.pdf",
    "description": "Paper using ANSYS 5.5 for characterizing hyperelastic materials with Mooney-Rivlin"
  },
  {
    "title": "Optimal Design of Computer Experiments for the Generation of Microsystem Macromodels Using IMSET and Non-Parametric Fitting",
    "author": "Selden B. Crary, Peter Cousseau, David Armstrong, David M. Woodcock, Olivier Dubochet, Philippe Lerc",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/M3302.pdf",
    "description": "\"We present a new and unique software program, IMSET, capable of finding optimal designs for computer experiments. A finite-element simulation of a micro-machined flow sensor was used to illustrate macromodel generation and to compare the quality of the IMSET design with other approaches.\""
  },
  {
    "title": "Optimization of a Circular Piezoelectric Bimorph for a Micropump Driver",
    "author": "Christopher J. Morris and Fred K. Forster",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/jm0323.pdf",
    "description": "\"Piezoelectric bimorph actuation has been successfully used in numerous types of microdevices, most notably micropumps. However, even for the simple case of circular geometry, analytical treatments are severely limited. This study utilized the finite-element method to optimize the deflection of a circular bimorph consisting of a single piezoelectric actuator, bonding material and elastic plate of finite dimensions. Optimum actuator dimensions were determined for given plate dimensions, actuator-to-plate stiffness ratio and bonding layer thickness.\" (PLANE13)"
  },
  {
    "title": "Optimizing Board-level Reliability of an Underfilled, Stacked Chip Scale Package",
    "author": "Zane E. Johnson, Nathan R. Schneck",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/2012-optimum_csp_underfill.pdf",
    "description": "\"Previously benchmarked finite-element (FE) models of a stacked chip scale package (CSP) are used to identify optimum underfill material properties under drop-impact and accelerated temperature cycling (ATC) stress conditions. The simulation sets indicate that an underfill having a modulus of 2–6 GPa and CTE of 25 ppm/K maximizes drop life and does no harm to ATC performance for both Sn63Pb37 and SAC305 solder joints. The methodology described can be applied to other package styles, material sets, and stress conditions.\""
  },
  {
    "title": "Optimum Design of a Ceramic Tensile Creep Specimen Using a Finite Element Method",
    "author": "Z. Wang, C. K. Chiang, and T. J. Chuang",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/cj21-wai.pdf",
    "description": "\"An optimization procedure for designing a ceramic tensile creep specimen to minimize stress concentration is carried out using a finite element method.\"\n(Optimization, Creep, Contact)"
  },
  {
    "title": "Overview of Reliability Models and Data Needs",
    "author": "Ahmer Syed",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/021501Syed.pdf",
    "description": "\"Workshop on Modeling and Data Needs for Lead-Free Solders\" (Amkor Presentation) Note that FEA pictures in presentation are ANSYS plots - Darveaux's data is based on Anand's Model (TB,ANAND), although ANSYS also allows for use of common creep laws such as hyperbolic sine and power law."
  },
  {
    "title": "PDF file summarizing beta contact features at 5.6.1 [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/contact_beta_56.pdf",
    "description": "Presentation on the thermal contact and fluid pressure capabilities of the surface-to-surface contact elements. This was written when these capabilities were beta at 5.6. Thermal capabilites are documented at 5.7.\nAccompanying thermal contact example and fluid pressure example"
  },
  {
    "title": "PDS and Nonlinear Runs [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI01_PDS_and_Nonlinear_Runs.zip",
    "description": "\"The Probabilistic Design System (PDS) of ANSYS provides a very powerful tool in understanding the effect of uncertainties in one’s design. The details of PDS are covered in the online help, so this memo will discuss the specific case of setting up serial and parallel PDS runs as well as performing nonlinear analyses with PDS.\""
  },
  {
    "title": "POW2MAT.zip",
    "author": "Carl Olsard (noiseboard.com)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/POW2MAT.zip",
    "description": "\"This is a simple program written in Turbo pascal which I find very useful for converting the output from ANSYS (prvar, prnsol, etc) into columns, while removing the headers at the start and between the page listings. The program is used at a DOS prompt and one types in: pow2mat col filein fileout , where col are the number of columns in the output, filein MUST have an extension .val and fileout WILL have an extension .txt. You do NOT type in the extensions, they are default. For example, you would type pow2mat 7 nodelist nodelist which would extract 7 columns from the file nodelist.val and write a stripped file called nodelist.txt . If you have several files to convert, you can use the DOS FOR command as follows: \n FOR %I IN (*.val) DO pow2mat 3 %~nI %~nI\""
  },
  {
    "title": "PRESSURE_MAC.zip",
    "author": "Hursha Narayan (Robert Bosch Corporation)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/PRESSURE_MAC.zip",
    "description": "\"I have written a macro that calculates the total force along the three axes from applied pressure. I find this macro to be useful just to make sure that the pressure I'm applying on a curved surface is accurate and also it gives a feel for the mesh discretization where the pressure is applied. The user has to basically identify the elements with a particular magnitude of pressure and save the list file (SFELIS.lis). The macro does everything else automatically. The downside to the macro is:\n1. Right now it only handles 10 node tet elements.\n2. The pressure has to be uniform\nThe user will have to modify some of the fields in the macro as well as the c-shell file prescalc.\""
  },
  {
    "title": "PSD Calculation Efficiency [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI03_PSD_Efficiency.pdf",
    "description": "\"A very common use of PSD analyses is to look at the response of a system under a single base excitation, such as the case with many aerospace and civil applications. The default PSD settings are very general in nature and may consequently be inefficient for such a situation. This memo hopes to outline some ways in which the user may obtain more efficient PSD solutions for the specific instance of single base excitation with relatively flat spectrum (although some techniques may be extrapolated for other cases).\"…An older doc I recently reanimated and updated…"
  },
  {
    "title": "PSD Postprocessing [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI04_PSD_Postprocessing.zip",
    "description": "\"PSD, or random vibration, analyses present some interesting challenges in postprocessing due to the nature of the assumptions related to the analysis. This memo hopes to address some of these items, including evaluation of derived stresses and calculation of response power spectral density.\"\n…An older doc I recently reanimated and updated…"
  },
  {
    "title": "PSD Postprocessing of Relative Displacement [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI0903_PSD_Postprocessing_2.zip",
    "description": "\"PSD users may wish to determine the relative 1-sigma results between two points. This memo covers three methods to perform this operation, in hopes that it will give users more familiarity with PSD postprocessing in ANSYS.\""
  },
  {
    "title": "PZT Actuated Micromirror For Nano-Tracking Of Laser Beam For High-Density Optical Data Storage [PDF]",
    "author": "Youngjoo Yee, Hyo-Jin Nam, See-Hyung Lee, Jong Uk Bu, Young-Sam Jeon, and Seong-Moon Cho",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/IEEE00_LGC_umirror.pdf",
    "description": "A piezo-actuated micromirror. Used ANSYS for stress and modal analysis of mirror. (MEMS)"
  },
  {
    "title": "Parameter Studies For Enhanced Integrity Of Reciprocating Compressor Foundation Blocks",
    "author": "Jayant S. Mandke, Anthony J. Smalley",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ta_94-1.pdf",
    "description": "\"The model development and analyses of reinforced concrete block used the ANSYS finite element program.\""
  },
  {
    "title": "Parametric Studies in ANSYS [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/week26-parametric_studies.pdf",
    "description": "Automated parametric studies in ANSYS (generating and using parametric input files)."
  },
  {
    "title": "Patient Specific Spine Models - Development Of A Laboratory Intervertebral Disc For Validation Of The Models",
    "author": "A. Mohsen, D. J. Siddall, P. Gillespie, S. Julian and M. J. Fagan ",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/a020.pdf",
    "description": "\"This research project is aimed at evaluating the feasibility of the modelling technique through the development of an artificial validation spine. The validation spine will be tested under controlled laboratory conditions and the results used to verify those found from analysis of the computer model. The intervertebral disc is the most critical component in the spine. Thus, the initial aim of this research was to develop a representative artificial disc. Concurrent development of a finite element model of the disc permits development theories to be analysed and laboratory results to be verified.\""
  },
  {
    "title": "Physics first, using ANSYS to define the design: Real-life examples from the automotive supplier company Mannesmann VDO",
    "author": "Zlatko Penzar",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/end02111b_pdf.pdf",
    "description": "\"In many non-standard engineering development applications it strongly pays off to invest an effort into understanding the physics of the problem prior to undertaking complex numerical simulations. The better the knowledge of the leading physical effects in a complex system, the simpler and more cost-efficient the analytical model can be. Moreover, the understanding of the most important physical driving effects often enables one to build a simplified, closed-form mathematical effective model. Such models usually give insight into the interplay of various parameters governing the physical behavior of the complex system. In this way, a fast pre-optimization of the desired features is often possible. Subsequently, the rich arsenal of ANSYS multiphysics capabilities can be used to refine the judgements and obtain the desired quantitative solutions.\""
  },
  {
    "title": "Plastic Deformation and Loss of Joint Force by Creep in High Current Joints",
    "author": "Josef Kindersberger, Helmut Löbl, Stephan Schoft",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/13_4.pdf",
    "description": "\"The mechanical stress distribution in aluminum busbar joints is calculated using the Finite Element Method. Based on the physical fundamentals of creep in aluminum the reduction of the joint force by creep depending on the temperature of the joints as well as on the initial joint force and on the washer is simulated.\" (Creep)"
  },
  {
    "title": "Plasticity Hardening Rules [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI11_Plasticity_Hardening_Rules.zip",
    "description": "\"ANSYS has a wide range of constitutive models and element technology available to the user. In this memo, the basics of isotropic and kinematic hardening for plasticity will be discussed, specifically related to proportional/non-proportional, monotonic/cyclic loading, and finite strain applications.\""
  },
  {
    "title": "Plotting Entities and Graphs in Multiple Windows [PDF]",
    "author": "David Haberman (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/Week_18_multi-plot.pdf",
    "description": "ANSYS 5.4 through 5.6 allow users to plot multiple entities (keypoints, lines, areas, volumes, nodes, and elements) in a given window. Prior to ANSYS 5.4, a user was required to plot entities on top of one another, like transparencies. Furthermore, multi-plotting also allows a user to generate graphs. The following memo discusses how the ANSYS multi-plotting feature works."
  },
  {
    "title": "Post Refinement Element Shape Improvement for Quadrilaterial Meshes [PDF]",
    "author": "Matthew L. Staten and Scott A. Canann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/post_refinement_quad.pdf",
    "description": "\"This paper presents techniques for improving the quality of quadrilateral meshes after Schneiders' refinement. Improvement techniques use topology and node valence optimization rather than shape metrics. Hence, improvement is computationally inexpensive.\""
  },
  {
    "title": "Postprocessing Harmonic Results [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI03_Harmonic_Postprocessing.zip",
    "description": "\"In harmonic analyses, due to the fact that results may not be in phase, postprocessing quantities of interest can pose a challenge. Users may need to review non-sinusoidal results, such as equivalent stresses, at different locations, so accounting for phase information may be required.\n    This memo hopes to cover some of the more important points regarding postprocessing structural harmonic analysis results in both the General and Time-History Postprocessors.\""
  },
  {
    "title": "Predicting Human Thermal Comfort in a Transient Nonuniform Thermal Environment",
    "author": "J.P. Rugh, R.B. Farrington, D. Bharathan, A. Vlahinos, R. Burke, C. Huizenga, and H. Zhang",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/thermal_comfort.pdf",
    "description": "\"The National Renewable Energy Laboratory (NREL) has developed a suite of thermal comfort tools to assist in the development of smaller and more efficient climate control systems in automobiles. These tools, which include a 126-segment sweating manikin, a finite element physiological model of the human body, and a psychological model based on human subject testing, are designed to predict human thermal comfort in transient nonuniform thermal environments such as automobiles. The manikin measures the heat loss from the human body in the vehicle environment and sends the heat flux from each segment to the physiological model. The physiological model predicts the body’s response to the environment, determines 126 segment skin temperatures, sweat rates, and breathing rate, and transmits the data to the manikin. The psychological model uses temperature data from the physiological model to predict the local and global thermal comfort as a function of local skin and core temperatures and their rates of change. Results of initial integration testing show the thermal response of a manikin segment to transient environmental conditions.\"\n\n[ANSYS Thermal, version unknown]"
  },
  {
    "title": "Pressure Load Macro [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI05_Pressure_Loading.zip",
    "description": "\"In ANSYS, pressure loading via the SFx family of commands allows users to apply a force per unit area in a direction normal to the surface. Structural surface effect elements SURF153 and SURF154 extend pressure loading capabilities by allowing users to specify normal, tangential, or arbitrary distributed loading. In fact, for an arbitrary ‘distributed loading vector,’ the full or projected area may be used, with or without the tangential component of load. This type of loading can be useful in mimicking a bearing load (include tangential component) or wind loading (no tangential component), to name a couple of examples.\n\"Because of the fact that the vector-type of pressure loading can be based on full or projected area, with or without the tangential component, trying to determine an appropriate value for the loading can be cumbersome. The author has written a simple macro which can be used as an example in utilizing surface effects more effectively by allowing the user to specify the total force instead of pressure – the macro calculates the appropriate pressure value to be applied on the surface effect elements.\"\n(Week 27, week of 07/04/04.)"
  },
  {
    "title": "Pressure Mapping Example",
    "author": "Bob Weathers (Trane)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/PressureMappingExample.zip",
    "description": "An example which demonstrates mapping between dissimilar meshes and element types.\n\nAt the bottom of the macro is an example of how to apply the mapped results from the first model onto the second using a TABLe. The TABLe uses the second model's node numbers (sorted and stored in ascending order) to index into the TABLe. This results in a very efficient way to map boundary conditions that's fast and uses minimum memory."
  },
  {
    "title": "Preventing Rigid-Body Motion in Contact Problems [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI02_Rigid_Body_Contact.zip",
    "description": "\"In contact problems run in a static manner, controlling rigid-body motion may sometimes be an issue under the following circumstances: (a) force-controlled systems or (b) multiple bodies with some parts unconstrained.\"\n\n\"This memo hopes to address some ways of controlling rigid-body motion in contact problems through the use of options available with the surface-to-surface contact elements.\""
  },
  {
    "title": "Principles of Simulating Contact Between Parts using ANSYS",
    "author": "David H. Johnson",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/principles_of_simulating_contact_between.pdf",
    "description": "\"The ANSYS finite element analysis (FEA) program offers a variety of elements designed to treat cases of changing mechanical contact between the parts of an assembly or between different faces of a single part. These elements range from simple, limited idealizations to complex and sophisticated, general purpose algorithms. FEA analysts are frequently faced with modeling situations where changing contact cannot be assumed negligible and ignored. Finding the best choices for contact elements, element options, solver, and solution options can drastically improve the model’s performance and reduce the analyst’s frustration with a contact simulation model.\""
  },
  {
    "title": "Probabilistic Design System (PDS): A Realistic Approach of Finite Element Modelling for Capacitive Micro-machined Ultrasonic Transducers (cMUTS)",
    "author": "Vamshi Kommareddy, Manoj Kumar, Ying Fan, James Barshinger",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/Tu.4.7.4.pdf",
    "description": "\"This paper represents a realistic approach for modeling a cMUT device. CMUTs have become very popular over the last decade because of the comparable bandwidth, sensitivity and dynamic range with its piezoelectric counterparts. The ease of fabrication is an added advantage. Modeling of CMUT is a coupled physics problem, which involves solving Electrostatics-Structural-Fluid interactions simultaneous. Finite Element models of the CMUT are constructed using the commercial code ANSYS (10.0). In the standard approach of modeling, from existing literature assumes deterministic values for design parameters, however fabrication of the device introduces some amount of variation in the design parameters. In this paper, the PDS FEM approach is discussed to account for the variability in fabrication. The results from the PDS approach on the performance characteristics like resonance frequency; collapse voltage and electromechanical coupling coefficient will be discussed.\"\n[ANSYS PDS, version 10.0]"
  },
  {
    "title": "QR Damped Modal Analysis [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/week_29_STI68_TNT_Damped_Modal.pdf",
    "description": "Presentation on different damped eigenvalue extraction methods in ANSYS, focusing on the newer QR Damped method.\nInput files in zip format"
  },
  {
    "title": "QR Damped and Unsymmetric Stiffness [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI02_QR_Damped_Unsymmetric.zip",
    "description": "\"There have been significant enhancements to the QR Damped eigenvalue extraction method in the past several releases of ANSYS. At 8.0, the capability of including unsymmetric damping [C] matrix was introduced, along with support of damping defined via the DMPRAT and MDAMP commands.\nANSYS 8.1, the material-based constant damping ratio MP,DMPR allowed users to specify constant damping ratios per material ID in mode-superposition harmonic analyses, when used with the QRDAMP eigensolver. With the release of 9.0, QRDAMP also supports unsymmetric stiffness [K] matrix, output of complex eigenvectors, and the use of the PSOLVE command. This memo hopes to cover the use of QR Damped eigenvalue extraction method in friction problems, where an unsymmetric stiffness [K] matrix may be present. An example of this type of problem is brake squeal analyses, where the combination of ANSYS 17x contact elements and the QRDAMP eigensolver provide an easy-to-use, efficient means of determining unstable modes.\""
  },
  {
    "title": "Quality Based Design and Design for Reliability of MEMS Using Probabilistic Methods [PDF]",
    "author": "Stefan Reh, Paul Lethbridge, Dale Ostergaard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/MSM00_ANSYS_pds.pdf",
    "description": "Presented at MSM 2000. (MEMS)"
  },
  {
    "title": "Quality Based Design from Probabilistic Methods [PDF]",
    "author": "Stefan Reh, Paul Lethbridge, Dale Ostergaard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/memsissue4.pdf",
    "description": "(from ANSYS Solutions magazine, volume 2, #2) (MEMS)"
  },
  {
    "title": "Radiation article in ANSYS Solutions Magazine [PDF]",
    "author": "Dave Looman (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/radiation.pdf",
    "description": "Overview of ANSYS's radiation capabilities, including a discussion on the radiosity solution method."
  },
  {
    "title": "Radiosity Solver [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI65_TNT_Radiosity_Solver.pdf",
    "description": "Information on radiation capabilities of ANSYS, focusing on the radiosity solution method.\nAccompanying input files 1, 2, 3 and 4"
  },
  {
    "title": "Random Vibration Analysis of a Circuit Board [PDF]",
    "author": "Sean Harvey (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/week23-random_vibrations_tow.pdf",
    "description": "Example of random vibration analysis of a circuit board in ANSYS.\nInput files in zip format"
  },
  {
    "title": "Reduced Order Modeling of Fluid Structural Interactions in MEMS Based on Modal Projection Techniques",
    "author": "Jan Mehner, Wolfram Doetzel, Bernd Schauwecker, Dale Ostergaard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/transducers-paper_3.pdf",
    "description": "This paper provides useful background information on the modal projection technique available in ANSYS with FLUID136 elements (RMFLVEC, DMPRAT, and ABEXTRACT macros). Although the ROM140 element has not been officially released (it is undocumented), this paper introduces that element as well."
  },
  {
    "title": "Review of Anisotropy, Yield Criteria, Failure Criteria [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI03_Yield_and_Failure.pdf",
    "description": "\"This memo hopes to serve as a review of the basics of anisotropy, yield criteria, failure criteria, and the ANSYS procedure related to these topics.\"\n(Week 15, week of 01/21/02.)"
  },
  {
    "title": "STI0904_USERFC.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI0904_USERFC.zip",
    "description": "\"The FC command provides users with the ability to predict first-ply failure using maximum strain, maximum stress, or Tsai-wu failure criteria. In ANSYS 12.0.1, users can also take advantage of the userfc subroutine to define up to nine different criteria.\nThis memo reviews the userfc subroutine, and a sample implementation of the Hashin criterion is included.\""
  },
  {
    "title": "Semiconductor Package Simulations: Assembly, Test, and Reliability [PDF]",
    "author": "Steven Groothuis",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/groothuis.pdf",
    "description": "This is a presentation which demonstrates various types of analyses ANSYS can perform which are applicable to the semiconductor industry."
  },
  {
    "title": "Shape Memory Alloy",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/Shape_Memory_Alloy.pdf",
    "description": "Short PDF describing differences between the superelastic and shape memory effect options for Shape Memory Alloy (SMA) material model. Simple input file can be downloaded here."
  },
  {
    "title": "Simple APDL Implementation of a 3D FEM Simulator for Mutual Capacitances of Arbitrarily Shaped Objects Like Interconnects [PDF]",
    "author": "Andreas Hieke",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/t2107.pdf",
    "description": "Alternative download link here or here\nSee other publication by A. Hieke. I can't recall if this or the above article is referenced in ANSYS 5.6 Theory Manual. A variant article \"Tiny Devices, Big Problems: Computation of Capacitance in Microelectric Structures\" was published in the ANSYS Solutions magazine Vol 2 No 3."
  },
  {
    "title": "Simulation of Bellcore Testing of Electronics Cabinets for the Telecommunications Industry [PDF]",
    "author": "Chris Andersen",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/andersen.pdf",
    "description": "Various Bellcore tests performed with ANSYS."
  },
  {
    "title": "Simulation of Brake Block Induced Corrugation on Railway Wheels",
    "author": "Ulf Sellgren",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/app_h.pdf",
    "description": "\"Railway wheels that are equipped with cast-iron brake blocks generate significantly more rolling noise than wheels with other types of braking devices or block materials. The roughness of the treads on cast-iron block-braked wheels has typically a peak at a wavelength around 6 cm. The complex interaction between quasi-static and dynamic mechanical behavior and thermal, chemical, and metallurgical effects in the block-wheel contact combined with the rolling and sliding situation in the wheel-rail contact has made it difficult to get an understanding of the causes from field measurements. Coupled transient thermal and quasi-static mechanical FE simulations with ANSYS show that thermoelastic instability (TEI) may be a major cause for the roughness initiation.\""
  },
  {
    "title": "Simulation of the Retroglossal Fluid-Structure Interaction During Obstructive Sleep Apnea",
    "author": "Franz Chouly, Annemie Van Hirtum, Pierre-Yves Lagr´ee, Jean-Roch Paoli, Xavier Pelorson, and Yohan P",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/FranzChouly_LN2006.pdf",
    "description": "\"A method for computing the interaction between the airflow and the soft tissue during an Obstructive Apnea is presented. It is based on simplifications of the full continuum formulation (Navier- Stokes and finite elasticity) to ensure computation time compatible with clinical applications. Linear elasticity combined with a precomputation method allows fast prediction of the tissue deformation, while an asymptotic formulation of the full Navier-Stokes equations (Reduced Navier- Stokes/Prandtl equations) has been chosen for the flow. The accuracy of the method has already been assessed experimentally. Then, simulations of the complete collapsus at the retroglossal level in the upper airway have been carried out, on geometries extracted from pre-operative radiographies of two apneic patients. Post-operative geometries have been also used to check qualitatively if the predictions from the simulations are in agreement with the effects of the surgery.\"\n[ANSYS Structural, version unspecified]"
  },
  {
    "title": "Sine sweep simulation [PDF]",
    "author": "David Haberman (CSI",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/week6-compar-lm-dd3.pdf",
    "description": "Discussion on harmonic sweeps, either via the direct displacement method or the large mass method.\nDirect displacement method example input file and Large mass method example input file"
  },
  {
    "title": "Smartsizing: Automatic Boundary Sizing for 2D and 3D meshes [PDF]",
    "author": "Alexandre L. Cunha, Sunil Saigal, Scott A. Canann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/auto_boundary_sizing.pdf",
    "description": "\"We present in this paper a simple technique, called smart sizing, which automatically computes high quality initial element sizing on curves for triangular, quadrilateral and tetrahedral elements.\""
  },
  {
    "title": "Space-Time Finite Element Approximation and Numerical Solution of Hereditary Linear Viscoelasticity Problems",
    "author": "J. Orlik, A. Ostrovska",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/bericht92.pdf",
    "description": "\"In this paper we suggest a fast numerical approach to treat problems of the hereditary linear viscoelasticity, which results in the system of elliptic partial differential equations in space variables , who’s coefficients are Volterra integral operators of the second kind in time. We propose to approximate the relaxation kernels by the product of purely time- and space-dependent terms, which is achieved by their piecewisepolynomial space-interpolation. A priori error estimate was obtained and it was shown, that such approximation does not decrease the convergence order, when an interpolation polynomial is chosen of the same order as the shape functions for the spatial finite element approximation, while the computational effort is significantly reduced.\"\n[ANSYS Nonlinear, version unknown]"
  },
  {
    "title": "Sparse Solver Improvements [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI04_Sparse_Solver.pdf",
    "description": "\"There have been various sparse solver improvements in each release of ANSYS. This memo hopes to cover some general information on the solvers available in ANSYS as well as performance improvements between ANSYS 5.6 and 6.0 related to linear static analyses.\""
  },
  {
    "title": "Spatially-Varying Pressure Loading in Workbench Simulation [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI0702_External_Pressure_Loading_WB_Simulation.zip",
    "description": "\"Workbench Simulation 11.0 allows users not only to apply constant pressure loads or force vectors per unit area but also to utilize hydrostatic pressure loads and line pressure loads (force per unit length), and these can be defined as a function of time. Moreover, fluid pressures can be mapped from a steady-state or transient ANSYS CFX solution.\nDespite these options, there may be situations where a user may want to import a predefined, spatially-varying pressure field from an external text file. This can be accomplished through the use of a “Commands” object and APDL tables, which this memo will introduce.\"\n(Week 38, week of 07/01/07.) "
  },
  {
    "title": "Structural Beam Elements Overview [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI69_TNT_Beam_Elements.zip",
    "description": "An overview of beam elements available in ANSYS, including the new BEAM188/189 elements and differences between thin and thick beams."
  },
  {
    "title": "Structural Shell Elements Overview [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/Week_8_Structural_Shell_Elements.pdf",
    "description": "Overview of structural shell elements in ANSYS, including differences between thin and thick shells, drilling DOF, etc."
  },
  {
    "title": "Structural Surface Effect Elements Intro [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/week5_Surface_Effect_Elements.pdf",
    "description": "Introduction to structural surface effect elements (SURF153/154).\nBOLTLOAD input file"
  },
  {
    "title": "Structural and Thermal Analysis of a MEMS Angular Gyroscope",
    "author": "Chris C. Painter and Andrei M. Shkel",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/cpainter_SPIE.pdf",
    "description": "\"This paper describes the structural and thermal modeling of a Micro Electro Mechanical System (MEMS) z-axis angular gyroscope. The gyroscope consists of a oscillating proof mass supported by a suspension made up of six concentric interconnected rings rigidly attached to an anchored frame. The device is capable of measuring angular displacement through precession of the proof mass line of oscillation in the presence of rotation induced Coriolis force. Using a strain energy method,a closed form solution for the effective stiffness of the suspension system is developed, which is confirmed using finite element modeling. A comparative study of the suspension with a commonly used serpentine spring suspension demonstrates that the studied device is robust to thermal fluctuations and residual stresses. A parametric analysis is used to identify an appropriate micromachining technology suitable for the fabrication of the angular gyroscope.\""
  },
  {
    "title": "Structural surface Effect Elements, General Overview",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/surfeff_final2.zip",
    "description": "An overview presentation and example workshop on structural surface effect elements. This is an old presentation I did at ANSYS 5.6.1, so if you use later versions of ANSYS, some of the menus and dialog boxes may have changed."
  },
  {
    "title": "Subject Specific Finite Element Modelling of the Levator Ani",
    "author": "Su-Lin Lee1, Ara Darzi, Guang-Zhong Yang",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/finite-element-levator.pdf",
    "description": "\"Understanding of the dynamic behaviour of the levator ani is important to the assessment of pelvic floor dysfunction. Whilst shape modelling allows the depiction of 3D morphological variation of the levator ani between different patient groups, it is insufficient to determine the underlying behaviour of how the muscle deforms during contraction and strain. The purpose of this study is to perform a subject specific finite element analysis of the levator ani with open access magnetic resonance imaging. The method is based on a Mooney-Rivlin hyperelastic model and permits dynamic study of subjects under natural physiological loadings. The value of the proposed modelling framework is demonstrated with dynamic 3D data from nulliparous, female subjects\"[ANSYS Nonlinear, version unspecified]"
  },
  {
    "title": "Super Elastic Alloy Eyeglass Frame Design Using the ANSYS Workbench Environment",
    "author": "Peter R. Barrett and Patrick Cunningham (CAEAI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ansysconf_paper_2004_CAEA.pdf",
    "description": "\"Up front analysis at the concept stages of developing a device most often result in reduced time to market and a better more efficient product development cycle. Design Modeler (1) / DesignXplorer (2) and ANSYS Structural’s super-elastic material model (3) are used in this demonstration of a design process for an eyeglass frame. This example provides an illustration of using the parametric functionality of the ANSYS Workbench environment for a highly nonlinear application. The Workbench environment can be used to perform design iterations in conjunction with material laws only available in the standard ANSYS environment. A shape memory superelastic material law was formally included in ANSYS 8.0. The material law captures the super-elastic behavior of Nitinol (4) along with its unique hysteretic response under cyclic loading. In the demonstration, the eyeglass frame is subjected to crushing and cyclic loading events. Geometric design variables are varied in an attempt to increase the frame stiffness yet keep the peak strain levels in the frame below 10% strain, which is a typical elastic limit for Nitinol. The cyclic behavior of the material is also monitored under the design load to evaluate the potential of fatigue failure. The procedure demonstrates the ease in interfacing the suite of Workbench products with geometric, material and contact nonlinear analysis problems.\""
  },
  {
    "title": "Surface Effect Elements, General Overview",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/surfeff_final1.zip",
    "description": "An overview presentation and example workshop on generating surface effect elements. This is an old presentation I did at ANSYS 5.6.1, so if you use later versions of ANSYS, some of the menus and dialog boxes may have changed."
  },
  {
    "title": "Tabular Boundary Conditions and Function Editor at 6.0 [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI09_ANSYS_6.0_Function_Editor.pdf",
    "description": "\"This tips and tricks is an introductory memo on the use of tabular and function boundary conditions. The use of the Function Editor is also discussed.\""
  },
  {
    "title": "Techniques for Successfully Using ANSYS Contact Elements",
    "author": "Rich Bothmann",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/051805_maug_contact_presentation.pdf",
    "description": "Presentation from the Midwest ANSYS User Group\n[ANSYS Nonlinear, version 9.0]"
  },
  {
    "title": "Text and compression utilities [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/week10-Text_Compression_Utilities.pdf",
    "description": "Memo on text editors which support syntax highlighting, useful in editing input files and/or macros. Also discusses compression utilities to reduce filesize of database and results files. (Also see \"bzip2\"compression utility, not discussed in memo)"
  },
  {
    "title": "The Building Blocks of Simulation: A New Family of Elements for Stress Analysis",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/elements-18x.pdf",
    "description": "Presentation on 18x family of elements (part of the \"Advanced Analysis with ANSYS\"seminar during the 2002 User's Conference)."
  },
  {
    "title": "The Comparison of Biomechanical Breast Models: Initial Results",
    "author": "C. Tanner, J.A. Schnabel, A. Castellano Smith, L.I. Sonoda, D.L.G. Hill, D.J. Hawkes, A. Degenhard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/comparison_of_biomechanical_breast_models.pdf",
    "description": "\"We present initial results from evaluating the accuracy with which biomechanical breast models based on finite element methods can predict the displacements of tissue within the breast. We investigate the influence of different tissue elasticity values, Poisson’s ratios, boundary conditions, finite element solvers and mesh resolutions on one data set. MR images were acquired before and after compressing a volunteer’s breast gently. These images were aligned using a 3D non-rigid registration algorithm. The boundary conditions (surface displacements) were derived from the result of the non-rigid registration or by assuming no patient motion at the posterior or medial side. Three linear and two non-linear elastic material models were tested.\""
  },
  {
    "title": "The Control Of The Thermal Environment Of Perimeter Spaces In Buildings To Prevent Cold Drafts",
    "author": "Yuji Hukushima, Yasuo Utsumi, Hiroshi Kobayashi, Yoshimi Ishikawa, Mitsuo Suzuki, And Tatsuya Yamash",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/PA-27.pdf",
    "description": "\"This paper is focused on the evaluation of simulation system using the experiment result and the configuration of pericounter which is the part of counter unit setting at bottom of window side with heat panel to avoid the influence of cold draft, utilizing simulation system. The simulation shows similar flow pattern to full scale experiment and consequent simulations indicate that cold draft does not flow into interior zone when the heat generation rate exceeds heat loss from the window in most cases. When the heat generation portion is 75% of heat loss from the window, some cases which have certain configuration of pericounter successfully avoids the influence of draft without fan.\""
  },
  {
    "title": "The Thermo-Mechanical Stress Issues in a Thermally Enhanced QFP",
    "author": "Jack G. Hwang, T. J. Huang, and J. J. Lee",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/1998imaps_taiwan.pdf",
    "description": "\"A finite element model with multiple load steps for different processes is used to predict the stresses in die in a thermally enhanced QFP (HQFP).\""
  },
  {
    "title": "Thermal Finite Elements Analysis of the BaBar Silicon Vertex Tracker",
    "author": "D. Barni, D. Giugni, F. Lanni, F. Palombo",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/BaBar295.pdf",
    "description": "\"In this note we present nite elements calculations of the thermal behavior of the BaBar silicon vertex tracker. Layers 1-2, 3 and 5 have been studied. Results show the adequacy of the cooling system in keeping the front-end chips into their optimal working condition. Thermo-mechanical results of layers 1-2 are also presented.\""
  },
  {
    "title": "Thermal Modeling of the Infrared Reflow Process for Solder Ball Connect (SBC)",
    "author": "H.V. Mahaney",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/ibmrd3705E.pdf",
    "description": "\"A thermal model of the infrared reflow process has been developed for an FR-4 card populated with an array of Solder Ball Connect (SBC) modules. The analysis of the three-dimensional, transient, finite element model accounts for radiative exchange within the infrared oven and for the heat conduction (nonisotropic) within the modules and card. Transient temperature profiles of selected points and three-dimensional temperature distributions at selected times are presented to describe the primary heat-transport mechanisms. Numerical predictions and empirical data indicate that the SBC modules are relatively isothermal throughout the infrared reflow process. Therefore, every solder ball within the array exhibits a nearly identical thermal profile. This result is fortunate, since the inner solder ball connections cannot be visually inspected. The influence of module spacing and the ability to improve the reflow process by use of a high-emissivity cap coating are demonstrated.\""
  },
  {
    "title": "Thermal Stress Analysis of Numi Baffle",
    "author": "Bob Wands",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/numib695.pdf",
    "description": "(Thermal-stress analysis)"
  },
  {
    "title": "Thermal Surface Effect Elements Intro [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/Week_11_Surface_Effect_Elements_Thermal.pdf",
    "description": "Introduction to thermal surface effect elements (SURF151/152)."
  },
  {
    "title": "Thermal contact overview [PDF]",
    "author": "Yongyi Zhu (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/tcontact.pdf",
    "description": "Presentation on the thermal contact capabilities of the surface-to-surface contact elements, beta at 5.6.\nInput file for pressure-dependent thermal conductance"
  },
  {
    "title": "Thermal surface Effect Elements, General Overview",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/surfeff_final3.zip",
    "description": "An overview presentation and example workshop on thermal surface effect elements. This is an old presentation I did at ANSYS 5.6.1, so if you use later versions of ANSYS, some of the menus and dialog boxes may have changed."
  },
  {
    "title": "Thermomechanical Fatigue Failure of Interfaces in Lead-Free Solders",
    "author": "M¨uge Erinc (Eindhoven University of Technology)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/200711956.pdf",
    "description": "\"The European Union Waste Electrical and Electronic Equipment Directive (WEEE) and Restriction of Hazardous Substances Directive (RoHS) banned lead from electronic systems from July 1, 2006 onwards, which has led to much interest in leadfree solders in the past years. Among several lead-free solder alternatives, SnAgCu is a widely accepted replacement due to its better creep-fatigue resistance and microstructural stability. SnAgCu has been extensively studied in the past decade, however, there are still issues to be resolved concerning solder reliability, the underlying mechanisms of thermo-mechanical fatigue failure, fatigue life predictions and the overall effect of decreasing component size, driven by the ongoing miniaturization trend. This thesis aims to scientifically contribute to this subject by a coupled experimental-numerical approach.\""
  },
  {
    "title": "Time-Dependent Material Modeling for Finite Element Analyses of Flip Chips",
    "author": "Frank Feustel, Steffen Wiese, Ekkehard Meusel",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/51ectc_outstanding_poster.pdf",
    "description": "\"Finite element analyses (FEA) have established as effective method for reliability assessment of flip chip assemblies. The simulation results are significantly dependent on the selected material models. Regarding flip chip assemblies, this statement mainly applies to the tin lead solder of the flip chip joints and the encapsulant – the so-called underfill.\nComprehensive material data of eutectic solder were determined on real flip chip joints by TU Dresden. Based on these data three modeling approaches were evaluated (target platform was the FEA code ANSYS): viscoplasticity (Anand's model), power law creep (with 2 terms) + plasticity, and sinh law creep + plasticity (as user defined model in ANSYS).\""
  },
  {
    "title": "Tooling up for Micro Electro Mechanical Systems [PDF]",
    "author": "Dale Ostergaard",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/memsissue3.pdf",
    "description": "(from ANSYS Solutions magazine, volume 2, #1) (MEMS)"
  },
  {
    "title": "Topology Optimization in ANSYS",
    "author": "Brian King (IMPACT Engineering Solutions, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/051805_maug_topology_optimization_presentation.pdf",
    "description": "Presentation from Midwest ANSYS User Group on Topological Optimization capability in ANSYS and Workbench Simulation."
  },
  {
    "title": "Towards Automated Determination of USERMAT for the Nonlinear Constitutive Behavior of Composites",
    "author": "J. Michopoulos, P. Mast, R. Badaliance, L. Gause, T. Chwastyk, R. Foerch",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/towards_automated_determination.pdf",
    "description": "\"Recent advances in finite element techniques and design optimization integration technologies along with the parallel hardware and software evolution have directed the CMS group to turn its attention to utilizing \"of the shelf\"technology of achieving the same goals. Thus, the \"Z-mat\"and \"Z-Optim\"packages from Northwest Numerics, Inc., have been utilized to extract the non-linear constitutive response from the available experimental data in an integrated and automated manner and in conjunction with the ANSYS/Mechanical infrastructure. The automation lies on the fact that the process automatically generates the code of a \"USERMAT\"subroutine that it can be subsequently used with any geometry and loading specification definable within the limits of ANSYS' non-linear element library. The geometry of the single notched specimen of NRL's In Plane has been used for developing and verifying the process.\""
  },
  {
    "title": "Transient Behavior of a Polymer Fill Material with Time Dependent Viscoelastic Properties",
    "author": "John Thompson, Steven Groothuis, Hong Tang, Paul Koeneman",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/56.pdf",
    "description": "\"In an effort to simplify the implementation of viscoelastic material models into ANSYS, an ANSYS User-Programmable Feature (UsrFictive) has been modified to allow a more practical definition of viscoelastic material parameters. Standard ANSYS input of material data may be based upon temperature. Currently, ANSYS material data may not be a function of any other parameter. Many polymers used in industry are initially liquid and must be “cured” in a manufacturing process. This fact means that the properties will change over time. This application demonstrates one method of implementing a curing process simulation for a viscoelastic polymer.\"\n[ANSYS Nonlinear, version 6.?] "
  },
  {
    "title": "Transient Thermal Analysis of Spot Welding Electrodes",
    "author": "K. S. Yeung, P. H. Thornton",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/ARTICLE1.pdf",
    "description": "\"The accurate thermal simulation of a spot welding electrode cap could permit critical design parameters to be identified for improved electrode life. In this study, a parametric model has been developed to predict the transient thermal behavior of a typical spot welding electrode cap. The model employs the technique of conjugate heat transfer analysis to avoid the problem of estimating a value for the heat transfer coefficient that arises with conventional heat transfer analysis.\""
  },
  {
    "title": "Transmission of Mechanical Stresses within the Cytoskeleton of Adherent Cells: a Theoretical Analysis Based on a Multi-Component Cell Model",
    "author": "Philippe Tracqui and Jacques Ohayon",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/Tracqui_AB_04.pdf",
    "description": "\"We investigate here the spatial distributions of intracellular stresses when adherent cells are probed by magnetic twisting cytometry. The influence of the cell nucleus stiffness on the simulated nonlinear torque-bead rotation response is analyzed by considering a finite element multi-component cell model in which the cell and its nucleus are considered as different hyperelastic materials. We additionally take into account the mechanical properties of the basal cell cortex, which can be affected by the interaction of the basal cell membrane with the extracellular substrate. In agreement with data obtained on epithelial cells, the simulated behaviour of the cell model relates the hyperelastic response observed at the entire cell scale to the distribution of stresses and strains within the nucleus and the cytoskeleton, up to cell adhesion areas. These results, which indicate how mechanical forces are transmitted at distant points through the cytoskeleton, are compared to recent data imaging the highly localized distribution of intracellular stresses.\"[ANSYS Nonlinear, version 6.0]"
  },
  {
    "title": "Underfill Constraint Effects during Thermo-Mechanical Cycling of Flip Chip Solder Joints",
    "author": "I. Dutta, A. Gopinath, and C. Marshall",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/SolderTMC.pdf",
    "description": "\"The presence of an 'underfill' encapsulant between a micro-electronic device and the underlying substrate is known to substantially improve the thermal fatigue life of flip-chip solder joints, primarily due to load-transfer from the solder to the encapsulant. In this study, a new single joint-shear (SJS) test, which allows the measurement of the strain response of an individual solder ball during thermo-mechanical cycling (TMC), has been utilized to investigate the impact of the constraint imposed by the underfill on a solder-joint. Finite element modeling has been utilized to demonstrate that the SJS sample geometry captures most of the deformation characteristics of a flip-chip joint, and to provide insight into the experimental observations.\""
  },
  {
    "title": "Understanding Accuracy and Discretization Error in an FEA Model",
    "author": "Jon Pointer",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/54.pdf",
    "description": "\"The often-ignored topic of mesh discretization error is examined to identify a simple set of rules that the average user can enlist to determine solution accuracy. The sources of discretization error are explained, tools to quantify it are introduced and an example is given. The purpose is to bring an understanding of these issues and usable tools to the common user who is not proficient in the mathematical basis of FEA.\"\n\n[ANSYS 7.1, 2004 Conference]"
  },
  {
    "title": "Understanding Lagrange Multipliers [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/STI07_Lagrange_Multipliers.pdf",
    "description": "\"Lagrange multipliers are a general term used in different areas of ANSYS, specifically contact and element formulation. This memo hopes to provide the user with a simplified introduction to the most important concepts in using elements with Lagrange multipliers, in hopes that some of the element options and solver selection can be better understood.\nCurrently, at ANSYS 6.0, the node-to-node gap element CONTA178 and the Mixed U-P formulation of the 18x elements (i.e., KEYOPT(6)>0) utilize Lagrange multipliers, so the discussion will focus on these elements.\""
  },
  {
    "title": "Understanding the Response Surface Method in DesignXplorer [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI05_DesignXplorer.pdf",
    "description": "\"ANSYS DesignXplorer enables the user to perform optimization studies based on multiple objectives, to account for uncertainties in product design and use, and to determine how best to improve product reliability. These tasks are accomplished through the use of response surfaces, and this memo hopes to cover some of the basics of DesignXplorer operation.\""
  },
  {
    "title": "Undocumented Hyperelastic Material Models at 5.7-6.1 [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI06_Undocumented_Hyperelastic_Models.zip",
    "description": "\"From 5.7, the 18x series of elements support a variety of hyperelastic constitutive models, namely general polynomial, Mooney-Rivlin, Neo-Hookean, Arruda-Boyce, and Ogden. Four other models have been included in 5.7 onwards, although these are undocumented options for TB,HYPER. These four models consist of the Yeoh and Gent models for incompressible behavior and the Hyperfoam and Blatz-Ko options for compressible rubbers. This memo hopes to provide a summary of these material models and of the required input.\""
  },
  {
    "title": "Use Of Finite Element Analysis To Simulate The Hyperelastic Behaviour Of Cardiovascular Tissue [PDF]",
    "author": "S. Daly, P.J. Prendergast, F. Dolan, T.C. Lee",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/cardiovascular.pdf",
    "description": "Examination of Mooney-Rivlin."
  },
  {
    "title": "User Implemented Nitinol Material Model in ANSYS",
    "author": "Peter R. Barrett and Daniel Fridline",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/ansys_nitinol_paper.pdf",
    "description": "\"Nitinol is an acronym for NIckel TItanium Naval Ordinance Laboratory since the alloy was originally developed at the Naval Lab. It is used to describe a family of materials, which contain a nearly equal mixture of nickel and titanium. Nitinol alloys are attractive to the medical device industry because they are biocompatible and when processed correctly, are at their optimum superelastic behavior at body temperature.\n\"Nitinol exhibits a different stress-strain curve for loading and unloading that cannot be modeled with existing material models in ANSYS. This paper describes the implementation of a unique user material model in ANSYS that simulates the nitinol superelastic behavior. Example analyses are provided demonstrating the application of this material model for medical implant devices called stents.\"[ANSYS Nonlinear, version unspecified]\nNote that TB,SMA allows users to access built-in shape memory alloy constitutive model in ANSYS. "
  },
  {
    "title": "User-Defined Creep Laws with USERCREEP [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/STI0704_USERCREEP.zip",
    "description": "\"ANSYS provides 13 creep equations for use with implicit creep – these range from the simple Norton law to the hyperbolic sine form to the Blackburn model to a rational polynomial expression, to name a few – that can be used to model a range of creep behavior for metals. The TBFT command provides curve-fitting functionality for the user wishing to evaluate creep material parameters from test data. Also, the user can model anisotropic creep as well as combine implicit creep with rate-independent plasticity to model a wide range of complex material response.\nDespite this wealth of features, however, one may wish to incorporate one’s own creep law into ANSYS. For example, a company may have their own creep equation with material parameters already defined and validated through testing. The built-in creep laws in ANSYS assume creep used in design rather than failure analysis, so the available creep laws are meant to model primary and secondary creep – consequently, another need to incorporate a user-defined creep law would arise when a user wants to include tertiary creep and/or to evaluate creep damage.\nThis memo will hope to address some aspects of writing one’s own user-defined creep law with the USERCREEP.F subroutine to address this issue.\"\nExample using Anand's model."
  },
  {
    "title": "User-Defined Hyperelasticity with USERHYPER [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI0703_USERHYPER.zip",
    "description": "\"User-Programmable Features (UPFs) are an extremely useful feature for analysts that need additional advanced functionality, especially in the area of constitutive modeling.\nTB,HYPER allows users to include many incompressible and compressible hyperelastic material behavior – Ogden, Arruda-Boyce, Gent, Yeoh, Blatz-Ko are but some of the available models. However, for those wishing to use a customized strain energy function, the USERHYPER.F subroutine is available.\""
  },
  {
    "title": "User-Defined Output with USEROUT.F [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/STI0806_USEROUT.zip",
    "description": "\"There are various situations where a user may wish to define specific type of output to postprocess — this can range from simple evaluation of safety factors to more involved damage calculations. While APDL, the ANSYS command language, allows users to manipulate results in any manner one sees fit, user-programmable features (UPFs) also provide a means for users to calculate specific output results efficiently at the solution level.\"\nExample of calculating fatigue and Cap (Extended Drucker-Prager) output."
  },
  {
    "title": "Using Abbreviations to Customize the Toolbar [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/STI03_Customizing_Toolbar.pdf",
    "description": "\"The ANSYS Toolbar provides a useful means of accessing commonly-used functions, especially for users who use the GUI rather than typing in commands.\"\n\n\"This memo hopes to provide a brief introduction to the ANSYS Toolbar and, more importantly, how to assign macros or specific dialog boxes to the Toolbar buttons, including Fnc_ UIDL granules or ~eui Tcl/Tk dialog boxes.\""
  },
  {
    "title": "Using CMS in Workbench Simulation [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/STI0701_CMS_in_Simulation.zip",
    "description": "\"At Workbench 11.0, the ANSYS Rigid Dynamics add-on module enables users to model complex kinematic assemblies, whereby system-level performance as well as accurate force loading on components can be obtained.\n    Although the parts in the assembly may initially be considered rigid, an interesting, related method is the use of component mode synthesis (CMS) to account for the flexibility of parts. This memo will attempt to cover a way in which users can incorporate CMS in their multibody analyses in Workbench Simulation.\"\n[For version 12.0, use supplied \"cms_use_v12.mac\"instead of \"cms_use.mac\"- courtesy of D. Creech.]"
  },
  {
    "title": "Using PSOLVE [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/STI08_PSOLVE.zip",
    "description": "Although most often used for large-deflection prestressed modal analyses, PSOLVE has other applications which make it attractive to use, especially for large models.\n\nPSOLVE can be used for the following situations:\n\nPrecise mass calculations\nDetailed listing of contact pair information\nEvaluation of tabular boundary conditions and loads\n\nSince PSOLVE is a partial solution (namely, calculation of element matrices), it is usually much faster than performing an actual solution. Hence, the user may obtain any (or all) of the above three types of information prior to running an actual analysis, which can be a valuable way of verifying model input and settings prior to solution.\n\n(Week 20, week of 07/14/02.)"
  },
  {
    "title": "Using a Heat Transfer Analogy to Solve for Squeeze Film Damping and Stiffness Coefficients in MEMS Structures",
    "author": "Dale Ostergaard, Jan Mehner",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/mems-thermal-analogy-fsi-damping.pdf",
    "description": "This paper provides background information on using a heat transfer analogy to solve the Reynolds equation (squeeze film damping). Although ANSYS now has FLUID136 and FLUID138 to solve such problems, this paper can be useful in gaining a better understanding of these types of analyses."
  },
  {
    "title": "Using the Radiosity Solver in Workbench Simulation [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI0603_Radiosity_Solver_Simulation.pdf",
    "description": "Please note that in Workbench Mechanical 12.1, surface-to-surface radiation (using the Radiosity Solution Method) has been introduced in the GUI, so this memo is obsolete if you use version 12.1 and higher.\n\"Radiation can play an important role in heat transfer analyses. In Workbench Simulation 10.0, a “Radiation” load has been added to allow users to account for losses to the surroundings, although this does not include radiation exchange between surfaces.\n    For users wishing to utilize the ANSYS surface-to-surface radiation capabilities, this memo hopes to introduce an easy method to include these effects within Workbench Simulation via Named Selections and Command objects.\n  This type of methodology can be extended to include any other advanced solution feature of ANSYS which the user may wish to incorporate inside of Workbench Simulation.\""
  },
  {
    "title": "Using the WB Simulation Remote Solution Manager [PDF]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI01_Remote_Solution_Manager.pdf",
    "description": "\"Workbench Simulation has the ability to allow the user to solve multiple jobs locally or remotely. These capabilities are defined within the \"Solution” branch of WB Simulation as well as in the WB Remote Solution Manager.\n \"This memo hopes to introduce this capability, especially with regards to solving multiple jobs locally on a Windows machine.\"\n(Week 33, week of 04/02/06.)"
  },
  {
    "title": "VM256 with Workbench Mechanical",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/vm256.zip",
    "description": "Created a Workbench 12.0 version of VM256.\nUseful for users who may wish to get a better understanding of implementing the CINT command inside of Workbench Mechanical for J-integral and stress intensity factor calculations."
  },
  {
    "title": "VM267 with Workbench Mechanical",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/vm267.zip",
    "description": "Created a Workbench 12.0 version of VM267.\nUseful for users who may wish to get a better understanding of implementing the CINT command inside of Workbench Mechanical for stress intensity factor calculations."
  },
  {
    "title": "Various MEMS Examples Using ANSYS [ZIP]",
    "author": "(EPFL, The Swiss Federal Institute of Technology Lausanne)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/EPFL_Tutorial.zip",
    "description": "Tutorials on using ANSYS with various MEMS examples. This was originally taken from EPFL's website."
  },
  {
    "title": "VectorRotation.zip",
    "author": "Bob Weathers (Trane)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/VectorRotation.zip",
    "description": "\"These macros rotate a matrix of vectors from one set of Euler angles to another. One macro creates the rotation matrix and a second does the rotation. To test the macros, a pressurized cylinder (or optionally a sphere) is built, meshed, and solved in 6 different coordinate systems. To check accuracy, results are rotated from one CSYS to another by the macros and then compared to ANSYS. Set your text editor's tab stops to 2 for macro readability.\"\n\nIn the zip file, \"zTestRotationVector.mac\"is the test model macro, and \"zRotateVector.mac\"is the main macro to rotate vectors.\n\nUpdate 02/07/2009: correction to zRotateVector.mac provided by David Creech."
  },
  {
    "title": "Vibration Prediction in Switched Reluctance Motors With Transfer Function Identification From Shaker and Force Hammer Tests",
    "author": "Zhangjun Tang, Pragasen Pillay, and Avoki M. Omekanda",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/10.pdf",
    "description": "\"A vibration prediction model for the switched reluctance motor is constructed in this paper. Shaker and force hammer tests for vibration measurement are used for measuring crucial parameters like modal frequency and damping ratio for the transfer function. A detailed lookup table of normal force versus phase current and rotor angle is constructed based on finite-element calculations. The model is then verified by experiments, with acceptable accuracy.\"\n[ANSYS Low-Frequency Electromagnetics, version unspecified]"
  },
  {
    "title": "Viscoelastic Properties of Filled Rubber. Experimental Observations and Material Modelling",
    "author": "Bohdana Marvalova",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/marval_inzen_mech2007.pdf",
    "description": "\"The paper presents an application of a phenomenological material model for a viscoelastic stress response at large strains. The model is used for the simulation of carbon-black filled rubber in monotonic and cyclic deformation processes under isothermal conditions. The material stress response is decomposed into two constitutive parts which act in parallel: an elastic equilibrium stress response and a rate-dependent viscoelastic overstress response. The response of a particular filled rubber in the cyclic and relaxation tests was measured experimentally. The parameters of the constitutive functions are determined from the experimental data by an identification process employing nonlinear optimization methods. The paper concludes with a simulation by FEM of the cyclic loading of a simple rubber specimen.\"\n[ANSYS Nonlinear, version 10] "
  },
  {
    "title": "Viscoelasticity",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/conflong_viscoel.pdf",
    "description": "Presentation on the viscoelasticity model, introduced in ANSYS 6.1, available for both hypo- and hyper-elasticity (part of the \"Advanced Analysis with ANSYS\"seminar during the 2002 User's Conference)."
  },
  {
    "title": "Viscoelasticity [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/STI0807_Viscoelasticity.zip",
    "description": "\"Viscoelastic constitutive models allow users to analyze the time-dependent relaxation or creep behavior of materials, including glass, polymers, solid rocket propellants, to name a few. One may view viscoelastic materials as containing an elastic and viscous component, similar to a spring and dashpot in series. This memo will introduce viscoelastic input in ANSYS and as well as cover curve-fitting procedures.\""
  },
  {
    "title": "Visualizing structural matrices in ANSYS using APDL",
    "author": "Aaron Acton (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/acton20081119-visualizing_matrices.pdf",
    "description": "\"This article presents a method of visualizing structural matrices used in finite-element analysis using ANSYS and the ANSYS Parametric Design Language (APDL). The information is intended to provide some insight into the nature of structural matrices used in finite-element codes. Some terms used in sparse-matrix arithmetic are discussed, and methods for calculating certain quantities are provided. A test model is constructed to demonstrate how the stiffness, mass, and damping matrices may be visualized for various systems. The effect of element shape, element type (including superelements), element reordering, and equation reordering on structural matrices is briefly investigated.\""
  },
  {
    "title": "Windows file association for ANSYS files [PDF]",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/Week_20_Windows_File_Association.pdf",
    "description": "How to associate database, graphics, and input files with ANSYS under Windows, so one can launch ANSYS more easily without the ANSYS launcher."
  },
  {
    "title": "Wire Bond Temperature Sensor",
    "author": "Shivesh Suman, Michael Gaitan, Yogendra Joshi, George Harman",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/IMAPS_Shivesh.PDF",
    "description": "\"This work reports the first demonstration of a bond pad test structure with embedded thermopile sensors for the measurement of the transient temperature response during the wire bonding operation. This paper will present the design and operation of the bond pad test structure and show and discuss temperature measurements during the wire bonding operation.\"\n[ANSYS Thermal, version unknown]"
  },
  {
    "title": "Workbench XML Material Format",
    "author": "ANSYS, Inc.",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/Material_XML.zip",
    "description": "ANSYS Workbench Engineering Data module (e.g., Workbench Simulation, Workbench FE Modeler) can import/export material data as XML files. These XML files utilize the MatML format, and this zip file contains an example. This can be useful for users wishing to generate their own material libraries in XML format outside of Workbench Engineering Data."
  },
  {
    "title": "acton20080825-condition_number.pdf",
    "author": "Aaron Acton (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/acton20080825-condition_number.pdf",
    "description": "\"This article presents an overview of the condition number for a matrix and the potential effect of ill conditioning on the solution of a system of linear equations. The information is intended to be general, although specific information relevant to finite-element analysis is also included. Vector and matrix norms are introduced before defining the condition number, and the choice of matrix norm in the calculation of the condition number is discussed. A method of estimating the condition number is also provided, including a sample implementation in the ANSYS Parametric Design Language (APDL).\""
  },
  {
    "title": "ansys25b.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ansys25b.pdf",
    "description": "ansys25b.pdf"
  },
  {
    "title": "ansys_news_1995_3.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/ansys_news_1995_3.pdf",
    "description": "ansys_news_1995_3.pdf"
  },
  {
    "title": "ansys_news_1995_4.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/ansys_news_1995_4.pdf",
    "description": "ansys_news_1995_4.pdf"
  },
  {
    "title": "ansys_news_1996_2.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/ansys_news_1996_2.pdf",
    "description": "ansys_news_1996_2.pdf"
  },
  {
    "title": "ansys_news_1996_3.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/ansys_news_1996_3.pdf",
    "description": "ansys_news_1996_3.pdf"
  },
  {
    "title": "ansys_short_course.pdf",
    "author": "Tim Langlais (University of Minnesota)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/ansys_short_course.pdf",
    "description": "A short course on ANSYS, using ANSYS 5.4."
  },
  {
    "title": "ansys_solutions_2002_winter.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/ansys_solutions_2002_winter.pdf",
    "description": "ansys_solutions_2002_winter.pdf"
  },
  {
    "title": "ansys_solutions_2003_fall.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/ansys_solutions_2003_fall.pdf",
    "description": "ansys_solutions_2003_fall.pdf"
  },
  {
    "title": "ansys_solutions_2003_spring.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/ansys_solutions_2003_spring.pdf",
    "description": "ansys_solutions_2003_spring.pdf"
  },
  {
    "title": "ansys_solutions_2003_summer.pdf",
    "author": "(ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/ansys_solutions_2003_summer.pdf",
    "description": "ansys_solutions_2003_summer.pdf"
  },
  {
    "title": "batch.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/batch.zip",
    "description": "This is an example of how to drag-and-drop a .db file onto a DOS batch file to initiate an analysis. \n\n Unzip the file and rename \"Run Nonlinear.txt \"to Run Nonlinear.bat\". Place it on your desktop. \n\n Place \"solve_batch.inp\"in your D: drive or edit \"Run Nonlinear.bat\"to change the location of this APDL input file. \n\n Drag and drop any .db file containing a ready-to-solve nonlinear analysis onto \"Run Nonlinear.bat\". \n\n You will find that the solution will initiate in the same working directory, and you can also track the nonlinear solution graphically as the solution is solving in batch. "
  },
  {
    "title": "boot.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/boot.zip",
    "description": "Old model originally created back in ANSYS 6.0. Recently tested and seems to solve fine as-is in ANSYS 12.1, so I expect all versions in-between should run fine, too. Hyperelasticity, self-contact, rigid-deformable contact are present. Animation of same model (with finer mesh) is on the gallery page."
  },
  {
    "title": "closed_tank.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/closed_tank.zip",
    "description": "Comparison of FLUID30 (acoustic fluid element) and FLUID80 (contained fluid element) for sloshing in a tank."
  },
  {
    "title": "creating Custom Animations [ZIP]",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/3/STI01_Creating_Custom_Animations.zip",
    "description": "\"Animations are quite useful, both in presenting results of an analysis to others as well as obtaining better insight into the complex response of a system. While ANSYS has many built-in animation capabilities, sometimes, it may be necessary to create a macro for a customized animation. This memo covers one method of generating such animations.\""
  },
  {
    "title": "dakota.zip",
    "author": "Dave Lindeman (3M)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/dakota.zip",
    "description": "\"I recently experimented with coupling ANSYS and DAKOTA, and thought the list might be interested in the results. DAKOTA, if you're not familiar with it, is a public-domain optimization code available from Sandia National Laboratories (see http://endo.sandia.gov/DAKOTA/). It has several advanced optimization algorithms (e.g., genetic algorithms), supports discrete variables, and has several other features that make it a nice complement to the optimization and probabilistic design modules within ANSYS. And it's FREE.\n\n\"Anyways, the procedure for using DAKOTA with ANSYS consists of creating a DAKOTA input file (DAKOTA in the attachments) that identifies the design variables, state variables, optimization method, etc. Also, within this file you identify the command to be issued to execute the code you are using to generate the response variables (analysis_driver = 'ansys.prl', in the attached example). To execute ANSYS I use an intermediate Perl script (ansys.prl) that translates the design variable file generated by DAKOTA (parameters_file = 'dakota.dv') into something ANSYS can understand (written out to ansys.dv). The Perl script then executes ANSYS. Note that the Perl script is general purpose -- it should work for any application. The only thing you should need to change is filenames, in particular the name of your ANSYS script (in my example, 'ANSYS'). The ANSYS script reads in the design variable file using /INPUT, performs the analysis, then outputs the result variables to a file (results_file = 'dakota.rv') using *CFOPEN and *VWRITE.\n\n\"To execute the analysis you use (for example) the command line: dakota -i DAKOTA > dakota.log &\n\n\"That's pretty much it. Pretty straightforward once you figure out the DAKOTA input file syntax. The attached example is the simple beam optimization problem used in the ANSYS documentation.\""
  },
  {
    "title": "demotlbr.zip",
    "author": "(PADT)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/demotlbr.zip",
    "description": "\"To use this demonstration of the ANSYS toolbar capabilities extract these files to your working directory. You must then copy the tlbrlist61.ans file from the ANSYS installation docu/english/tlbrlist61.ans to your working directory. Add DEMO.TLB to the bottom of the file. Run ANSYS and then move the split bar at the bottom up to show the bottom pane where the demo toolbar is embedded.\"\n Example showing how to customize the ANSYS 6.1 Toolbar."
  },
  {
    "title": "elastdata_Unix.zip",
    "author": "Hursha Narayan (Robert Bosch Corporation)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/elastdata_Unix.zip",
    "description": "Macro for a fully automated procedure for calculating M-R coefficients from Test Data\n\"I have developed a macro that fully automates the importing of elastomer test data into ANSYS and calculate the Mooney-Rivlin coefficients. The macro uses Lagrange interpolation technique to calculate the stress data at equal intervals of strain. This can then be read into an array in ANSYS to evaluate the M-R coeffs. I'm sending you Windows and Unix version of the macro. The difference between the two versions are in the awk and script files that I use to manipulate data. The user needs to go through all the files just to change the directories where the files will be located and accessed. The files reformat(Unix) and reformat.csh(windows) should have rwx permissions. The reformat.csh used in windows can be converted to a batch file. Awk utility should be available under windows. The procedure expects Simple Tension, Planar Tension and Biaxial Extension data to be available.\""
  },
  {
    "title": "expansion.pdf",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/expansion.pdf",
    "description": "This is a description of an ANSYS Workbench 13.0 project and the use of the HSFLD242 (hydrostatic fluid) element. It is a fictitious model of the expansion of a tire and subsequent displacement-loading to a rigid surface (e.g., ground)."
  },
  {
    "title": "grph2svg.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/5/grph2svg.zip",
    "description": "This is a quick hack I did to generate SVG files from within ANSYS. There are 3 macros contained in the zip file: GRPH2SVG.MAC is the main one, and the other two are called by GRPH2SVG.\n\n The macro redirects the plot to an ANSYS Graphics file \"stiplot.grph\". Then, the macro parses through the GRPH file and generates an SVG file called \"stiplot.svg\". You can change the font, font size, etc. as you see fit from within the macro. (For details on the contents of the GRPH file, refer to the ANSYS Programmer's Guide for details.)\n\nBecause this parses the GRPH file from within ANSYS, it is slow for complex plots, so I recommend using it only for XY plots — this is only meant to serve as an example of what can be done with APDL and reading the GRPH file contents. Also, I did not bother including support for raster graphics - this macro only supports vector graphics. (If you want raster graphics, use of PNG is better. SVG is really a vector graphics implementation.)\n\nIf you're running Firefox, or if you use Internet Explorer and have the Adobe SVG Viewer Plug-in, you can see a sample contour plot and sample XY plot generated from this macro.\n\nBecause this was created by hand, there may be mistakes - you can let me know if you encounter any. Otherwise, instead of using this macro, you can create an EPS file and use your favorite illustration software to convert it to an SVG file."
  },
  {
    "title": "harmonic_and_random.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/harmonic_and_random.zip",
    "description": "This zip file contains a simple example - single input PSD table for base excitation of a fictitious structure - run as both random vibration and harmonic response analyses. The user can review the contents of the two input files and see how one can relate harmonic analyses (the transfer function) to the response PSD in random vibration analyses. (Actually, one can also look it up in any dynamics textbook, but this just shows how one can do it in ANSYS.) \r\n \r\n (See also TFUN undocumented command to get the transfer function after a random vibration analysis.)"
  },
  {
    "title": "harmonic_cms.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/harmonic_cms.zip",
    "description": "Simple beam example showing procedure for using CMS (component mode synthesis). Same results for the full model (no CMS) and the CMS model."
  },
  {
    "title": "icpkg.zip",
    "author": "Steve Groothuis (Micron Technology, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/icpkg.zip",
    "description": "\"An example of IC package assembly using element birth and death - a simple 5-step die attach, injection molding, and cool-down processes during IC packaging. (compliments to Bill Bulat on concept)\"\r\n Unzip the file and read in \"icpkg.inp\"."
  },
  {
    "title": "impedance.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/impedance.zip",
    "description": "Example of the use of complex impedance at a surface, which is a new feature in version 13.0 (for 3D FLUID30, FLUID220, FLUID221 acoustic elements). This is a radiating monopole source. Comparison with infinite FLUID130 shows same results with appropriate value of SF,,IMPD defined."
  },
  {
    "title": "inistate.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/8/inistate.zip",
    "description": "This is a very simple example using Workbench Mechanical 12.0.1 to demonstrate use of the INISTATE command in defining initial stress. \r\n Open Workbench 12.0.1 (or 12.1) and use \"File > Restore Archive ...\"and select the zip file to open the model. Solving should take less than a minute. \r\n  The model is a simple bar. The first analysis branch has 10e3 psi initial stress only in the x-direction. Notice that the block is free to expand - it only has symmetry boundary conditions. The final results show basically zero stress and displacement of -8.1455e-4 inches. Since initial stress is 10e3 and elastic modulus is 29e6 with a length of 2.3622 inches: \r\n 10e3 / 29e6 * 2.3622 = 8.1455e-4 \r\n which is the same answer as given by ANSYS. \r\n \r\n The second analysis branch also has 10e3 psi initial stress only in x-direction. However, there is a Frictionless Support preventing the block from expanding. Final results show displacement basically of zero, and stress of 10e3 psi. This is because the initial stress cannot relax due to the boundary conditions, so the final stress = initial stress in this particular case."
  },
  {
    "title": "instantaneous_secant_TCE.zip",
    "author": "Bill Bulat (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/instantaneous_secant_TCE.zip",
    "description": "Macro to convert instantaneous thermal coefficients of expansion to secant values, with example input file. (This is a zipped file)"
  },
  {
    "title": "matlab.zip",
    "author": "Rick Morgans (Adelaide University)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/matlab.zip",
    "description": "\"On this subject, I've been meaning to post these for ages -> we've been using these macros to transfer variables between ansys and matlab for yonks. They write and read variables from ansys and matlab -> you can check them out to see how they do it (i.e. I cant remember off of the top of my head) -> I think they write out a format header then write the rest of the variable as a single column.\n\nvarread.m\nread variable into matlab\n\nvarread.mac\nread variable into ansys\n\nvarreadc.m\nread 2 column ansys variable into matlab as a complex variable\n\nvarreadcp.m\nread \"packed\"2 column variable into matlab as complex variable\n\nvarreadp.m\nread \"packed\"variable into matlab\n\nvarreadp.mac\nread \"packed\"variable into ansys\n\nvarwrite.m\nwrite a variable from matlab\n\nvarwrite.mac\nwrite a variable from ansys\n\nvarwritep.mac\nwrite a variable from ansys in \"packed\"format using a vmask\""
  },
  {
    "title": "muffler.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/muffler.zip",
    "description": "This memo provides basic instruction on performing acoustic analyses in Workbench Mechanical 14.0. An example of calculation of transmission loss in a muffler is demonstrated."
  },
  {
    "title": "nonlinear_problems_of_steel_civil_structures.pdf",
    "author": "Milan Vasek",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/nonlinear_problems_of_steel_civil_structures.pdf",
    "description": "\"The civil engineering structures are today designed with respect to the limit state of serviceability and limit states of the strength and stability. The design of more efficient and light structures leads to the nonlinear analysis of deflections and stresses. Some parts of structure could reach the yield point under the design load. Some parts of structure could lose their local stability. These complex problems of a different nature are possible to solve by FEM methods.\""
  },
  {
    "title": "penny3d.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/penny3d.zip",
    "description": "Simple example using ANSYS Workbench 12.0 to show one way to generate a penny-shaped crack (3D crack) for fracture mechanics (using CINT command to evaluate J-integral and stress intensity factors)."
  },
  {
    "title": "prony.zip",
    "author": "John Thompson (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/1/prony.zip",
    "description": "Macro to do curve-fitting for TB,PRONY constants for given relaxation data.\n[STI: Note that, at 8.0 and above, curve-fitting of TB,PRONY is directly available in ANSYS with the TBFT command.]"
  },
  {
    "title": "roller.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/roller.zip",
    "description": "Simple example of a hollow metal pipe being bent by rollers. Rigid-deformable contact, metal plasticity, use of Joints (MPC184) are in the Workbench Mechanical 12.1 model."
  },
  {
    "title": "siysdcap",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/siysdcap.zip",
    "description": "Tip on visualizing the Drucker-Prager Cap model yield surface."
  },
  {
    "title": "sprs_mprs.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/0/sprs_mprs.zip",
    "description": "The attached zip file includes a simple example demonstrating the procedure to perform a single-point response spectrum (SPRS), where the excitation in 3 direction is applied together (using SRSS combination), not independently. The procedure for multi-point response spectrum (MPRS) is included as well for the same situation. An Excel spreadsheet shows that the results obtained for this simple model is the same for both methods (compare the mode coefficients for each squared mode in the spreadsheet)."
  },
  {
    "title": "substr-fullpost.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/2/substr-fullpost.zip",
    "description": "Fictitious model used to demonstrate substructuring. SETRAN and SESYMM are used to translate and reflect a superelement. RSPLIT and RSTOFF are also used, and postprocessing of the entire model (superelements and non-superelements) is shown."
  },
  {
    "title": "user01.zip",
    "author": "Sheldon Imaoka (ANSYS, Inc.)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/4/user01.zip",
    "description": "Very simple example showing use of user-defined command (USER01).\n\nThis UPF command simply reads and interpolates a defined table array. Use of the parevl() is also shown in this simple input."
  },
  {
    "title": "usermat.pdf",
    "author": "unknown",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/6/usermat.pdf",
    "description": "Document describing the USERMAT user material subroutine."
  },
  {
    "title": "week25-ETABLE.pdf",
    "author": "Sheldon Imaoka (CSI)",
    "url": "https://github.com/affinitylinks/ansys.net/blob/main/7/week25-ETABLE.pdf",
    "description": "Short description on the usage and features of element tables in ANSYS."
  }
]
